emacs-config.org
#+PROPERTY: header-args :results silent :tangle ./dotemacs.el 
#+toc: t
#+hugo_base_dir: ~/hugo-sr/
#+hugo_section: docs
#+hugo_auto_set_lastmod: t
#+author: Shreyas Ragavan
#+hugo_tags: Emacs config dotemacs
#+hugo_categories: Emacs
#+hugo_menu: :menu "docs" :weight 2001 :parent "Emacs"
#+hugo_custom_front_matter: :linktitle Dotemacs - Emacs config  :toc true
#+hugo_draft: false
#+TITLE: shrysr's Dotemacs

* Introduction

I've been using my own configuration on top of the excellent Scimax for
the past many years. This is a reboot to reverse the bias, and create my
very own emacs configuration. It obviously includes massive snippets of
code from scimax, as well as other configurations I come across, not to
mention the excellent advice often received from #emacs and other
geniuses lurking in irc channels, and of course the vast
internet.

#+BEGIN_QUOTE
Note that this config is still under a great deal of flux at the
moment and will be for the foreseeable future. I am learning elisp
every (other) day and am rather obsessed like most Emacsers to
optimise the entire toolset. This is an an opinionated setup.

I would recommend studying the setup and using bits and pieces of it
as you require, because one primary power of Emacs is being able to
customise your tool to your needs. However, the eventual goal will
also be to enable using this configuration as a whole for anybody
interested.

#+END_QUOTE

** Overall setup

This file is ~emacs-config.org~. This is the source of truth for the
entire config. It is tangled into 2 files, an init.el and a dotemacs.el.

The init.el file is included in the git commit as it will (eventually)
enable starting up emacs with basic libraries, and loading (and if
necessary tangling) this config if one is starting from scratch on a new
machine.

Due to the above - it is important to be careful with using header
arguments for source blocks. As per current Org mode features,
specifying the header arguments, even a ~:tangle yes~, will over-ride
the file settings specified elsewhere and thus parts of the config will
never get inserted into the el files that are loaded during init.

The better method to disable tangling of specific blocks would be to
comment out Org headings. It should also be possible to have a setup
wherein headings with specific tags are not tangled, similar to the
noexport tag option with typical org exports. The caveat of using this
option is that these headings will be neglected in an export to say,
something like a Hugo document. 

Package management is done via the interesting straight.el. There are
other approaches like borg, using quelpa and so on that I have not
tried. However, the point is that it is better to rely on git to draw
packages rather than MELPA, which can be frustrating at times.

The last 2 headlines contain a 'Testing Area' and 'Disabled'
headline. This contains all the packages that are yet to be a part of my
main setup, or packages that I use occasionally and activate when I
need to. These are available in the raw org file in the repository of
the configuration.

General notes:
- I was initially using a single init.org file that tangled to an
  init.el file. This kind of setup makes it hard to make meaningful
  commits, especially if the init.el is also a part of the visible
  commits. After all one caveat here is still that ~some external
  library is necessary to tangle these org files into elisp files for
  loading emacs.
- I would prefer not using git hooks for the tangling because my commit
  workflow is still erratic. Sometimes, there is no change in code, but
  just some additional notes to the configuration. 

** Inspirations (and other literate configurations)

This is a growing and non-comprehensive list of configurations that I
admire and have liberally copied from in constructing my own.

- [[http://doc.norang.ca/org-mode.html][Bernt Hansen's very detailed Org-mode config]]
- [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua]]
- [[https://github.com/angrybacon/dotemacs/blob/master/dotemacs.org][Mathieu Marques]]
- [[https://writequit.org/org/][Lee Hinman]]
- [[https://karl-voit.at/2017/06/03/emacs-org/][Karl Voit]]
- [[https://dustinlacewell.github.io/emacs.d/][Dustin Lacewell]]
- [[https://github.com/wasamasa/dotemacs][GitHub - wasamasa/dotemacs: Literate Emacs configuration]]
- [[https://github.com/IvanMalison/dotfiles][GitHub - IvanMalison/dotfiles: Configuration files for XMonad, Emacs, NixOS, Taffybar and more.]]

In general - code and snippet source references are added as and when
possible though this is a tedius task for those with configurations
under a great rate of flux.

** TODO Packages I've found very useful

Though I'm using a huge number of packages - this list reflects the
absolute core that I consider to be essential to my current /daily/
workflow. This list is being formulated so that I can develop a minimal
Emacs config that can be used for a rapid setup on a headless server.

1. org-download
2. org-web-tools
3. org-ref
4. treemacs
5. eyebrowse
6. projectile
7. org-projectile
8. counsel + ivy + swiper
9. Helm (some functions)
10. magit
11. hydra (and other variants)
12. straight.el

* Init setup
:PROPERTIES:
:header-args: :tangle ./init.el
:END:

This part of the config has to be tangled to init.el so that straight
and use-package can be setup. This is a separate init file as it is
expected to remain stable and will be the only .el file that is in git
commit.

** Lexical Scope and binding
:PROPERTIES:
:ID:       3CBA7F73-C58D-4B9F-9B9E-3E02B52F6890
:END:

A reasonable explanation of the importance of lexical binding is available [[info:elisp#Lexical%20Binding][in the elisp manual]]. This is essentially similar to the quoted or unquoted variables in R.

#+BEGIN_QUOTE
A lexically-bound variable has lexical scope, meaning that any reference to the variable must be located textually within the binding
construct.
#+END_QUOTE


   #+BEGIN_SRC emacs-lisp
;;; -*- lexical-binding: t -*-
(setq-default lexical-binding t)
   #+END_SRC

** Garbage collection
- Note taken on [2020-04-09 Thu 18:09] \\
  As the doom emacs FAQ states - the GC collection has to be set back to
  normal as well.
- Note taken on [2020-04-02 Thu 22:11] \\
  Just increasing teh gc threshold seems to have reduced my init time by
  50% ! From ~7 seconds to 3.5s at the moment. This is found from
  (emacs-init-time). This is probably the fastest init time I have ever
  had.

References:
- [[https://github.com/wasamasa/dotemacs/blob/master/init.org#memory-management][dotemacs/init.org at master 路 wasamasa/dotemacs 路 GitHub]]
- [[https://github.com/hlissner/doom-emacs/blob/665b627b7c07c8d29ec8d334588cecc2ba308248/docs/faq.org#how-does-doom-start-up-so-quickly][doom-emacs/faq.org  路 hlissner/doom-emacs 路 GitHub]]

- [ ] There are additional options that can be tried on this
  subject. Like garbage collection when focus is lost from
  Emacs. The doom docs claim this is done via the gcmh package.

#+BEGIN_SRC emacs-lisp
(setq gc-cons-threshold most-positive-fixnum ; 2^61 bytes
      gc-cons-percentage 0.6)

(add-hook 'emacs-startup-hook
  (lambda ()
    (setq gc-cons-threshold 16777216 ; 16mb
          gc-cons-percentage 0.1)))

;; Raising gc-cons threshold when the minibuffer is active

(defun doom-defer-garbage-collection-h ()
  (setq gc-cons-threshold most-positive-fixnum))

(defun doom-restore-garbage-collection-h ()
  ;; Defer it so that commands launched immediately after will enjoy the
  ;; benefits.
  (run-at-time
   1 nil (lambda () (setq gc-cons-threshold 16777216 ; 16mb
          gc-cons-percentage 0.1) )))

(add-hook 'minibuffer-setup-hook #'doom-defer-garbage-collection-h)
(add-hook 'minibuffer-exit-hook #'doom-restore-garbage-collection-h)
#+END_SRC

#+RESULTS:
| doom-restore-garbage-collection-h | pl/minibuffer-exit |

** Package management

*** Straight
:PROPERTIES:
:ID:       A1B35506-B602-4344-9F49-2BD76C932C78
:END:

This snippet essentially bootstraps straight.el, which has several advantages over use-package, along with the ability to seamlessly work with use-package as well.

 By bootsrapping, this means that the straight package is downloaded to the user's emacs directory and compiled and installed. Unless set otherwise, the user's emacs directory is =~/.emacs.d=

 #+BEGIN_SRC emacs-lisp
 (let ((bootstrap-file (concat user-emacs-directory "straight/repos/straight.el/bootstrap.el"))
 (bootstrap-version 3))
 (unless (file-exists-p bootstrap-file)
 (with-current-buffer
 (url-retrieve-synchronously
 "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
 'silent 'inhibit-cookies)
 (goto-char (point-max))
 (eval-print-last-sexp)))
 (load bootstrap-file nil 'nomessage))
 #+END_SRC

 #+RESULTS:
 : t

*** Use-package integration with straight
:PROPERTIES:
:ID:       A970A1D7-083C-4982-A7A0-E026B9BFFE57
:END:

#+BEGIN_SRC emacs-lisp
(setq straight-use-package-by-default t)
(straight-use-package 'use-package)
(use-package git) ;; ensure we can install from git sources

#+END_SRC

 #+RESULTS:

** Some basic directory definitions 
:PROPERTIES:
:ID:       52D8055A-D99B-463C-8F97-056C068EDACD
:END:

#+BEGIN_SRC emacs-lisp
;; Base function to create the home directory
(defun sr/fun/homedir (foldername)
"Function to extract the home directory path"
  (expand-file-name foldername (getenv "HOME")))

;; Emacs directory defauling to .emacs.d
(defun sr/fun/emacs-dir (foldername)
"Function to prepend the project directory path to any folder. Starts from the home directory."
  (expand-file-name foldername (sr/fun/homedir ".emacs.d" )))
#+END_SRC

** Shorten yes or no
:PROPERTIES:
:ID:       4A052D85-5CA0-4703-94BD-693A88D89926
:END:

It is infuriating that this is not a default in emacs. Therefore this minor snippet is included in the init.

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

#+RESULTS:
: y-or-n-p

** Load main config
:PROPERTIES:
:ID:       CEBFC8FA-011A-4836-A815-9B00746EF8AE
:END:

#+BEGIN_SRC emacs-lisp
(load (sr/fun/emacs-dir "dotemacs.el"))
#+END_SRC

* .gitignore 
- Note taken on [2020-03-26 Thu 11:38] \\
  In this process, I realised that as long as there is a .gitignore file present (and not in a commit) and the specified files have never been in a commit - git automatically ignores these files. i.e there is no need to commit a .gitignore file.

#+BEGIN_SRC txt :tangle ./.gitignore
auto-save-list
autosaves
elpa
eshell
recentf
smex-items
sr-secrets.org.el
projectile-bookmarks.eld
bookmarks
ac-comphist.dat
.mc-lists.el
transient
elpy
tramp
url
dotemacs.el
org-journal.cache
request/
.cache/
var/
.lsp-session*
#+END_SRC

* Tangle Emacs config on save 
:PROPERTIES:
:ID:       EE52585C-C1D6-4759-94AE-CCECA01E5D41
:END:
** TODO Tangle on save without async
:PROPERTIES:
:ID:       47CCBB72-667B-4710-AF6F-32B9DEA32E89
:END:

As such the tangling hardly takes any time. [[https://thewanderingcoder.com/2015/02/literate-emacs-configuration/][Literate Emacs Configuration | Sean Miller: The Wandering Coder]] provides an example of setting up a function. This uses the buffer file name to tangle for the emacs config file. A hook is added to the save function to check. 

- [ ] Add a force tangle option if files do not exist. This is because, if for troubleshooting purposes, the el files are deleted, and there is no change in the org file, then the tangling does not take place at all. In general, it may be better to ensure the el files are deleted and tangled again.

#+BEGIN_SRC emacs-lisp
(defun sr/fun/tangle-on-save-init ()
(when (string= buffer-file-name (file-truename "~/.emacs.d/emacs-config.org"))
(org-babel-tangle)))

(add-hook 'after-save-hook 'sr/fun/tangle-on-save-init)

#+END_SRC

#+RESULTS:
| rmail-after-save-hook | backup-each-save | sr/fun/tangle-on-save-init |

** Local file variables

One way to do this is via local file variables, adding the following to the init file (or any file). However, it seems that this is not 'activated' by default.

#+BEGIN_EXAMPLE
# Local variables:
# eval: (add-hook 'after-save-hook (lambda () (org-babel-tangle)) t t)
# end:
#+END_EXAMPLE

** TODO Async function to tangle org file on save.

This is inspired from [[https://www.reddit.com/r/emacs/comments/5ej8by/asynchronous_tangle_and_compile_of_configorg/][Asynchronous tangle and compile of config.org(question/issue) : emacs]] on reddit and a work in progress. Since I am using straight.el, the byte compilation of packages is not necessary (or already taken care of). It is probably worth noting that the tangling process is almost instant and maybe this effort is not warranted.

(sr/fun/async-tangle-init)

#+BEGIN_SRC emacs-lisp :tangle no
(defun sr/fun/async-tangle-init () 
  (async-start
   (lambda ()
     (org-babel-tangle))
(message "Tangle async done")))

#+END_SRC

#+RESULTS:
: sr/fun/async-tangle-init

* Various directories
:PROPERTIES:
:ID:       252B8837-EE16-41C1-96C1-3F6C05D156BF
:END:

#+BEGIN_SRC emacs-lisp


(defun sr/fun/project-dir (foldername)
"Function to prepend the project directory path to any folder. Starts from the home directory."
  (expand-file-name foldername (sr/fun/homedir "my_projects" )))

(defun sr/fun/org-dir (foldername)
"Function to prepend the org directory path to any folder. Starts from the home directory."
  (expand-file-name foldername (sr/fun/homedir "my_org" )))

#+END_SRC

#+RESULTS:
: sr/fun/emacs-dir

* Auto-save
:PROPERTIES:
:ID:       6BBBB542-2501-4516-A138-692EC000CBC3
:END:

Copied from ldleworth's config. I think this makes sense for me at the moment. Here is a summary: 

- Setup auto-save for every file that is visited.
- Set the auto-save directory explicitly to save all the auto-saves in a single location.
  - The directory will be created if not available, and will be ignored for
    git.
- Use the autosave directory for backups as well. 
- [ ] Save every +20+ 60 seconds (experiment with the time frame)
  - This causes too much lag and has been disabled. 
- [ ] Backup on each save.
  - [ ] This uses a package. I am not sure whether this is necessary.
- Backup files even if version controlled
- [ ] Copy files to avoid various problems.
  - [ ] check whether this causes any lag with operating emacs.
- keep 10 versions of old backups and delete old backups.


#+BEGIN_SRC emacs-lisp
(setq auto-save-default t)
(setq auto-save-timeout 20
      auto-save-interval 60)

(defvar emacs-autosave-directory
(concat user-emacs-directory "autosaves/"))

(unless (file-exists-p emacs-autosave-directory)
(make-directory emacs-autosave-directory))

(setq auto-save-file-name-transforms
`((".*" ,emacs-autosave-directory t)))

(setq backup-directory-alist `((".*" . ,emacs-autosave-directory)))

(use-package backup-each-save
:straight t
:config (add-hook 'after-save-hook 'backup-each-save))

(setq vc-make-backup-files t)

(setq backup-by-copying t)

(setq kept-new-versions 10
kept-old-verisons 0
delete-old-versions t)

#+END_SRC

