emacs-config.org
* OS Level variables
:PROPERTIES:
:ID:       BE6ABB97-4B9A-4E2F-9D74-83F6AECF8A4D
:END:

Since I switch between a Linux machine and a Mac frequently, it is better to define variables that can be used to set other variables depending on the OS.

#+BEGIN_SRC emacs-lisp
;; Get current system's name
(defun insert-system-name()
  (interactive)
  "Get current system's name"
  (insert (format "%s" system-name))
  )

;; Get current system type
(defun insert-system-type()
  (interactive)
  "Get current system type"
  (insert (format "%s" system-type))
  )

;; Check if system is Darwin/Mac OS X
(defun system-type-is-darwin ()
  (interactive)
  "Return true if system is darwin-based (Mac OS X)"
  (string-equal system-type "darwin")
  )

;; Check if system is GNU/Linux
(defun system-type-is-gnu ()
  (interactive)
  "Return true if system is GNU/Linux-based"
  (string-equal system-type "gnu/linux")
  )

#+END_SRC

* Org-mode related

These have packages and settings that are mostly related to org-mode though there may be other settings that bleed in. org-babel has been given it's own section though it is org-mode related.

** Installing org and org plus contrib via straight
:PROPERTIES:
:ID:       1D103003-0690-4DD0-964C-2E5DCDEC1937
:END:
*** COMMENT Old
Reference: [[https://github.crookster.org/switching-to-straight.el-from-emacs-26-builtin-package.el/][Crookster's blog post]]

#+BEGIN_SRC emacs-lisp
;;______________________________________________________________________
;;;;  Installing Org with straight.el
;;; https://github.com/raxod502/straight.el/blob/develop/README.md#installing-org-with-straightel
(require 'subr-x)
(straight-use-package 'git)

(defun org-git-version ()
  "The Git version of 'org-mode'.
Inserted by installing 'org-mode' or when a release is made."
  (require 'git)
  (let ((git-repo (expand-file-name
                   "straight/repos/org/" user-emacs-directory)))
    (string-trim
     (git-run "describe"
              "--match=release\*"
              "--abbrev=6"
              "HEAD"))))

(defun org-release ()
  "The release version of 'org-mode'.
Inserted by installing 'org-mode' or when a release is made."
  (require 'git)
  (let ((git-repo (expand-file-name
                   "straight/repos/org/" user-emacs-directory)))
    (string-trim
     (string-remove-prefix
      "release_"
      (git-run "describe"
               "--match=release\*"
               "--abbrev=0"
               "HEAD")))))

(provide 'org-version)

;; (straight-use-package 'org) ; or org-plus-contrib if desired

(use-package org-plus-contrib
   :mode (("\\.org$" . org-mode))
   :bind
   ("C-c l" . org-store-link)
   ("C-c a" . org-agenda))
#+END_SRC

*** ldlework's alternative
- Note taken on [2020-03-30 Mon 20:24] \\
  The only addition is the installation of org-plus-contrib and setting the shortcuts for the agenda and link.
**** Fix org-git version
:PROPERTIES:
:ID:       9E872705-E3CD-4A1F-98B2-63406665656B
:END:

#+BEGIN_SRC emacs-lisp
(defun fix-org-git-version ()
"The Git version of org-mode.
Inserted by installing org-mode or when a release is made."
(require 'git)
(let ((git-repo (expand-file-name
"straight/repos/org/" user-emacs-directory)))
(string-trim
(git-run "describe"
"--match=release\*"
"--abbrev=6"
"HEAD"))))
#+END_SRC

**** Fix org release
:PROPERTIES:
:ID:       88C7834B-F216-43C5-A88A-0CA1A82D3365
:END:

#+BEGIN_SRC emacs-lisp
(defun fix-org-release ()
"The release version of org-mode.
Inserted by installing org-mode or when a release is made."
(require 'git)
(let ((git-repo (expand-file-name
"straight/repos/org/" user-emacs-directory)))
(string-trim
(string-remove-prefix
"release_"
(git-run "describe"
"--match=release\*"
"--abbrev=0"
"HEAD")))))
#+END_SRC

**** Install org
:PROPERTIES:
:ID:       44D0A1FB-C1F2-4522-B493-9411297195D5
:END:

#+BEGIN_SRC emacs-lisp
(use-package org
:demand t
:mode ("\\.org\\'" . org-mode)
:config
;; these depend on the 'straight.el fixes' above
(defalias #'org-git-version #'fix-org-git-version)
(defalias #'org-release #'fix-org-release)
(require 'org-habit)
(require 'org-capture)
(require 'org-tempo))

(use-package org-plus-contrib
   :mode (("\\.org$" . org-mode))
   :bind
   ("C-c l" . org-store-link)
   ("C-c a" . org-agenda))
#+END_SRC

** Collection of hooks for org mode 
:PROPERTIES:
:ID:       AA8706FA-0B26-4F0A-B6F8-2E2EDA551375
:END:
This is intended to be a collection of hooks loaded after org mode. It may be more convenient to add such hooks in the package configurations since the hooks will not work if the package is not available. 

However, hooks have the potential to slow down search, opening multiple files like in org-agenda, tramp files and so on. Therefore, the idea is to try collect the hooks here and include logic to discard hooks if the mode or package is not installed. 

- [ ] Maybe work on a method to switch off all the hooks after org mode since this mode is being used extensively.

List of hooks 
- [ ] Org indent mode
- [ ] Flyspell mode
- [ ] 

#+BEGIN_SRC emacs-lisp
;; Indent by header level 

(with-eval-after-load 'org
   (add-hook 'org-mode-hook #'org-indent-mode))

;; Enable flyspell mode

(add-hook 'org-mode-hook 'flyspell-mode)

#+END_SRC

** Exports
*** Markdown export
:PROPERTIES:
:ID:       A7FBD8B1-5C55-407A-8409-65EB85C8FDD4
:END:

#+BEGIN_SRC emacs-lisp
(require 'ox-md)
#+END_SRC

*** ox-pandoc
:PROPERTIES:
:ID:       1B23050A-3ABD-48C9-A0B1-6294414748E0
:END:

#+BEGIN_SRC emacs-lisp
(use-package ox-pandoc
  :ensure t
  :straight t
  :defer 5)
#+END_SRC

#+RESULTS:
** Agenda mechanics
*** Weekday starts on Monday
    :PROPERTIES:
    :ID:       d9f341b0-ad88-40ca-a19a-9ca710b2d681
    :END:

#+BEGIN_SRC emacs-lisp
(setq org-agenda-start-on-weekday 1)
#+end_src

*** Display heading tags farther to the right
    :PROPERTIES:
    :ID:       4d9c3678-f06d-49c5-9f80-184c0e2fac4e
    :END:

#+BEGIN_SRC emacs-lisp
(setq org-agenda-tags-column -150)
#+end_src

*** Default org directory and agenda file directory
:PROPERTIES:
:ID:       be1c3eed-5e7d-4f62-a5f4-127c0ee30a73
:END:

#+begin_src emacs-lisp
(setq
 org-directory "~/my_org/"
 org-agenda-files '("~/my_org/")
 )
 #+end_src

 #+RESULTS:
 | ~/my_org/ |

*** TODO Agenda customisation
    :PROPERTIES:
    :ID:       0b93631b-5a2d-4764-92b0-f5cdf42fffe7
    :END:

- Note taken on [2019-02-07 Thu 08:26]  \\
  Need to clear up the search functions, enabling complete search in journal files. Archive and some external directories are included, since they are explictly in org mode.

#+BEGIN_SRC emacs-lisp

(setq org-agenda-custom-commands
      '(("c" "Simple agenda view"
         ((tags "recurr"
		((org-agenda-overriding-header "Recurring Tasks")))
          (agenda "")
          (todo "")))
        ("o" agenda "Office mode" ((org-agenda-tag-filter-preset '("-course" "-habit" "-someday" "-book" "-emacs"))))
        ("qc" tags "+commandment")
	("e" tags "+org")
	("w" agenda "Today" ((org-agenda-tag-filter-preset '("+work"))))
	("W" todo-tree "WAITING")
	("q" . "Custom queries") ;; gives label to "q"
	("d" . "ds related")	 ;; gives label to "d"
	("ds" agenda "Datascience" ((org-agenda-tag-filter-preset '("+datascience"))))
	("qw" agenda "MRPS" ((org-agenda-tag-filter-preset '("+canjs"))))
	("qa" "Archive tags search" org-tags-view ""
         ((org-agenda-files (file-expand-wildcards "~/my_org/*.org*"))))
        ("j" "Journal Search" search ""
         ''((org-agenda-text-search-extra-files (file-expand-wildcards "~/my_org/journal/"))))
        ("S" search ""
	 ((org-agenda-files '("~/my_org/"))
	  (org-agenda-text-search-extra-files )))
	)
      )
#+end_src

*** TEST Include gpg files in agenda generation
    :PROPERTIES:
    :ID:       4c1a0a00-d123-4b6a-a209-219872d43ca1
    :END:

Source: https://emacs.stackexchange.com/questions/36542/include-org-gpg-files-in-org-agenda
Note that this must be set first and then the agenda files specified.

#+BEGIN_SRC emacs-lisp :tangle no
(unless (string-match-p "\\.gpg" org-agenda-file-regexp)
  (setq org-agenda-file-regexp
        (replace-regexp-in-string "\\\\\\.org" "\\\\.org\\\\(\\\\.gpg\\\\)?"
                                  org-agenda-file-regexp)))

;;(setq org-agenda-file-regexp "\\`\\\([^.].*\\.org\\\|[0-9]\\\{8\\\}\\\(\\.gpg\\\)?\\\)\\'")
#+end_src

#+RESULTS:

*** TEST Expanding search locations
    :PROPERTIES:
    :ID:       63a20a98-6090-4087-889d-7398df5b6bb9
    :END:

I initially included my journal location to the agenda search. However it is very slow compared to using grep/rgrep/ag. Therefore, the agenda full text search is now limited to the project directory and the org-brain directory. The snippet below enables searching recursively within folders.

#+BEGIN_SRC emacs-lisp :tangle no
(setq org-agenda-text-search-extra-files '(agenda-archives))

(setq org-agenda-text-search-extra-files (apply 'append
						(mapcar
						 (lambda (directory)
						   (directory-files-recursively
						    directory org-agenda-file-regexp))
						 '("~/my_projects/" "~/my_org/brain/"))))
#+end_src

*** TODO Adding org archive for text search. Optimise this
:PROPERTIES:
:CREATED:  <2019-02-07 Thu 08:29>
:ID:       D8743646-BD5B-463C-AB4B-CAB8AF8AA535
:END:

- Note taken on [2020-02-22 Sat 13:25] \\
  I don't really use this anymore. I prefer grep or ag for searching through all my text files. The caveat is that the files have to under a single root directory.
#+BEGIN_SRC emacs-lisp
(setq org-agenda-text-search-extra-files '(agenda-archives))
#+end_src

#+RESULTS:
| agenda-archives |

*** Enable default fuzzy search like in google
    :PROPERTIES:
    :ID:       a8012ca5-8f07-419f-8aed-11d43651bcca
    :END:

#+BEGIN_SRC emacs-lisp
(setq org-agenda-search-view-always-boolean t)
#+end_src

*** Hooks for org-agenda
:PROPERTIES:
:ID:       821CDF30-9FBA-40AB-99F4-B01A8CCBDE1F
:END:

#+BEGIN_SRC emacs-lisp
(add-hook 'org-agenda-mode-hook
          '(lambda ()
 	     (hl-line-mode 1)))
#+END_SRC

*** DONE org-habit
CLOSED: [2019-02-12 Tue 13:21]
:PROPERTIES:
:ID:       951e7ed9-783d-44b9-869d-fe048e41e93f
:END:
- Note taken on [2019-02-12 Tue 13:20] \\
  Adding a require has brought org-habit back on track.
- Note taken on [2019-02-07 Thu 09:50] \\
  Appears the use-package config for org-habit is not correct and there is some issue in downloading it as a package.

I want to shift the org habit graph in the agenda further out right so as to leave enough room for the headings to be visible.

#+BEGIN_SRC emacs-lisp
(require 'org-habit)
(setq org-habit-graph-column 90)
#+end_src

#+RESULTS:
: 90
** Archiving mechanics

- Note taken on [2020-04-06 Mon 23:27] \\
  I prefer to keep my archived files in a separate folder to promote a
  cleaner look and less files in the main org directory. The earlier
  archive file used to replicate the structure of the file where the entry
  was archived from. However, I have realised that the properties of
  archived entries provide all the information that I would need from an
  archived file. 
  
  Projects may require a separate approach. Perhaps archived subtrees
  would help in that case. For general GTD based workflows, the simple
  approach of archiving under a 'Archive' heading seems sufficient. This
  will also mark the difference between using this approach and the
  earlier complete replication.

#+BEGIN_SRC emacs-lisp
(setq org-archive-mark-done nil)
(setq org-archive-location (sr/fun/org-dir "archive/%s_archive::* Archive"))
#+END_SRC

** TODO Capture mechanics
Over time I've found an efficient capture mechanism to be important to
nurture productivity while accounting for interruptions. I think the
process of gathering templates takes time, and can be facilitated by
keenly observing the typical repetitive capture-like tasks that are
performed through the day. Needless to say, this has to be integrated
into GTD. The ideal method seems to be to capture quickly ~somewhere and
then review and refile, as well as schedule a time block for the
tasks. Musa Al-hassy's [[https://alhassy.github.io/init/][A Life Configuring Emacs]] talks about the
above. Some other good starting points are:
- [[http://doc.norang.ca/org-mode.html][Bernt Hansen's config]]
- [[http://pragmaticemacs.com/category/org/][org | Pragmatic Emacs]]
- [[https://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua's Emacs configuration]]

*** TODO Doct for org capture templates

[[https://github.com/progfolio/doct][DOCT]] makes it a lot easier to define capture templates in a clean manner. At the moment, I am interested in adding hooks to specific functions and improving the entire capture process.

**** Install doct
:PROPERTIES:
:ID:       687BA330-0F53-4335-9609-50925ECA58D0
:END:

#+BEGIN_SRC emacs-lisp
(straight-use-package 'doct)
#+END_SRC

#+RESULTS:
: t

**** doct functions 
:PROPERTIES:
:ID:       CC7C84DE-AFEF-4E44-9B5B-056DFA58AF5B
:END:

- Note taken on [2020-04-12 Sun 11:42] \\
  It seems easier to prompt for a date with respect to active dates. The
  default date is today, and there requires just another RET to select
  today. The prompt ensures being able to cater to tasks that definitely
  belong tomorrow or another date down the line. Without a template, an
  additional refile, or schedule, or manipulation in the capture window
  is required. This approach seems to cater to more situations in a
  standard manner.

#+BEGIN_SRC emacs-lisp  
(defun sr/fun/todo-act-today ()
'("* %{todo-state} %?"
":PROPERTIES:"
":CREATED: %<%Y-%m-%d %a %H:%M>"
":PLANNED: %t"
":END:"))

(defun sr/fun/todo-act-date ()
'("* %{todo-state} %?"
":PROPERTIES:"
":CREATED: %<%Y-%m-%d %a %H:%M>"
":PLANNED: %^t"
":END:"))

(defun sr/fun/todo-passive ()
'("* %{todo-state} %?"
":PROPERTIES:"
":CREATED: %U"
":END:"))

(defun sr/fun/todo-link-act-today ()
'("* %{todo-state} %a"
":PROPERTIES:"
":CREATED: %<%Y-%m-%d %a %H:%M>"
":PLANNED: %t"
":END:"
"%?"))

(defun sr/fun/todo-link-act-date ()
'("* %{todo-state} %a"
":PROPERTIES:"
":CREATED: %<%Y-%m-%d %a %H:%M>"
":PLANNED: %^t"
":END:"
"%?"))

(defun sr/fun/todo-file-link-act-date ()
'("* %{todo-state} [[file:%F][%f]]"
":PROPERTIES:"
":CREATED: %<%Y-%m-%d %a %H:%M>"
":PLANNED: %^t"
":END:"
"%?"))

(defun sr/fun/todo-file-ext-link-act-date ()
'("* %{todo-state} %(org-web-tools--get-url %x)"
":PROPERTIES:"
":CREATED: %<%Y-%m-%d %a %H:%M>"
":PLANNED: %^t"
":END:"
"%?"))

(defun sr/fun/todo-link-passive ()
'("* %a"
":PROPERTIES:"
":CREATED: %U"
":END:"
"%?"))

(defun sr/fun/note-passive ()
'("* %?"
":PROPERTIES:"
":CREATED: %U"
":END:"))

#+END_SRC

#+RESULTS:
: sr/fun/note-passive

