emacs-config.org
**** doct templates

- [X] Created inactive date for all entries
- [X] Mail : Active date + mu4e link
- [X] Mail : Passive date + mu4e link. Meant for general notes and archive.
- [X] Note : passive date. Generally not refiled.
- [ ] Note : With active date to be refiled or acted upon.
  - I am not sure if this makes sense. If action is required, it should
    be a task.
- [ ] Link : 
- [ ] Capture to today's journal
- [ ] Capture to tomorrow's journal
- [ ] Capture to current clocked task

#+BEGIN_SRC emacs-lisp 
(setq org-capture-templates
      (doct '(("capture" :keys "c"
               :file "~/my_org/todo-global.org"
               :prepend t
	       :children (("inbox"  
			   :keys "t"
			   :type entry
	                   :file "~/my_org/refile.org"
			   :headline "inbox"
			   :todo-state "TODO"
			   :template sr/fun/todo-passive)
			  ("mail"  
			   :keys "m"
			   :type entry
	                   :file "~/my_org/refile.org"
			   :todo-state "TODO"
			   :headline "mail"
			   :template sr/fun/todo-link-passive)
                          ("reading" :keys "r"
                           :headline   "reading"
                           :todo-state "TODO"
			   :template sr/fun/todo-link-passive)
			  ("emacs" :keys "e"
                           :headline   "emacs"
                           :todo-state "TODO"
			   :template sr/fun/todo-link-passive)))
	      ("Todo" :keys "t"
               :file "~/my_org/todo-global.org"
               :prepend t
	       :children (("inbox"  
			   :keys "t"
			   :type entry
			   :headline "@inbox"
			   :todo-state "TODO"
			   :template sr/fun/todo-act-date)
			  ("mail"  
			   :keys "m"
			   :type entry
			   :headline "@mail"
			   :todo-state "TODO"
			   :template sr/fun/todo-link-act-date)
			  ("article"  
			   :keys "r"
			   :type entry
			   :headline "@reading"
			   :todo-state "TODO"
			   :template sr/fun/todo-link-act-date)
			  ("File link"  
			   :keys "f"
			   :type entry
			   :headline "@inbox"
			   :todo-state "TODO"
			   :clock-in t
			   :template sr/fun/todo-file-link-act-date)
			  ("External link"  
			   :keys "e"
			   :type entry
			   :headline "@reading"
			   :todo-state "TODO"
			   :template sr/fun/todo-file-ext-link-act-date)))
	      ("Notes" :keys "n"
               :file "~/my_org/notes.org"
               :prepend t
               :template sr/fun/note-passive
               :children (("Fast note"  
			   :keys "n"
			   :type entry	                       
			   :headline   "@Notes"
			   )
			  ("Mail note"
			   :template sr/fun/todo-link-passive
			   :keys "m"
			   :type entry
			   :headline "@Mail archive"
			   :file "~/my_org/notes.org")
			  ("DS Link note"  :keys "d"
			         :file "~/my_org/datascience.org"
                           :headline   "@Datascience @Notes"
                           :todo-state "TODO"
			   :template sr/fun/todo-link-passive)))
	      ;; ("Project" :keys "p"
              ;;  :file "~/my_org/project-tasks.org"
              ;;  :template sr/fun/todo-link-active)
	      )))

#+END_SRC

*** COMMENT Old Capture templates
    :PROPERTIES:
    :ID:       50f2b318-d9e6-4403-af24-875c662d888d
    :END:
    - Note taken on [2020-04-02 Thu 01:38] \\
      This section will be retired soon in favor of using the doct package.

#+BEGIN_SRC emacs-lisp
(setq org-capture-templates
      '(("t" "Task entry")
        ("tt" "Todo - Fast Now" entry (file+headline "~/my_org/todo-global.org" "@Inbox")
	 "** TODO %?")
        ("tj" "Todo -Job journal" entry (file+olp+datetree "~/my_org/ds-jobs.org" "Job Search Journal")
	 "** TODO %?")
        ("te" "Todo - Emacs" entry (file+headline "~/my_org/todo-global.org" "@Emacs notes and tasks")
         "** TODO %?")
        ("td" "Datascience inbox" entry (file+headline "~/my_org/datascience.org" "@Datascience @Inbox")
         "** TODO %?")
	("tm" "Mail Link Todo" entry (file+headline "~/my_org/todo-global.org" "@Inbox")
	 "** TODO Mail: %a ")
        ("l" "Link/Snippet" entry (file+headline "~/my_org/link_database.org" ".UL Unfiled Links")
         "** %? %a ")
        ("e" "Protocol info" entry ;; 'w' for 'org-protocol'
         (file+headline "~/my_org/link_database.org" ".UL Unfiled Links")
         "*** %a, \n %:initial")
        ("n" "Notes")
        ("ne" "Emacs note" entry (file+headline "~/my_org/todo-global.org" "@Emacs notes and tasks")
         "** %?\n:PROPERTIES:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:")
        ("nn" "General note" entry (file+headline "~/my_org/notes.org" "@NOTES")
         "** %?\n:PROPERTIES:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:")
        ("nd" "Datascience note" entry (file+headline "~/my_org/datascience.org" "@Datascience @Notes")
         "** %?\n:PROPERTIES:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:")
        ("g" "BGR stuff")
        ("gi" "Inventory project")
        ("gil" "Daily log" entry (file+olp+datetree "~/my_org/bgr.org" "Inventory management Project") "** %? %i")
        ("C" "Commandment" entry (file+datetree "~/my_org/lifebook.org" "")
         "** %? %i :commandment:")
        ("J" "Job search" entry (file+headline "~/my_org/mrps_canjs.org" "MRPS #CANJS")
         "** TODO %? %i ")
        ("w" "Website" plain
         (function org-website-clipper)
         "* %a %T\n" :immediate-finish t)
        ("j" "Journal entry" entry (function org-journal-find-location)
         "* %(format-time-string org-journal-time-format) %?")
        ("i" "Whole article capture" entry
         (file+headline "~/my_org/full_article_archive.org" "" :empty-lines 1)
         "** %a, %T\n %:initial" :empty-lines 1)
        ("c" "Clocking capture")
        ("ct" "Clock TODO" entry (clock) "** TODO %?")
        ("cn" "Clock Note" entry (clock) "** %?\n:PROPERTIES:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:")
        ("r" "Review note" entry (file+weektree "~/my_org/lifebook.org" "#Personal #Reviews")
         "** %?\n:PROPERTIES:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:")
         ))
#+end_src

#+RESULTS:
| t  | Task entry        |       |                                                                 |                  |
| tt | Todo - Fast Now   | entry | (file+headline ~/my_org/todo-global.org @Inbox)                 | ** TODO %?       |
| tj | Todo -Job journal | entry | (file+olp+datetree ~/my_org/ds-jobs.org Job Search Journal)     | ** TODO %?       |
| te | Todo - Emacs      | entry | (file+headline ~/my_org/todo-global.org @Emacs notes and tasks) | ** TODO %?       |
| td | Datascience inbox | entry | (file+headline ~/my_org/datascience.org @Datascience @Inbox)    | ** TODO %?       |
| tm | Mail Link Todo    | entry | (file+headline ~/my_org/todo-global.org @Inbox)                 | ** TODO Mail: %a |
| l  | Link/Snippet      | entry | (file+headline ~/my_org/link_database.org .UL Unfiled Links)    | ** %? %a         |
| e  | Protocol info     | entry | (file+headline ~/my_org/link_database.org .UL Unfiled Links)    | *** %a,          |

*** Closing org-capture frame on abort
    :PROPERTIES:
    :ID:       1f79f2ff-2185-451d-8485-8f11c7b1de41
    :END:
- Note taken on [2019-03-13 Wed 07:35] \\
  This basically ensures a clean exit in case of aborting a capture, and
  also maintains buffer configuration on going ahead with the capture.
- Note taken on [2019-02-07 Thu 08:53]  \\
  Needs further review.

Source: [[http://stackoverflow.com/questions/23517372/hook-or-advice-when-aborting-org-capture-before-template-selection][emacs - hook or advice when aborting org-capture before template selection? - Stack Overflow]]

#+BEGIN_SRC emacs-lisp
(defadvice org-capture
    (after make-full-window-frame activate)
  "Advise capture to be the only window when used as a popup"
  (if (equal "emacs-capture" (frame-parameter nil 'name))
      (delete-other-windows)))

(defadvice org-capture-finalize
    (after delete-capture-frame activate)
  "Advise capture-finalize to close the frame"
  (if (equal "emacs-capture" (frame-parameter nil 'name))))

#+end_src

#+RESULTS:
: org-capture-finalize

*** TODO Controlling org-capture buffers
:PROPERTIES:
:ID:       FB3E4494-6AAA-4CA3-8A43-726E9E7143A7
:END:
- Note taken on [2019-03-13 Wed 08:01] \\
  This interferes with org-journal's capture format.

I dislike the way org-capture disrupts my current window, and shows me
the capture buffer, and the target buffer as well. I would prefer a
small pop up window, and then a revert back to the existing windows once
the capture is completed or aborted. However this does not seem possible
without modifying Org-mode's source code. This is a workaround described
at
https://stackoverflow.com/questions/54192239/open-org-capture-buffer-in-specific-Window
,which partially resolves the issue by enabling just a single capture
buffer.

#+BEGIN_SRC emacs-lisp :tangle no

(defun my-org-capture-place-template-dont-delete-windows (oldfun args)
  (cl-letf (((symbol-function 'delete-other-windows) 'ignore))
    (apply oldfun args)))

(with-eval-after-load "org-capture"
  (advice-add 'org-capture-place-template :around 'my-org-capture-place-template-dont-delete-windows))
#+END_SRC

#+RESULTS:

** TODO Refile mechanics

*** Refile target level

#+BEGIN_SRC emacs-lisp
(setq org-refile-targets
      '((nil :maxlevel . 3)
        (org-agenda-files :maxlevel . 2)))
#+END_SRC

*** General refiling settings

#+BEGIN_SRC emacs-lisp
(setq org-refile-use-outline-path 'file)
(setq org-outline-path-complete-in-steps nil)
(setq org-reverse-note-order t)
(setq org-refile-allow-creating-parent-nodes 'confirm)
#+END_SRC

** Clocking mechanics
*** Continuous clocking + punch in/out approach
This approach and code snippets are adapted (and shamelessly borrowed)
from [[http://doc.norang.ca/org-mode.html][Bernt Hansen's approach]]. While Bernt follows a complex approach of
clocking into parent tasks - my current workflow favors clocking in
directly to set clocking headlines within projects, which are placed in
my org-projectile todo task file.

I have a default continuous clock after punching in (defined by org-id)
which will cater to general re-organisation, including capturing notes,
refiling , email etc. Other tasks or even mini projects can be directly
clocked into when required. These mini-projets are often just located
within my org-agenda files and not as a separate git repositoy. Every
time I am on my computer, whether on Emacs or not, I would like the
automatic clock to capture time, unless it is being clocked to a
specific project.

**** Defining default Task

#+BEGIN_SRC emacs-lisp
(defvar sr/var/organization-task-id "a8712a47-a648-477f-bdbf-d6004a0cc70b")

(defun sr/clock-in-organization-task-as-default ()
  (interactive)
  (org-with-point-at (org-id-find sr/var/organization-task-id 'marker)
    (org-clock-in '(16))))
#+END_SRC

#+RESULTS:
: sr/clock-in-organization-task-as-default

**** Punch in

Bernt Hansen shares that he has a default punch in and punch out task that keeps the clock on all day. I think this will work for me as well. Other than work and projects, most of the time I am tinkering with Emacs, or writing a journal note or trying to re-organise my stuff. By using a punch in and out, I can track how much time I am engaged with a computer, other than specific projects.

#+BEGIN_SRC emacs-lisp
(defun sr/punch-in (arg)
    (interactive "p")
  (setq sr/keep-clock-running t)
  (sr/clock-in-organization-task-as-default))
#+END_SRC

#+RESULTS:
: sr/punch-in

**** Punch Out

#+BEGIN_SRC emacs-lisp
(defun sr/punch-out ()
  (interactive)
  (setq sr/keep-clock-running nil)
  (when (org-clock-is-active)
    (org-clock-out)))
#+END_SRC

#+RESULTS:
: sr/punch-out
**** Advising clock Out

#+BEGIN_SRC emacs-lisp
(defun sr/clock-out-maybe ()
  (when (and sr/keep-clock-running
             (not org-clock-clocking-in)
             (marker-buffer org-clock-default-task)
             (not org-clock-resolving-clocks-due-to-idleness))
    (sr/clock-in-organization-task-as-default)))

(add-hook 'org-clock-out-hook 'sr/clock-out-maybe 'append)
#+END_SRC

#+RESULTS:
| org-clock-remove-empty-clock-drawer | sr/clock-out-maybe |
**** Shortcuts for punch in and punch out

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-<f9>") 'sr/punch-in)
(global-set-key (kbd "M-<f9>") 'sr/punch-out)
#+END_SRC

*** set idle timer for clocked task

#+BEGIN_SRC emacs-lisp
;; setting idle timer to 15 minutes
(setq org-clock-idle-time 15)
#+END_SRC
*** No zero clocks

#+BEGIN_SRC emacs-lisp
(setq org-clock-out-remove-zero-time-clocks t)
#+END_SRC
*** Clocking accuracy

This is borrowed off Bernt Hansen's method.

#+BEGIN_SRC emacs-lisp
(setq org-agenda-clock-consistency-checks
      (quote (:max-duration "4:00"
              :min-duration 0
              :max-gap 0
              :gap-ok-around ("4:00"))))
#+END_SRC

*** org-mru-clock 
- [ ] use the functions included to capture to the current clocked tasks.
- [ ] method to jump to recent clocked task instead of starting the clock

This is a handy package to quickly select past tasks which have been clocked in.
#+BEGIN_SRC emacs-lisp
(use-package org-mru-clock
  :ensure t
  :bind (("M-s 1" . org-mru-clock-in)
          ("C-c C-x C-j" . org-mru-clock-select-recent-task))
  :init
  (setq org-mru-clock-how-many 100
        org-mru-clock-completing-read #'ivy-completing-read))
#+END_SRC

*** counsel-org-clock

Here is a comparison of counsel-org-clock and org-mru-clock: [[http://mbork.pl/2018-04-28_org-mru-clock][Marcin
Borkowski: 2018-04-28 org-mru-clock]]. As mentioned, one main advantage of
this package are the extension via ivy actions, though these can be
defined for =org-mru-clock=. Since I want to jump around previously
clocked tasks and examine them, these functions are useful to
me. However, the advantage of org-mru-clock is the list of all the
clocked tasks from the agenda.

#+BEGIN_SRC emacs-lisp
(use-package counsel-org-clock)

#+END_SRC

** Task state sequences

The difference between cancelled and failed would be that -

failed: things I could have planned and done, and it would have been a
good thing to do - but I did not. These kind of tasks are worth tracking
in a general sense, and that is why a failed tag would be useful. The
agenda can then be used to filter failed tasks to see whether there have
been repeated failures in the past.

Cancelled tasks - these are tasks that do not require to be done. The
reason could be that they were pre-emptive tasks that were superceded by
events, or simply deemed unnecessary at all levels. Such tasks would not
warrant a detailed review in general. 

Looking at Bernt Hansen's documentation - it also makes sense to have
some more key words for filtering. Summary of sequences that make sense
at this point: 

- TODO
- Next
- Done

This sequence will include a note as to why the state is being set. 

- Waiting
- Hold
- Cancelled
- Failed

#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
      (quote ((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
              (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "FAILED(f@/!)"))))
#+END_SRC

** org-source-window split setup
:PROPERTIES:
:ID:       34171B48-C042-4CB4-959A-75DECE5F4DC2
:END:

#+BEGIN_SRC emacs-lisp
(setq org-src-window-setup 'split-window-right)
#+END_SRC

** Log done

#+BEGIN_SRC emacs-lisp
(setq org-log-done 'time)
#+END_SRC

** TODO Shortcuts (to be replaced via hydra)

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c d") 'org-time-stamp)
(global-set-key (kbd "M-s s") 'org-save-all-org-buffers)
#+END_SRC

** TODO org-ql
- Note taken on [2020-04-24 Fri 09:59] \\
  This is an interesting package that I want to master using
  effectively.

#+BEGIN_SRC emacs-lisp
(use-package org-ql
:straight t)

#+END_SRC


