emacs-config.org
* Temporary package list
- Note taken on [2020-03-30 Mon 07:58] \\
  A lot of these are borrowed from scimax and will be slowly whittled down to the essentials.

#+BEGIN_SRC emacs-lisp
      ;; (use-package helm-bibtex)

      ;; Functions for working with hash tables
      (use-package ht)

      (use-package hy-mode)

      (use-package hydra
        :init
        (setq hydra-is-helpful t)
        :config
        (require 'hydra-ox))

      (use-package jedi)

      (use-package diminish)

    (use-package rainbow-mode)

    ;; Provides functions for working with files
    (use-package f)


    (use-package auto-complete
      :diminish auto-complete-mode
      :config (ac-config-default))

  (straight-use-package 'ggtags)
  (straight-use-package 'ibuffer-projectile)
#+END_SRC

: t

* Org journal
- Note taken on [2020-04-10 Fri 17:29] \\
  Scimax journal has the benefit of being well integrated with Scimax. The
  other benefit is being able to have journal files within a
  folder. However, for the journal to be included into GTD workflow and
  not just a scratch pad, the org-journal package offers a lot more out of
  the box. I see from the documentation that is also possible now to have
  a weekly, daily or yearly journal. In addition, the agenda integration
  simplifies things in terms of tracking what I am doing and then refiling
  the entries into appropriate locations.
- Note taken on [2020-02-22 Sat 10:58] \\
  I've been using scimax journal for several months now, as it has some
  defaults which suit my current workflow. However, org-journal does
  have a bunch of nifty features that I want to try and port to scimax.

** Base config


#+BEGIN_SRC emacs-lisp
(use-package org-journal
  :ensure t
  :defer t
  :config
  (defun org-journal-file-header-func (time)
    "Custom function to create journal header."
    (concat
     (pcase org-journal-file-type
       (`daily "#+TITLE: Daily Journal\n#+STARTUP: showeverything")
       (`weekly "#+TITLE: Weekly Journal\n#+STARTUP: folded")
       (`monthly "#+TITLE: Monthly Journal\n#+STARTUP: folded")
       (`yearly "#+TITLE: Yearly Journal\n#+STARTUP: folded"))))
  :custom
  (org-journal-dir "~/my_org/journal/")
  (org-journal-file-format "%Y/%m/%Y-%m-%d.org")
  (org-journal-enable-agenda-integration t)
  (org-journal-date-format "%A, %d %B %Y")
  (org-journal-file-type 'daily) ;; Set this explicitly, even though the default is daily.
  (org-journal-file-header 'org-journal-file-header-func)
  ;; Carrying over items though useful, sometimes results in duplication
  ;; and a loss of items, especially if journalling is carried out at
  ;; 12PM or when the day is changing.
  ;; New idea: Do not carry over clocked items. The remaining can be carried over
  ;; (org-journal-carryover-items "TODO")
  (org-journal-skip-carryover-drawers (list "LOGBOOK")))
#+end_src

#+RESULTS:
: t

** TODO org-capture template for Journal
 
#+BEGIN_SRC emacs-lisp :tangle no
(defun org-journal-find-location ()
  ;; Open today's journal, but specify a non-nil prefix argument in order to
  ;; inhibit inserting the heading; org-capture will insert the heading.
  (org-journal-new-entry t)
  ;; Position point on the journal's top-level heading so that org-capture
  ;; will add the new entry as a child entry.
  (goto-char (point-min)))
#+END_SRC

#+RESULTS:
: org-journal-find-location

** TODO Figure out easy encryption approach for org journal
:PROPERTIES:
:CREATED:  <2019-02-07 Thu 13:51>
:END:

* Crypto

** Basic crypto
:PROPERTIES:
   :ID:       B4CA6F66-7CD6-4905-A3B0-B4FCB763ADE9
   :END:

#+BEGIN_SRC emacs-lisp
(setq epa-file-encrypt-to "shreyas@fastmail.com")
#+end_src

#+RESULTS:
: Loaded crypto setup

** TEST org-crypt

#+BEGIN_SRC emacs-lisp :tangle no
(require 'org-crypt)
(add-to-list 'org-modules 'org-crypt)
                                        ; Encrypt all entries before saving
(org-crypt-use-before-save-magic)
;;(setq org-tags-exclude-from-inheritance (quote ("crypt")))
                                        ; GPG key to use for encryption. nil for symmetric encryption
;;(setq org-crypt-key nil)
(setq org-crypt-disable-auto-save t)
;;(setq org-crypt-tag-matcher "locked")

#+END_SRC

** Setting auth sources
   :PROPERTIES:
   :ID:       4c87f5e8-70ca-4719-a550-cfcd32076ee0
   :END:

This was prompted by this discussion https://emacs.stackexchange.com/questions/10207/how-to-get-org2blog-to-use-authinfo-gpg

I have modified it to my own file names.

#+BEGIN_SRC emacs-lisp
(require 'auth-source)
(setq auth-sources
      '((:source "~/.authinfo.gpg"
		 "~/.bitly-access.token.gpg")))

(setq epa-file-cache-passphrase-for-symmetric-encryption t)

#+END_SRC

#+RESULTS:
: t

* git related
** TODO Git gutter
:PROPERTIES:
   :ID:       a30f51f4-8c96-4e89-a692-9df36e5278a7
   :END:
- Note taken on [2019-02-07 Thu 09:30]  \\
  Started using this today. It is actually very convenient to quickly view the changes made in the document. There is a function to pop up the changes at that location. I need to learn more about using this tool effectively.

#+begin_src emacs-lisp
  (use-package git-gutter
    :ensure t
    :config
    (global-git-gutter-mode 't)
    :diminish git-gutter-mode)
#+end_src

#+RESULTS:
: t

** magit settings
   :PROPERTIES:
   :ID:       55d1b554-f224-41fa-a4ae-5c2e2c1024be
   :END:

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :init (setq magit-completing-read-function 'ivy-completing-read)
  :config
  (global-set-key (kbd "C-x g") 'magit-status)
  (setq magit-revert-buffers 'silent)
  (setq magit-process-find-password-functions '(magit-process-password-auth-source)))
#+END_SRC

#+RESULTS:
: t

** TODO Time machine for git
:PROPERTIES:
:ID:       eeb65d68-8c6d-4896-b9e4-cdf06bd3f81d
:END:
- Note taken on [2019-02-08 Fri 13:21] \\
  Launched by =M-x git-timemachine=, this lets you navigate through the commit history with a single key press! This is especially awesome for tracking changes to a particular snippet of code.
- Note taken on [2019-02-07 Thu 09:30]  \\
  Need to evaluate this. The purpose is for stepping through the history of a file recorded in git. This should be very interesting.

#+BEGIN_SRC emacs-lisp
(use-package git-timemachine
  :ensure t)
#+END_SRC

* PDF related
** STABLE PDF Tools
CLOSED: [2019-10-23 Wed 09:26]
:PROPERTIES:
:ID:       50da84f6-3fb3-4e30-b4b0-e293f3bb1b72
:END:
  - Note taken on [2019-10-23 Wed 09:26] \\
    This appears to be setup via scimax already. Disabling for now.
  - Note taken on [2019-02-18 Mon 14:30] \\
    [[https://emacs.stackexchange.com/questions/13314/install-pdf-tools-on-emacs-macosx][osx - Install Pdf-Tools on Emacs MacOSX - Emacs Stack Exchange]]
  

#+BEGIN_SRC emacs-lisp
(use-package pdf-tools
  :ensure t
  :config
  (custom-set-variables
   '(pdf-tools-handle-upgrades nil)) ; Use brew upgrade pdf-tools instead in the mac
  (setq pdf-info-epdfinfo-program "/usr/local/bin/epdfinfo")
  (pdf-tools-install)
)

#+END_SRC

#+RESULTS:
: t

** org-noter
   :PROPERTIES:
   :ID:       adfce132-a15d-4b1e-bda5-7d1248a9c4d5
   :END:

#+BEGIN_QUOTE
Org-noter's purpose is to let you create notes that are kept in sync when you scroll through the document, but that are external to it - the notes themselves live in an Org-mode file. As such, this leverages the power of Org-mode (the notes may have outlines, latex fragments, babel, etc) acting like notes that are made inside the document. Also, taking notes is very simple: just press i and annotate away!

[[https://github.com/weirdNox][Goncalo Santos]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp
(use-package org-noter
  :ensure t
  :defer t
  :config
  (setq org-noter-set-auto-save-last-location t)
  )
#+end_src

#+RESULTS:

* Window, frame and buffer management
** winum
:PROPERTIES:
:ID:       80A2FA09-6120-44C4-A1B4-3FB3645C269A
:END:

This package makes it easy to switch between frames, and is particularly useful in a multi screen setup of emacs.

#+BEGIN_SRC emacs-lisp
(use-package winum
  :defer nil
  :init
  ;; ;;(define-key map (kbd "C-`") 'winum-select-window-by-number)
  ;; (define-key winum-keymap (kbd "C-0") 'winum-select-window-0-or-10)
  ;; (define-key winum-keymap (kbd "C-1") 'winum-select-window-1)
  ;; (define-key winum-keymap (kbd "C-2") 'winum-select-window-2)
  ;; (define-key winum-keymap (kbd "C-3") 'winum-select-window-3)
  ;; (define-key winum-keymap (kbd "C-4") 'winum-select-window-4)
  ;; (define-key winum-keymap (kbd "C-5") 'winum-select-window-5)
  ;; (define-key winum-keymap (kbd "C-6") 'winum-select-window-6)
  ;; (define-key winum-keymap (kbd "C-7") 'winum-select-window-7)
  ;; (define-key winum-keymap (kbd "C-8") 'winum-select-window-8)
  :ensure t
  :config
  ;;(winum-set-keymap-prefix (kbd "C-"))'
  (global-set-key (kbd "C-0") 'winum-select-window-0-or-10)
  (global-set-key (kbd "C-1") 'winum-select-window-1)
  (global-set-key (kbd "C-2") 'winum-select-window-2)
  (global-set-key (kbd "C-3") 'winum-select-window-3)
  (global-set-key (kbd "C-4") 'winum-select-window-4)
  (global-set-key (kbd "C-5") 'winum-select-window-5)
  (global-set-key (kbd "C-6") 'winum-select-window-6)
  (global-set-key (kbd "C-7") 'winum-select-window-7)
  (global-set-key (kbd "C-8") 'winum-select-window-8)
  (setq
   window-numbering-scope            'global
   winum-ignored-buffers             '(" *which-key*")
   winum-ignored-buffers-regexp      '(" \\*Treemacs-.*"))
  (winum-mode))
#+END_SRC

#+RESULTS:
: t
** Winner mode
:PROPERTIES:
:ID:       E7F63E2C-F5F7-4BF6-A5E3-C3E3AD82F4B7
:END:
Enabling winner mode. This is convenient to switch between temporary window configurations in conjunction with somewhat more permanent configurations in eyebrowse.

#+BEGIN_SRC emacs-lisp
(winner-mode)
#+END_SRC

#+RESULTS:
: t

** TEST eyebrowse
:PROPERTIES:
:ID:       2a73c1c9-9438-478a-881a-e2f61c803929
:END:

This has to be combined with desktop.el or some other method to enable persistence across sessions. However, this does work well for a single session.

#+BEGIN_SRC emacs-lisp
(use-package eyebrowse
  :ensure t
  :config
  (setq eyebrowse-mode-line-separator " "
        eyebrowse-new-workspace t)
  (eyebrowse-mode 1)
  )
#+END_SRC

** TODO Bufler
:PROPERTIES:
:ID:       33032A84-CCB0-481A-A622-E30B1B823ED5
:END:

For the few occassions that I use the buffer-list command, I think the bufler
package provides a more functional interface. 

- [ ] explore the workspace configuration format. Can this restricted on a
  frame basis like eyebrowse? Does that even make sense? 

#+BEGIN_SRC emacs-lisp
(use-package bufler
  :straight (bufler :host github :repo "alphapapa/bufler.el")
:bind ("C-x C-b" . bufler-list))
#+END_SRC

** Frame settings
:PROPERTIES:
:ID:       5ACDA41D-D680-46ED-A1AD-28C614E9BBCB
:END:

I'm often running emacsclient with a daemon and have found that specific settings need to be set for each frame that is created, like the window size, and the visual fill column and line settings.

1. [X] Full screen and windows on Mac OS
2. [X] Enable global visual line mode and visual fill column mode. Apparently this was fixed without frame settings. 

#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist '(fullscreen . fullboth)) 
#+END_SRC

#+RESULTS:
: ((fullscreen . fullboth) (vertical-scroll-bars))

** crux
:PROPERTIES:
:ID:       BF85E4B9-231B-4FC6-BBB1-5C1A686F0E27
:END:

Crux has a handle re-open and root function that will open a file as root if the permissions are set so. 

#+BEGIN_SRC emacs-lisp
(use-package crux
  :straight t
  :defer 10
  :bind (("C-c C-s" . crux-sudo-edit)
         ("C-c C-r" . crux-eval-and-replace)
         ("C-c o" . crux-open-with))
  :config
  (progn
    (crux-reopen-as-root-mode)))

#+END_SRC

#+RESULTS:
: crux-open-with

* Emacs information
** which key
:PROPERTIES:
:ID:       5646C3F4-06BE-4754-8A7B-DED5EA8CD7B7
:END:

#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :defer 5
    :diminish which-key-mode
    :straight t
    :config
    (which-key-mode))
#+END_SRC

: t

* Project management
** TODO org-projectile

- Note taken on [2019-02-07 Thu 08:42]  \\
  need to optimise further and convert to use-package style. Also need a way to capture Notes from projects, in addition to tasks.

Starting off with the basic configuration posted in org-projectile github repo.

#+BEGIN_SRC emacs-lisp
(use-package org-projectile
  :straight t
  :bind (("C-c n p" . org-projectile-project-todo-completing-read)
         ("C-c c" . org-capture))
  :config
  (setq org-projectile-projects-file
        "~/my_org/project-tasks.org")
  ;; (setq org-agenda-files (append org-agenda-files (org-projectile-todo-files))) ;; Not necessary as my task projects are a part of the main org folder
  (setq org-projectile-capture-template "* TODO %?\n:PROPERTIES:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:\n")
  (push (org-projectile-project-todo-entry) org-capture-templates))
  

#+end_src

: org-capture

** projectile
- [ ] Add a variable for the emacs_meta directory.

#+BEGIN_SRC emacs-lisp
;; https://github.com/bbatsov/projectile
(use-package projectile
  :init (setq projectile-cache-file
	      (expand-file-name "emacs_meta/projectile.cache" org-directory)
	      projectile-known-projects-file
	      (expand-file-name "emacs_meta/projectile-bookmarks.eld" org-directory))
  :bind
  ("C-c pp" . projectile-switch-project)
  ("C-c pb" . projectile-switch-to-buffer)
  ("C-c pf" . projectile-find-file)
  ("C-c pg" . projectile-grep)
  ("C-c pk" . projectile-kill-buffers)
  ;; nothing good in the modeline to keep.
  :diminish ""
  :config
  (define-key projectile-mode-map (kbd "H-p") 'projectile-command-map)
  (setq projectile-sort-order 'recently-active)
  (projectile-global-mode))

#+END_SRC

* Knowledge management
** COMMENT org-brain

#+begin_src emacs-lisp 
  (use-package org-brain
    :straight (org-brain :type git :host github :repo "Kungsgeten/org-brain")
    ;; :straight (org-brain :type git :host github :repo "Kungsgeten/org-brain"
    ;; 			 :fork (:host github :repo "dustinlacewell/org-brain"))
    :after org
    :bind ("M-s v" . org-brain-visualize)
    :config
    ;; this unbinds all default org-brain bindings
    (setcdr org-brain-visualize-mode-map nil)
    (setq
     ;; org-brain-path (f-join path-of-this-repo "brain")
     org-brain-visualize-default-choices 'all
     org-brain-include-file-entries t
     org-brain-scan-for-header-entries t
     org-brain-file-entries-use-title t
     org-brain-show-full-entry t
     org-brain-show-text t
     org-id-track-globally t
     org-brain-vis-current-title-append-functions '(org-brain-entry-tags-string)
     org-brain-title-max-length 24)
    ;; (push '("b" "Brain" plain (function org-brain-goto-end)
    ;;         "* %i%?\n:PROPERTIES:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:ID: [%(org-id-get-create)]\n:END:" :empty-lines 1
    ;;       org-capture-templates))
)
    ;; (add-hook 'org-brain-refile 'org-id-get-create)))
#+end_src

#+RESULTS:
: org-brain-visualize


