emacs-config.org
*** Navigation Helpers

#+begin_src emacs-lisp
  (defun my/org-brain-visualize-parent ()
    (interactive)
    (when (org-brain-parents (org-brain-entry-at-pt)) (org-brain-visualize-parent (org-brain-entry-at-pt))))

  (defun my/org-brain-visualize-child (entry &optional all)
    (interactive (list (org-brain-entry-at-pt)))
    (when (org-brain-children entry)
      (let* ((entries (if all (org-brain-children entry)
                      (org-brain--linked-property-entries
                       entry org-brain-children-property-name)))
           (child (cond
                   ((equal 1 (length entries)) (car-safe entries))
                   ((not entries) (error (concat entry " has no children")))
                   (t (org-brain-choose-entry "Goto child: " entries nil t)))))
        (org-brain-visualize child))))

  (defun my/next-button-with-category (category)
    (let ((original-point (point))
          (first-result (text-property-search-forward 'brain-category category t t)))
      (when first-result
            (goto-char (prop-match-beginning first-result)))
      (when (eq original-point (point))
        (beginning-of-buffer)
        (let ((second-result (text-property-search-forward 'brain-category category t t)))
          (when second-result
            (goto-char (prop-match-beginning second-result))))
        (when (eq 0 (point))
          (goto-char original-point))
        )
      ))

  (defun my/previous-button-with-category (category)
    (let ((result (text-property-search-backwards 'brain-category category nil t)))))

  (defun my/next-brain-child ()
    (interactive)
    (my/next-button-with-category 'child))

  (defun my/next-brain-history ()
    (interactive)
    (my/next-button-with-category 'history))

  (defun my/avy-brain-jump (category)
    (avy-jump "\\<." :pred (lambda () (and (eq category (get-text-property (point) 'brain-category))
                                      (eq (- (point) 1) (button-start (button-at (point))))))
              :action (lambda (p) (goto-char (+ 1 p)) (push-button))))

  (defun my/avy-brain-jump-history ()
    (interactive)
    (my/avy-brain-jump 'history))

  (defun my/avy-brain-jump-child ()
    (interactive)
    (my/avy-brain-jump 'child))

  (defun my/avy-brain-jump-parent ()
    (interactive)
    (my/avy-brain-jump 'parent))

  (defun my/avy-brain-jump-friend ()
    (interactive)
    (my/avy-brain-jump 'friend))

  (defun my/avy-brain-jump-sibling ()
    (interactive)
    (my/avy-brain-jump 'sibling))
#+end_src

#+RESULTS:
: my/avy-brain-jump-sibling
** define-word

#+BEGIN_SRC emacs-lisp
(straight-use-package 'define-word)
#+END_SRC
** Wiktionary lookup
From [[https://www.reddit.com/r/emacs/comments/3yjzmu/dictionary_and_thesaurus_in_emacs/][Dictionary and thesaurus in Emacs : emacs]], this does not seem to
work. 

#+BEGIN_SRC emacs-lisp
(defun lookup-word (word)
  (interactive (list (save-excursion (car (ispell-get-word nil)))))
  (browse-url (format "http://en.wiktionary.org/wiki/%s" word)))
#+END_SRC
** merriam-webster
The advantage of this is that synonyms and other definitions are shown,
and they are apparently within Emacs. Note that it is possible and may
even be necessary to register an API key with merriam-webster. 

#+BEGIN_SRC emacs-lisp
(straight-use-package 'mw-thesaurus)
#+END_SRC

** COMMENT polybrain

#+name: polybrain
#+begin_src emacs-lisp :noweb t
  (use-package polybrain
    :defer nil
    :after org-brain
    :straight (polybrain :type git :host github :repo "dustinlacewell/polybrain.el")
    :bind (:map org-brain-visualize-mode-map
           ("m" . org-brain-visualize-mind-map)
           ("<tab>" . backward-button)
           ("S-<tab>" . forward-button)
           ("DEL" . org-brain-visualize-back)
           ("r" . org-brain-open-resource)
           ("v" . org-brain-visualize)

           ("i" . org-brain-pin)
           ("T" . org-brain-set-title)
           ("t" . org-brain-set-tags)
           ("d" . org-brain-delete-entry)
           ("R" . org-brain-visualize-add-resource)
           ("o" . org-brain-goto-current)
           ("O" . org-brain-goto)

           ("c" . org-brain-add-child)
           ("C" . org-brain-remove-child)

           ("p" . org-brain-add-parent)
           ("P" . org-brain-remove-parent)

           ("f" . org-brain-add-friendship)
           ("F" . org-brain-remove-friendship)

           ("e" . org-brain-annotate-edge)


           ("M-p" . my/avy-brain-jump-parent)
           ("M-c" . my/avy-brain-jump-child)
           ("M-s" . my/avy-brain-jump-sibling)
           ("M-f" . my/avy-brain-jump-friend)
           ("M-h" . my/avy-brain-jump-history)

           :map poly-brain-mode-map
           ("C-x C-s" . polybrain-save)
           ("<M-SPC>" . polybrain-switch))
    :config 
    (require 'polybrain))
#+end_src

#+RESULTS: polybrain
: polybrain-switch

** COMMENT deflayer

This will help with different settings for different brains. Eventually, it can
also be used for different settings for say the org agenda or other
components. 

#+BEGIN_SRC emacs-lisp 

  (use-package deflayer
    :straight (deflayer :type git :host github :repo "dustinlacewell/deflayer.el")
    :config
    ;; for some reason map seems to be required first. 
    (require 'map)
    (require 'deflayer))

  (deflayer sr-brain org-brain
    ((org-brain-path (sr/fun/org-dir "brain"))))


  (deflayer episteme org-brain
    ((org-brain-path (sr/fun/project-dir "episteme/brain/"))))

#+END_SRC

#+RESULTS:
: deflayer-activate-episteme

** org-web-tools
:PROPERTIES:
:ID:       CE6402C3-BDF9-4B59-A01A-DC7EF461CC5A
:END:

This package contains a bunch of useful tools which can cut down a lot of work

#+BEGIN_SRC emacs-lisp
(use-package org-web-tools
:defer 5
:ensure nil
:config
(global-set-key (kbd "H-y") 'org-web-tools-insert-link-for-url))
#+END_SRC

** org-download
:PROPERTIES:
:ID:       A61C506A-FE8A-4051-ACCC-A2F28E8FE4EB
:END:

#+BEGIN_SRC emacs-lisp
(use-package org-download
  :defer nil
  :ensure t
  ;;:after org
  :config
    ;; Drag-and-drop to `dired`
  (add-hook 'dired-mode-hook 'org-download-enable)
  ;; For some reason this still seems required, despite using defer nil
  (require 'org-download)
  )
#+END_SRC

** COMMENT Epubs in emacs 

#+BEGIN_SRC emacs-lisp
(use-package nov
:straight t
:config
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode)))
#+END_SRC
* Dired
:PROPERTIES:
:ID:       62B42FB8-61E2-4EFB-A51A-D6BA13E31EB2
:END:

- Note taken on [2020-03-28 Sat 15:10] \\
  Apparently, dired is not available in to be installed via MELPA.

These are settings dervied from the configuration of [[https://github.com/angrybacon/dotemacs/blob/master/dotemacs.org][Angry Bacon]]. Also adapted from a [[http://pragmaticemacs.com/emacs/tree-style-directory-views-in-dired-with-dired-subtree/][pragmatic emacs article]].

Note that =C-x C-q= for =dired-toggle-read= only.

#+BEGIN_SRC emacs-lisp
(use-package dired-subtree
:straight t
:config
(bind-keys :map dired-mode-map
           ("i" . dired-subtree-insert)
             (";" . dired-subtree-toggle)))

;; Show directories first
 (defun me/dired-directories-first ()
    "Sort dired listings with directories first before adding marks."
    (save-excursion
      (let (buffer-read-only)
        (forward-line 2)
        (sort-regexp-fields t "^.*$" "[ ]*." (point) (point-max)))
      (set-buffer-modified-p nil)))

(advice-add 'dired-readin :after #'me/dired-directories-first)

(add-hook 'dired-mode-hook (lambda () (dired-hide-details-mode) 
			     (setq visual-fill-column-mode 'nil)))

(setq dired-auto-revert-buffer t
   dired-dwim-target t
   dired-hide-details-hide-symlink-targets nil
   dired-listing-switches "-alh"
   dired-ls-F-marks-symlinks nil
   dired-recursive-copies 'always)

#+END_SRC

#+RESULTS:
: always
* Treemacs [0/3]
  :PROPERTIES:
  :ID:       2571745f-97de-4fa9-8d56-0e6599bdc489
  :CREATED:  [2020-01-21 Tue]
  :PLANNED:
  :END:

- [ ] Learn about treemacs projectile
- [ ] Learn about treemacs-magit

As such most of these

#+BEGIN_SRC emacs-lisp
(use-package treemacs
  :ensure t

  :init
  (with-eval-after-load 'winum
    (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
  :config
  (progn
    (setq treemacs-collapse-dirs
          (if (executable-find "python3") 3 0)
          treemacs-deferred-git-apply-delay      0.5
          treemacs-display-in-side-window        t
          treemacs-eldoc-display                 t
          treemacs-file-event-delay              5000
          treemacs-file-follow-delay             0.2
          treemacs-follow-after-init             t
          treemacs-git-command-pipe              ""
          treemacs-goto-tag-strategy             'refetch-index
          treemacs-indentation                   2
          treemacs-indentation-string            " "
          treemacs-is-never-other-window         nil
          treemacs-max-git-entries               5000
          ttreemacs-no-png-images                 nil
          treemacs-no-delete-other-windows       t
          treemacs-project-follow-cleanup        nil
          treemacs-persist-file                  "~/my_org/emacs_meta/.treemacs-persist"
          treemacs-recenter-distance             0.1
          treemacs-recenter-after-file-follow    nil
          treemacs-recenter-after-tag-follow     nil
          treemacs-recenter-after-project-jump   'always
          treemacs-recenter-after-project-expand 'on-distance
          treemacs-show-cursor                   nil
          treemacs-show-hidden-files             t
          treemacs-silent-filewatch              nil
          treemacs-silent-refresh                nil
          treemacs-sorting                       'alphabetic-desc
          treemacs-space-between-root-nodes      t
          treemacs-tag-follow-cleanup            t
          treemacs-tag-follow-delay              1.5
          treemacs-width                         35)

    ;; The default width and height of the icons is 22 pixels. If you are
    ;; using a Hi-DPI display, uncomment this to double the icon size.
    ;;(treemacs-resize-icons 44)

    ;;(treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode t)
    (pcase (cons (not (null (executable-find "git")))
                 (not (null (executable-find "python3"))))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple))))
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("M-s t t" . treemacs)
        ("M-s t w" . treemacs-switch-workspace)
        ;; ("C-x t 1"   . treemacs-delete-other-windows)
        ;; ("C-x t t"   . treemacs)
        ;; ("C-x t B"   . treemacs-bookmark)
        ;; ("C-x t C-t" . treemacs-find-file)
        ;; ("C-x t M-t" . treemacs-find-tag)
        )
  )

#+END_SRC

#+RESULTS:
: treemacs-switch-workspace

#+BEGIN_SRC emacs-lisp
;; (use-package treemacs-evil
;;   :after treemacs evil
;;   :ensure t)

(use-package treemacs-projectile
  :after treemacs projectile
  :ensure t)

(use-package treemacs-icons-dired
  :after treemacs dired
  :ensure t
  :config (treemacs-icons-dired-mode))

(use-package treemacs-magit
  :after treemacs magit
  :ensure t)
#+END_SRC

#+RESULTS:

* Selection, search, navigation and jumps
** smex
:PROPERTIES:
:ID:       09F22945-25AA-4DAE-B1E0-AD309E6FA1DD
:END:
#+BEGIN_SRC emacs-lisp
(straight-use-package 'smex)
#+END_SRC

** Counsel 
:PROPERTIES:
:ID:       4F05CB2A-C98A-433E-AF50-D120F4376192
:END:
- Note taken on [2020-03-30 Mon 18:08] \\
  Apparently, swiper, counsel, ivy are contained in the same repository and not as separate packages. Though I would prefer using counsel for everything with the minibuffer style, rather than helm - there are undoubtedly several advantages and built-in features in helm whereas counsel would need these carefully constructed. For example, it appears that the multiple select and action operation has to be separately defined for =counsel-find-file= and =counsel-switch-buffer=. While =counsel-M-x= seems generally more responsive than =helm-M-x=, helm offers a useful partition of the results in general based on recent commands/files and others. =helm-apropos= offers a list of commands and variables 

This configuration is picked up from scimax.

- [X] Figure out which of these functions benefit from helm rather than counsel.
  - [X] helm-switch-buffer
  - [X] helm-find-file
  - [X] helm-appropos

#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :straight t
    :init
    (require 'ivy)
    (require 'smex)
    ;; switching to using helm for projectile completion
    ;;(setq projectile-completion-system 'ivy)
    (setq ivy-use-virtual-buffers t)
    (define-prefix-command 'counsel-prefix-map)
    (global-set-key (kbd "H-c") 'counsel-prefix-map)

    ;; default pattern ignores order.
    (setf (cdr (assoc t ivy-re-builders-alist))
          'ivy--regex-ignore-order)
    :bind
    (;; ("M-x" . counsel-M-x)
     ;; ("C-x b" . ivy-switch-buffer)
     ;; ("C-x C-f" . counsel-find-file)
     ("C-x l" . counsel-locate)
     ;; ("C-h f" . counsel-describe-function)
     ("C-h v" . counsel-describe-variable)
     ("C-h i" . counsel-info-lookup-symbol)
     ("H-c r" . ivy-resume)
     ("H-c l" . counsel-load-library)
     ("H-c f" . counsel-git)
     ("H-c g" . counsel-git-grep)
     ("H-c a" . counsel-ag)
     ("H-c p" . counsel-pt))
    :diminish ""
    :config
    (progn
      (counsel-mode)
      (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
      (define-key ivy-minibuffer-map (kbd "M-<SPC>") 'ivy-dispatching-done)

      ;; C-RET call and go to next
      (define-key ivy-minibuffer-map (kbd "C-<return>")
        (lambda ()
          "Apply action and move to next/previous candidate."
          (interactive)
          (ivy-call)
          (ivy-next-line)))

      ;; M-RET calls action on all candidates to end.
      (define-key ivy-minibuffer-map (kbd "M-<return>")
        (lambda ()
          "Apply default action to all candidates."
          (interactive)
          (ivy-beginning-of-buffer)
          (loop for i from 0 to (- ivy--length 1)
                do
                (ivy-call)
                (ivy-next-line)
                (ivy--exhibit))
          (exit-minibuffer)))

      ;; s-RET to quit
      (define-key ivy-minibuffer-map (kbd "s-<return>")
        (lambda ()
          "Exit with no action."
          (interactive)
          (ivy-exit-with-action
           (lambda (x) nil))))

      ;; Show keys
      (define-key ivy-minibuffer-map (kbd "?")
        (lambda ()
          (interactive)
          (describe-keymap ivy-minibuffer-map)))

      (define-key ivy-minibuffer-map (kbd "<left>") 'ivy-backward-delete-char)
      (define-key ivy-minibuffer-map (kbd "<right>") 'ivy-alt-done)
      (define-key ivy-minibuffer-map (kbd "C-d") 'ivy-backward-delete-char)))
#+END_SRC

#+RESULTS:
: counsel-pt

** ripgrep

The ripgrep package for the system can be installed via brew or possibly
apt-get on Linux systems.

#+BEGIN_SRC sh :tangle no
brew install ripgrep
#+END_SRC

However, it appears an emacs package is required to interface with the
system installed ripgrep package via Emacs. In addition, there is a
separate helm-rg package to use helm for the interface. The latter is
preferred.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'ripgrep)
#+END_SRC

** Expand region package
   :PROPERTIES:
   :ID:       046c8e8c-a6c0-451e-9e7e-61de54ab0945
   :END:
- Note taken on [2019-02-07 Thu 09:27]  \\
  Explore how this works, and customise it.

This can be set to intelligently expand the selection of text. For example, Using the designated binding, the first expansionh would cover say the content between quotes, and then expand outwards.

#+begin_src emacs-lisp
(use-package expand-region
  :ensure t
  :bind ("C-=" . er/expand-region))

(message "Loaded easier selection")
#+end_src

#+RESULTS:
: Loaded easier selection
