emacs-config.org
** Hippie Expand
:PROPERTIES:
:ID:       C2CE1B2C-9935-4D7B-BEA2-96AC344360DE
:END:

This is a nifty little package that makes expansion of selection at point more customised, and is handy for expanding into variable names and function names in the same buffer, especially for a long snippet of code.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-/") (make-hippie-expand-function
			     '(try-expand-dabbrev-visible
			       try-expand-dabbrev
			       try-expand-dabbrev-all-buffers) t))
#+END_SRC

#+RESULTS:
| lambda | (arg) | Try to expand text before point, using the following functions: |
** Browse kill ring
:PROPERTIES:
:ID:       91183327-CDC5-482B-8A21-303467ED1AE3
:END:
- Note taken on [2020-03-30 Mon 18:20] \\
  This command allows an interactive browsing and insertion from the kill ring. However it does not allow a search. For enabling a search of the kill ring in addition to marking and insertion =helm-king-ring= can be used. However the latter method does not offer a preview of the material being yanked.

#+BEGIN_SRC emacs-lisp
(use-package browse-kill-ring
:bind ("M-y" . browse-kill-ring)
  :ensure t
)
#+END_SRC

#+RESULTS:
: browse-kill-ring
** Multiple Cursors
:PROPERTIES:
:ID:       06039005-b802-43bd-92f5-05439cebc759
:END:

#+begin_src emacs-lisp
(use-package multiple-cursors
  :ensure t
  :config
  (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
  )

(message "Loaded MC")
#+end_src

#+RESULTS:
: Loaded MC

** Undo tree
:PROPERTIES:
:ID:       1E24E30A-6578-4AA4-8655-4E6EED49ECE5
:END:
Reference: https://github.com/alhassy/emacs.d
This is an indispensable tool. The additional options of showing the timestamp and diff would be.

#+BEGIN_SRC emacs-lisp
;; Allow tree-semantics for undo operations.
(use-package undo-tree
  :diminish undo-tree-mode                      ;; Don't show an icon in the modeline
  :config
    ;; Always have it on
    (global-undo-tree-mode)

    ;; Each node in the undo tree should have a timestamp.
    (setq undo-tree-visualizer-timestamps t)

    ;; Show a diff window displaying changes between undo nodes.
;; Execute (undo-tree-visualize) then navigate along the tree to witness
;; changes being made to your file live!
)
#+END_SRC

#+RESULTS:
: t
** yasnippet and ivy-yasnippet
:PROPERTIES:
:ID:       2BEDC957-9D0A-4BEC-AE97-CCD186A98724
:END:

- [ ] setup the shortcut 'H-,' as desinged in scimax default for ivy-yasnippet

#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :straight t
    :config
    (setq yas-snippet-dirs (append yas-snippet-dirs
                               '("~/.emacs.d/private-snippets/")))
  (yas-global-mode 1))

(use-package ivy-yasnippet
  :bind ("M-s i" . ivy-yasnippet))
#+END_SRC

#+RESULTS:
: ivy-yasnippet

** swiper
:PROPERTIES:
:ID:       2DEA32C7-F18C-4DC0-B924-450C45F351A6
:END:
- Note taken on [2020-03-30 Mon 18:05] \\
  I had this to counsel-swiper-or-grep. However at times, the grep result would show as a binary file even though the file was clearly not binary. I have switched to using only swiper without counsel.

#+BEGIN_SRC emacs-lisp
(use-package swiper
  :bind
  ("C-s" . swiper)
  ("H-s" . swiper-all)
  :diminish ivy-mode
  :config
  (ivy-mode))
#+END_SRC

#+RESULTS:
: swiper-all

** avy
:PROPERTIES:
:ID:       F9CBA6DB-15F3-45E9-94AB-5E92C3F62AB3
:END:

#+BEGIN_SRC emacs-lisp
(use-package avy)
#+END_SRC
** Super and Hyper key setting
:PROPERTIES:
:ID:       97DFBDF2-BD73-4DAA-9CA0-2A1D39855CF6
:END:

#+BEGIN_SRC emacs-lisp
(if (system-type-is-darwin)
    (progn
      (setq mac-left-command-modifier 'super)
      (setq mac-right-option-modifier 'hyper)))
#+END_SRC
** Helm packages and functions

I am of the opinion that both helm and counsel/ivy have their advantages
for different workflows and mindsets. My configuration will attempt to
use both based on what I find useful.

*** Helm notes

Despite using these command frequently, I find that I forget some of
them. This is an attempt to note down useful commands for ready
reference.

=C-u C-c C-k= using helm-find-file will copy the absolute path of the
file to the kill ring. Not using the modifier will copy only the
filename. =C-c C-i= or =C-c TAB= for copying the path to the current
buffer.

While browsing directories, use =C-j= to go into a directory and =C-l= to
move up.

=C-space= to select multiple files and open them with =RET=. This is useful when
switching to a project. Add a modifier =C-u RET= to open the files in an
alternate vertically split buffers. 

Find file as root =C-c r= does not require the Tramp syntax!

*** Setting helm for some basic functions
:PROPERTIES:
:ID:       BC827A7A-D190-4CC6-95D5-0C80740CB94C
:END:

#+BEGIN_SRC emacs-lisp
(use-package helm
:config
(helm-mode 1)
(require 'helm-config)

(global-set-key (kbd "M-x") 'helm-M-x)
(global-set-key (kbd "C-h f") 'helm-apropos)
(global-set-key (kbd "C-x C-f") 'helm-find-files)
(global-set-key (kbd "C-x b") 'helm-mini)
(global-set-key (kbd "C-c y") 'helm-show-kill-ring)
(global-set-key (kbd "C-x C-r") 'helm-recentf))

#+END_SRC

: helm-find-file

*** General settings for helm

There are some useful tips in the reddit thread [[https://www.reddit.com/r/emacs/comments/bsc8pc/why_did_you_stop_using_helm/][Why did you stop using
Helm? : emacs]]. The [[https://tuhdo.github.io/helm-intro.html][helm-intro]] is a good resource. The documentation is
the best guide as always.

#+BEGIN_SRC emacs-lisp
;; Don't have helm do window management for me
(setq helm-display-function 'pop-to-buffer)

;; optimising highlight speed of token matches
(setq helm-mp-highlight-delay 0.3)

;; from the reddit thread above
(setq helm-use-undecorated-frame-option t)
(setq helm-display-buffer-reuse-frame t)

;; These are required to prevent crazy jumps in the helm buffer size
(setq helm-autoresize-max-height 0)
(setq helm-autoresize-min-height 20)
(helm-autoresize-mode 1)

(setq helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
      helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
      helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
      helm-echo-input-in-header-line t)

#+END_SRC

*** Helm bibtex and projectile
#+BEGIN_SRC emacs-lisp
(straight-use-package 'helm-bibtex)

(straight-use-package 'helm-projectile)
#+END_SRC

*** helm-ag
:PROPERTIES:
:ID:       B4E26FDE-BA84-4BDB-AA94-B4706E47C64B
:END:

- [ ] [[https://emacs.stackexchange.com/questions/30204/how-to-tell-helm-to-ignore-certain-files][How to tell Helm to ignore certain files? - Emacs Stack Exchange]]
  - This needs to be explored further for code project files and the
    specific options needed for different situations. I need to expand
    on this with more clarity.
  - One method of ignoring certain patterns is using --ignore=*.csv
    - Some specific patterns could be saved as prefixed options and
      added as optional search functions depending on the occassion. 

#+BEGIN_QUOTE
I'm not sure when this functionality was introduced, but you can exclude
files from helm-find-files by setting helm-ff-skip-boring-files to t and
making sure the ignored pattern is on helm-boring-file-regexp-list. From
its documentation:


   > Non--nil to skip files matching regexps in
   helm-boring-file-regexp-list. This take effect in helm-find-files and
   file completion used by helm-mode i.e helm-read-file-name.

And the documentation for helm-boring-file-regexp-list says that by
default it is built from completion-ignored-extensions.
#+END_QUOTE


Another option is to use [[https://github.com/emacsorphanage/helm-ag#helm-ag-use-agignoredefault-nil][.agignore]] at the project root. This is set to
nil by default. This kind of ignore option needs to be used carefully,
or it will exclude important results. 


#+BEGIN_SRC emacs-lisp
(straight-use-package 'helm-ag)
(setq helm-ag-use-agignore 1)
#+END_SRC

*** helm-rg

#+BEGIN_SRC emacs-lisp
(straight-use-package 'helm-rg)
#+END_SRC

*** helm-org-rifle 
:PROPERTIES:
:ID:       510AB91F-1520-487B-9CE3-FF4C69AC09FA
:END:

#+BEGIN_SRC emacs-lisp
(use-package helm-org-rifle
  :straight t
  :config
  (global-set-key (kbd "C-c C-w") #'helm-org-rifle--refile))
#+END_SRC

*** Helm swoop
:PROPERTIES:
:ID:       6539A414-F78C-4926-86D3-12C076D567FF
:END:

#+BEGIN_SRC emacs-lisp
(use-package helm-swoop
  :ensure t
  :bind (("M-i" . helm-swoop)
         ("M-I" . helm-swoop-back-to-last-point)
         ("C-c M-i" . helm-multi-swoop))
  :config
  ;; When doing isearch, hand the word over to helm-swoop
  (define-key isearch-mode-map (kbd "M-i") 'helm-swoop-from-isearch)
  ;; From helm-swoop to helm-multi-swoop-all
  (define-key helm-swoop-map (kbd "M-i") 'helm-multi-swoop-all-from-helm-swoop)
  ;; Save buffer when helm-multi-swoop-edit complete
  (setq helm-multi-swoop-edit-save t
        ;; If this value is t, split window inside the current window
        helm-swoop-split-with-multiple-windows t
        ;; Split direcion. 'split-window-vertically or 'split-window-horizontally
        helm-swoop-split-direction 'split-window-vertically
        ;; If nil, you can slightly boost invoke speed in exchange for text color
        helm-swoop-speed-or-color nil))
#+END_SRC

: helm-multi-swoop
** TODO Projectile and helm
Since implementing the Doom GC optimisation, the slight lag I
experienced while typing really fast in helm commands has
subsided. /However, there seems to be a slight lag in calling
describe-variable and describe-functions, which was not there
earlier/. The solution I am currently using is to switch to
=helm-appropos=, which apparently has some kind of mechanism to concat
large lists of commands, variables, functions. I think there is some
benefit in switching over to Helm for general options. This is an
experimental section to try this out. The article [[https://tuhdo.github.io/helm-projectile.html][Exploring large
projects with Projectile and Helm Projectile]] contains a large number of
tips in setting up projectile with helm.

#+BEGIN_SRC emacs-lisp
(setq projectile-completion-system 'helm)
(setq projectile-indexing-method 'alien)
(setq projectile-switch-project-action 'helm-projectile)
(helm-projectile-on)
#+END_SRC

** COMMENT ace-isearch
- Note taken on [2020-04-04 Sat 16:46] \\
  While the concept is clear, I am not yet sure how the function is
  getting activated or whether it will work as I think it might. I am
  generally more comfortable using a specific function for a specific
  purpose. THis requires further investigation.

#+BEGIN_SRC emacs-lisp
(use-package ace-isearch
:after helm-swoop avy
:config
(global-ace-isearch-mode +1))
#+END_SRC
** Copy simple without breaks

#+BEGIN_SRC emacs-lisp
;; http://emacs.stackexchange.com/questions/1051/copy-region-from-emacs-without-newlines
;; https://gist.github.com/xahlee/d364cbbff9b3abd12d29
(defun my-copy-simple (&optional beg end)
  "Save the current region (or line) to the `kill-ring' after stripping extra whitespace and new lines"
  (interactive
   (if (region-active-p)
       (list (region-beginning) (region-end))
     (list (line-beginning-position) (line-end-position))))
  (let ((my-text (buffer-substring-no-properties beg end)))
    (with-temp-buffer 
      (insert my-text)
      (goto-char 1)
      (while (looking-at "[ \t\n]")
        (delete-char 1))
      (let ((fill-column 9333999))
        (fill-region (point-min) (point-max)))
      (kill-region (point-min) (point-max)))))
#+END_SRC


* Email
