emacs-config.org
** flycheck
:PROPERTIES:
:ID:       C8BBC1FA-A0D3-4CC6-9053-D7DAD0A28491
:END:

#+BEGIN_SRC emacs-lisp
(straight-use-package 'flycheck)
#+END_SRC

** TODO Python [0/7]
- Note taken on [2020-03-23 Mon 18:10] \\
  For now I will disable this as it appears logical to use pyenv and other packages to set the correct interpreter. However, since shims are being used, one would assume that the correct environment will be used anyway.

At the moment, [[nb:.emacs.d::init.org::#MY Scimax packages][Scimax packages]] require pydoc, elpy and jedi, which are already installed. These packages have to be grouped here.

[[https://realpython.com/emacs-the-best-python-editor/][Emacs: The Best Python Editor? Real Python]] is a good guide towards setting up Emacs and python. [[https://medium.com/analytics-vidhya/managing-a-python-development-environment-in-emacs-43897fd48c6a][Managing a Python development environment in Emacs - Analytics Vidhya - Medium]] provides a satisfyingly detailed configuration with customisations for python. The latter guide is worth following. 

#+BEGIN_SRC emacs-lisp :tangle no
;; Enabling python 3 to be the default interpreter.
(setq python-shell-interpreter "python3")
(setq org-babel-python-command "python3")
(setq flycheck-python-pycompile-executable "python3")

;; Enabling flycheck for elpy mode

(when (require 'flycheck nil t)
  (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
  (add-hook 'elpy-mode-hook 'flycheck-mode))

#+END_SRC

- [ ] pyment
- [ ] isort
- [ ] pyenv version alias and activating on a per buffer basis
- [ ] pyvenv
- [ ] pydoc
- [ ] elpy
- [ ] blacken

*** EIN notebooks

- [ ] enable visual line mode?
- [ ] Enable pictures by default
- [ ] possible for better latex rendering?

#+BEGIN_SRC emacs-lisp
(use-package ein
:defer t
:ensure t
:config
(package-initialize)
(require 'ein)
(require 'ein-notebook)
(require 'ein-subpackages)
)
#+END_SRC

*** emacs-lsp
#+BEGIN_SRC emacs-lisp
(use-package lsp-python-ms
  :ensure t
  :hook (python-mode . (lambda ()
                          (require 'lsp-python-ms)
                          (lsp))))  ; or lsp-deferred
#+END_SRC

| (lambda nil (require 'lsp-python-ms) (lsp)) | er/add-python-mode-expansions | blacken-mode | elpy-mode |

*** pyvenv, pydoc and elpy
#+BEGIN_SRC emacs-lisp
(straight-use-package 'pyvenv)
(straight-use-package 'pydoc)

(use-package elpy
  :straight t
  :config
  (elpy-enable))
#+END_SRC

*** COMMENT pyenv
- Note taken on [2020-03-29 Sun 17:00] \\
  I am predominantly using pyvenv at the moment with a single pyenv. This will be useful to look into down the line.

#+BEGIN_SRC emacs-lisp
(use-package pyenv
    :straight (:host github :repo "aiguofer/pyenv.el")
    :config
    (setq pyenv-use-alias 't)
    (setq pyenv-modestring-prefix "PyE-")
    (setq pyenv-modestring-postfix nil)
    (setq pyenv-set-path nil)(global-pyenv-mode)
    (defun pyenv-update-on-buffer-switch (prev curr)
      (if (string-equal "Python" (format-mode-line mode-name nil nil curr))
          (pyenv-use-corresponding)))
    (add-hook 'switch-buffer-functions 'pyenv-update-on-buffer-switch))
#+END_SRC

#+RESULTS:
: t

*** Blacken
:PROPERTIES:
:ID:       C874811C-37CA-4353-9C61-DBC6793AFC82
:END:

The black library will re-format the code on a save. Elpy will automatically use black, as long as the elisp package installed, along with the python black package which can be installed using pip

#+BEGIN_SRC sh :tangle no
pip3 install black
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package blacken
:straight t
:hook (python-mode . blacken-mode))
#+END_SRC

* Docker

The following packages will enable me to handle docker containers right within Emacs.

*** Docker package
:PROPERTIES:
:ID:       91f02de1-f2d3-4722-9e18-df78f4b6ad95
:END:

With this package, I can easily view the containers available and run commands on them from emac without switching over the terminal.

#+BEGIN_SRC emacs-lisp
(use-package docker
  :ensure t

  :bind ("M-s d" . docker)
)
#+END_SRC

#+RESULTS:
: docker

*** docker-compose-mode
:PROPERTIES:
:ID:       e887c7b6-5e53-49fb-ab13-a37ab7944407
:END:

Enabling syntax highlighting for docker-compose files.

#+BEGIN_SRC emacs-lisp :tangle no
(use-package docker-compose-mode
  :ensure t

  :config
;;  (require 'docker-compose-mode)
  (add-to-list 'auto-mode-alist
               '("docker-compose\\" . docker-compose-mode))
  )
#+END_SRC

#+RESULTS:

*** docker-file-mode
:PROPERTIES:
:ID:       33fdbbf6-5e67-43e7-8c84-aa90fa6b9de6
:END:

This is required for syntax highlighting in dockerfiles.

#+BEGIN_SRC emacs-lisp :tangle no
(use-package dockerfile-mode
  :ensure t

  :config
  (require 'dockerfile-mode)
  (add-to-list 'auto-mode-alist
               '("Dockerfile\\" . dockerfile-mode)
               )
  )
#+END_SRC

#+RESULTS:


* TODO Custom search functions [0/1]
This section contains sections to search in specific directories, with customised options.

- [ ] Incorporate these functions into a hydra.
  - [ ] Explore ldlework's hera and nougat hydra packages for this. Perhaps include into scimax under the applications menu. 

** Episteme search
:PROPERTIES:
:ID:       001EE8FC-2C5B-4A7C-8BA7-DEAB94A808AA
:END:
Adapted from ldlework

#+BEGIN_SRC emacs-lisp
(defun episteme-search ()
  (interactive)
  (helm-do-ag (sr/fun/project-dir "episteme/brain"))
  (let* ((p (point))
         (f (org-brain-first-headline-position))
         (adjusted-point (max 0 (- p f))))
    (org-brain-visualize (file-name-sans-extension (buffer-name)))
    (with-current-buffer "*org-brain*"
      (let ((minmax (polybrain--get-point-min-max)))
        (goto-char (+ (car minmax) adjusted-point))))))(require 'f)
#+END_SRC

** Projects search [0/6]
:PROPERTIES:
:ID:       8351BECB-609E-4D19-9DAE-C03728380FCB
:END:
- [ ] Exclude git files
- [ ] Exclude csv files
- [ ] Exclude html and related files 
- [ ] decide between helm-ag and counsel-ag and the method to jump between files.
- [ ] Decide about plugging in arguments to activate different kinds of search.
- [ ] Find if multiple paths can be included or not. 

#+BEGIN_SRC emacs-lisp
(defun sr/fun/proj-search ()
  (interactive)
  (helm-do-ag (sr/fun/project-dir "")))
#+END_SRC

** Org files search
:PROPERTIES:
:ID:       E34847DB-7470-4BBC-8DA1-0A1823FD5890
:END:

#+BEGIN_SRC emacs-lisp
(defun sr/fun/org-search ()
  (interactive)
  (helm-do-ag (sr/fun/org-dir "")))
#+END_SRC

** Journal files search

#+BEGIN_SRC emacs-lisp
(defun sr/fun/org-journal-search ()
  (interactive)
  (helm-do-ag (sr/fun/org-dir "journal")))
#+END_SRC

* TODO Hydra Hera and nougat

This hydra setup is based off hera and nougat, which are packages
available in [[https://dustinlacewell.github.io/emacs.d/][ldlework's init.el]]. I've adapted, modified and expanded his
setup. These cool packages make defining hydras a little easier,
especially in a stack.
** hera
:PROPERTIES:
:ID:       E6516FB9-DC4A-44EC-98F9-8A2420F2B219
:END:

ldlework's package that provides an API for defining a stack of hydras. 

#+BEGIN_SRC emacs-lisp
(use-package hera
:demand t
:straight (hera :type git :host github :repo "dustinlacewell/hera"))
#+END_SRC

#+RESULTS:

** nougat-hydra
:PROPERTIES:
:ID:       70D6E497-A30F-4027-8D4D-D5CF9C21E788
:END:

#+BEGIN_SRC emacs-lisp
(defun nougat--inject-hint (symbol hint)
(-let* ((name (symbol-name symbol))
(hint-symbol (intern (format "%s/hint" name)))
(format-form (eval hint-symbol))
(string-cdr (nthcdr 1 format-form))
(format-string (string-trim (car string-cdr)))
(amended-string (format "%s\n\n%s" format-string hint)))
(setcar string-cdr amended-string)))

(defun nougat--make-head-hint (head default-color)
(-let (((key _ hint . rest) head))
(when key
(-let* (((&plist :color color) rest)
(color (or color default-color))
(face (intern (format "hydra-face-%s" color)))
(propertized-key (propertize key 'face face)))
(format " [%s]: %s" propertized-key hint)))))

(defun nougat--make-hint (heads default-color)
(string-join
(cl-loop for head in heads
for hint = (nougat--make-head-hint head default-color)
do (pp hint)
collect hint) "\n"))

(defun nougat--clear-hint (head)
(-let* (((key form _ . rest) head))
`(,key ,form nil ,@rest)))

(defun nougat--add-exit-head (heads)
(let ((exit-head '("SPC" (hera-pop) "to exit" :color blue)))
(append heads `(,exit-head))))

(defun nougat--add-heads (columns extra-heads)
(let* ((cell (nthcdr 1 columns))
(heads (car cell))
(extra-heads (mapcar 'nougat--clear-hint extra-heads)))
(setcar cell (append heads extra-heads))))

(defmacro nougat-hydra (name body columns &optional extra-heads)
(declare (indent defun))
(-let* (((&plist :color default-color :major-mode mode) body)
(extra-heads (nougat--add-exit-head extra-heads))
(extra-hint (nougat--make-hint extra-heads default-color))
(body (plist-put body :hint nil))
(body-name (format "%s/body" (symbol-name name)))
(body-symbol (intern body-name))
(mode-support
`(when ',mode
(setq major-mode-hydra--body-cache
(a-assoc major-mode-hydra--body-cache ',mode ',body-symbol)))))
(nougat--add-heads columns extra-heads)
(when mode
(remf body :major-mode))
`(progn
(pretty-hydra-define ,name ,body ,columns)
(nougat--inject-hint ',name ,extra-hint)
,mode-support)))

;; (nougat-hydra hydra-test (:color red :major-mode fundamental-mode)
;; ("First"
;; (("a" (message "first - a") "msg a" :color blue)
;; ("b" (message "first - b") "msg b"))
;; "Second"
;; (("c" (message "second - c") "msg c" :color blue)
;; ("d" (message "second - d") "msg d"))))
#+END_SRC

#+RESULTS:
: nougat-hydra

** hydra-dwim
:PROPERTIES:
:ID:       83B2E03A-A2DF-468B-9004-C36FDA0FAE9C
:END:
- Note taken on [2020-04-04 Sat 17:17] \\
  I still need to integrate these hydras with scimax hydras and figure out
  a good key for the exit.

#+BEGIN_SRC emacs-lisp
(defun my/hydra-dwim ()
(interactive)
(-let (((&alist major-mode mode) major-mode-hydra--body-cache))
(if mode (major-mode-hydra)
(hera-start 'hydra-default/body))))

(setq kbd-hera-pop "Q")
(global-set-key (kbd "H-l") 'my/hydra-dwim)
(global-set-key (kbd "H-l") (lambda () (interactive) (hera-start 'hydra-default/body)))

#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (hera-start 'hydra-default/body) |

** hydra-default
:PROPERTIES:
:ID:       76AD6939-FBF3-40A1-8AAB-31355ED12259
:END:

#+BEGIN_SRC emacs-lisp
(defhydra hydra-default (:color blue :hint nil)
"

Entrypoint Hydra

"
("a" (org-agenda nil "a") "agenda" :column "Open")
;; ("p" (hera-push 'hydra-projectile/body) "projectile")
("c" (org-capture) "capture")
("t" (hera-push 'hydra-treemacs/body))
("b" (hera-push 'hydra-bookmarks/body) "bookmarks")
("h" (hera-push 'hydra-help/body) "help" :column "Emacs")
("m" (hera-push 'hydra-mu4e/body) "mail")
("w" (hera-push 'hydra-window/body) "windows")
("z" (hera-push 'hydra-zoom/body) "zoom")
("R" (hera-push 'hydra-registers/body) "registers")
("n" (hera-push 'hydra-notes/body) "notes" :column "Misc")
("S" (hera-push 'hydra-straight/body) "Straight")
("s" (call-interactively 'helm-imenu) "semantic")
("g" (hera-push 'hydra-gist/body) "gist")
("p" (hera-push 'hydra-pyvenv/body) "pyvenv" :column "python")
("j" (hera-push 'hydra-journal/body) "Journal" :column "Daily")
("o" (hera-push 'hydra-clock/body) "Clock" :column "Daily")
("l" (hera-push 'hydra-links/body) "Links"))

#+END_SRC

#+RESULTS:
: hydra-default/body
** hydra-straight
:PROPERTIES:
:ID:       6CAF1975-F604-41AB-B402-27F3461D068C
:END:

#+BEGIN_SRC emacs-lisp
(defun sr/fun/straight-pull-rebuild-combo (&optional package)
  "Function to select a package, and then -> pull and rebuild using straight."
  (interactive)
  (let ((package (or package
                     (straight--select-package "Pull & Rebuild package" 'for-build 'installed))))
    (message package)
    (straight-pull-package package)
    (straight-rebuild-package package)))


(nougat-hydra hydra-straight (:color red)
  ("Straight" (("P" (call-interactively 'straight-pull-package)
		"Pull one")
	       ("p" (call-interactively 'sr/fun/straight-pull-rebuild-combo)
		"Pull and Rebuild one package" :column "Pull")
	       ("C-a" (straight-pull-all) "Pull ALL")
	       ("f" (call-interactively 'straight-fetch-package)
		"Fetch one")
	       ("F" (straight-fetch-all) "Fetch ALL")
	       ("w" (call-interactively 'straight-visit-package-website) "visit package Website")
	       ("g" (call-interactively 'straight-get-recipe)
		"Get recipe")
	     ("r" (call-interactively 'straight-rebuild-package)
		"rebuild package")
	       )))
#+END_SRC

#+RESULTS:
** hydra-mu4e
:PROPERTIES:
:ID:       C319B9EC-65A6-48B9-B89D-849C866CA4B9
:END:

#+BEGIN_SRC emacs-lisp
(nougat-hydra hydra-mu4e (:color blue)
("mu4e" (("m" (mu4e) "mail")
	     ("u" (mu4e-update-mail-and-index) "Update mail and index"))))
#+END_SRC

#+RESULTS:
** hydra-pyvenv
:PROPERTIES:
:ID:       52E4B983-F0A4-433B-B2DC-A464127E8933
:END:

#+BEGIN_SRC emacs-lisp
(nougat-hydra hydra-pyvenv (:color red)
  ("pyvenv - virtualenv" (("c" (call-interactively 'pyvenv-create)
		"create")
	       ("w" (call-interactively 'pyvenv-workon) "work on")
	       ("a" (call-interactively 'pyvenv-activate)	"activate")
	       ("d" (call-interactively 'pyvenv-deactivate) "deactivate")
	       ("t" (call-interactively 'pyvenv-tracking-mode) "tracking mode")
	       ("r" (call-interactively 'pyvenv-restart-python) "restart python") 
	       )))
#+END_SRC

#+RESULTS:

** hydra-window

- Note taken on [2020-04-08 Wed 12:34] \\
  For some reason, ace commands for windows ask for a 2nd number even with
  only 2 windows in the frame. This may be because the buffer is open in
  another frame as well. THis has to be fixed.

#+BEGIN_SRC emacs-lisp
(use-package ace-window)
(winner-mode 1)

(nougat-hydra hydra-window (:color red)
("Jump"
(("h" windmove-left "left")
("l" windmove-right "right")
("k" windmove-up "up")
("j" windmove-down "down")
("a" ace-select-window "ace")
("s" ace-swap-window "ace-swap"))
"Split"
(("q" split-window-right "left")
("r" (progn (split-window-right) (call-interactively 'other-window)) "right")
("e" split-window-below "up")
("w" (progn (split-window-below) (call-interactively 'other-window)) "down"))
"Do"
(("d" delete-window "delete")
("o" delete-other-windows "delete others")
("u" winner-undo "undo")
("R" winner-redo "redo")
("t" nougat-hydra-toggle-window "toggle"))))
#+END_SRC

Toggle window split

#+BEGIN_SRC emacs-lisp
(defun my/toggle-window-split (&optional arg)
"Switch between 2 windows split horizontally or vertically.
With ARG, swap them instead."
(interactive "P")
(unless (= (count-windows) 2)
(user-error "Not two windows"))
;; Swap two windows
(if arg
(let ((this-win-buffer (window-buffer))
(next-win-buffer (window-buffer (next-window))))
(set-window-buffer (selected-window) next-win-buffer)
(set-window-buffer (next-window) this-win-buffer))
;; Swap between horizontal and vertical splits
(let* ((this-win-buffer (window-buffer))
(next-win-buffer (window-buffer (next-window)))
(this-win-edges (window-edges (selected-window)))
(next-win-edges (window-edges (next-window)))
(this-win-2nd (not (and (<= (car this-win-edges)
(car next-win-edges))
(<= (cadr this-win-edges)
(cadr next-win-edges)))))
(splitter
(if (= (car this-win-edges)
(car (window-edges (next-window))))
'split-window-horizontally
'split-window-vertically)))
(delete-other-windows)
(let ((first-win (selected-window)))
(funcall splitter)
(if this-win-2nd (other-window 1))
(set-window-buffer (selected-window) this-win-buffer)
(set-window-buffer (next-window) next-win-buffer)
(select-window first-win)
(if this-win-2nd (other-window 1))))))
#+END_SRC

** hydra-treemacs

#+BEGIN_SRC emacs-lisp
(nougat-hydra hydra-treemacs (:color red)
("Workspace"
(("t" treemacs "Treemacs buffer" :color red)
("o" treemacs-switch-workspace "switch workspace" :color red)
("n" treemacs-create-workspace "new workspace" :color red)
("k" treemacs-delete-workspace "kill")
("r" treemacs-rename-workspace "rename")
("c" treemacs-collapse-other-projects "collapse other projects" :color blue))))
#+END_SRC

