emacs-config.org
** hydra-journal

#+BEGIN_SRC emacs-lisp
(nougat-hydra hydra-journal (:color blue)
("Journal"
(("j"  org-journal-new-entry "Entry")
 ("n" org-journal-open-next-entry "Next entry" :color red)
 ("p" org-journal-open-previous-entry "Previous entry" :color red)
 ("F" org-journal-new-scheduled-entry "Future scheduled")
 ("s" sr/fun/org-journal-search "Journal search")
 ("S" sr/fun/org-search "Org directory search"))))

(global-set-key (kbd "H-j") (lambda () (interactive) (hera-start 'hydra-journal/body)))
#+END_SRC

** hydra-clock

- [ ] I will need to integrate this down the line with shortcuts for org mode.

#+BEGIN_SRC emacs-lisp
(nougat-hydra hydra-clock (:color blue)
("clock"
(("j" counsel-org-clock-goto "clock go to current/last" :color red)
("i" counsel-org-clock-history "counsel clock in/historyo" :color blue)
("c" counsel-org-clock-context "counsel clock context" :color blue)
("o" org-clock-out "clock out" :color red)
("h" org-mru-clock-in "mru clock in" :color blue))))
#+END_SRC

** hydra-links

#+BEGIN_SRC emacs-lisp  
(nougat-hydra hydra-links (:color blue)
("links"
(("y" yt "youtube music playlist" :color blue)
("h" hn "hacker news" :color blue)
("w" wikipedia-search "wikipedia" :color blue)
("g" counsel-google "counsel web search" :color blue)
("G" google "Launch google" :color blue)
("d" define-word "define word" :color red)
("D" lookup-word "wiktionary lookup" :color red)
("m" mw-thesaurus-lookup-at-point "Merriam-webster thesaurus" :color red))))
#+END_SRC

* Pastes
** Webpaste
- Note taken on [2020-03-29 Sun 11:18] \\
  This package is useful to use multiple paste services with a fallback. dpaste has a pleasant format and therefore chosen as the first priority. The advantage of using github gists is that org mode exports can be directly rendered. This package can also be configured to use a custom paste service.

#+BEGIN_SRC emacs-lisp
(use-package webpaste
  :ensure t
  :config
  (progn
    (setq webpaste-provider-priority '("dpaste.org" "ix.io"))))
#+END_SRC

#+RESULTS:
: t

** github gists
:PROPERTIES:
:ID:       E33FD48A-4049-464E-B956-9BEA3A48B07E
:END:
Gists posted right from emacs. 

#+BEGIN_SRC emacs-lisp
(use-package gist
:straight (gist :type git :host github :repo "defunkt/gist.el"))


(nougat-hydra hydra-gist (:color blue)
("Gist" (("p" (gist-region-or-buffer) "public")
("P" (gist-region-or-buffer-private) "private")
("b" (browse-url "https://gist.github.com/shrysr") "browse"))))
#+END_SRC

#+RESULTS:
* TODO org-id

Using the org-id for reference to headings ensures that even if the
heading changes, the links will still work.

In addition, I would like an org id to be created every time the capture
is used. This facilitates using packages like org-brain which rely
extensively on org-id's.

#+BEGIN_SRC emacs-lisp
  (require 'org-id)
  (setq org-id-link-to-org-use-id t)
  ;; (org-link-set-parameters "id" :store #'org-id-store-link)
  ;; (org-link-set-parameters "nb" :store nil)
  (org-link-set-parameters 'nil)
  ;; (org-link-set-parameters "nb" :store nil)
  ;; ;; Update ID file .org-id-locations on startup
  ;; ;; This adds too much time to startup
  ;; ;; (org-id-update-id-locations)

  (setq org-id-method (quote uuidgen))
  (setq org-id-track-globally t)
  (setq org-id-locations-file "~/my_org/emacs_meta/.org-id-locations")
  ;; (add-hook 'org-capture-prepare-finalize-hook 'org-id-get-create)
#+end_src

#+RESULTS:
: ~/my_org/emacs_meta/.org-id-locations
* COMMENT Elfeed :elfeed:
- Note taken on [2019-09-25 Wed 14:09] \\
  Scimax's elfeed is enabled, along with elfeed-org and elfeeed-goodies
- Note taken on [2019-07-08 Mon 08:10] \\
  Disabling elfeed for now.

** Scimax + Elfeed-org and elfeed-goodies setup [/]
:PROPERTIES:
:ID:       8302d89f-756b-4a47-87aa-3f3df5a39a3f
:END:
Using an org source is the easiest way to organise my RSS feeds for reading with Elfeed.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'elfeed)
;; use an org file to organise feeds
(use-package elfeed-org
  :ensure t
  :config
  (setq rmh-elfeed-org-files (list "~/my_org/elfeed.org"))
  )

(use-package elfeed-goodies
  :ensure t
  :init
  (elfeed-goodies/setup)
  )

;; (require 'scimax-elfeed)

#+end_src

#+RESULTS:

** Elfeed get full entry

Source: [[https://punchagan.muse-amuse.in/blog/elfeed-hook-to-fetch-full-content/][Elfeed hook to fetch full content - Noetic Nought]]

#+BEGIN_SRC emacs-lisp
(defun pc/get-url-content (url)
  "Fetches the content for a url."
  (shell-command-to-string (format "~/bin/get_article.py %s" url)))

(defun pc/get-entry-content (entry)
  "Fetches content for pinboard entries that are not tweets."
  (interactive
   (let ((entry elfeed-show-entry))
     (list entry)))

  (let ((url (elfeed-entry-link entry))
        (feed-id (elfeed-deref (elfeed-entry-feed-id entry)))
        (content (elfeed-deref (elfeed-entry-content entry))))
    (when (and (s-matches? "feeds.pinboard.in/" feed-id)
               (not (s-matches? "twitter.com/\\|pdf$\\|png$\\|jpg$" url))
               (string-equal "" content))
      (setq content (pc/get-url-content url))
      (setf (elfeed-entry-content entry) (elfeed-ref content)))))

(add-hook 'elfeed-new-entry-hook #'pc/get-entry-content)
#+END_SRC

#+RESULTS:
| pc/get-entry-content | elfeed-goodies/html-decode-title | elfeed-org-run-new-entry-hook |

** COMMENT Elfeed Basic + Customisations
- Note taken on [2020-03-28 Sat 15:50] \\
  This was my earlier configuration. However, there are issues with the save db feature and I am anyway not really syncing across computers anymore. I read feeds on my VPS. Scimax's elfeed customisations provide me the functions that I need as I can easily email an article to instapaper or anywhere else. However, these remain here for reference, as there are some useful functions here.

Source: [[http://heikkil.github.io/blog/2015/05/09/notes-from-elfeed-entries/][Note taking 3: Notes from elfeed entries - Heikki @ home]] 

#+BEGIN_SRC emacs-lisp
;; Elfeed configuration source :
(use-package elfeed
  :bind (:map elfeed-search-mode-map
              ("A" . bjm/elfeed-show-all)
              ("E" . bjm/elfeed-show-emacs)
              ("D" . bjm/elfeed-show-daily)
              ("q" . bjm/elfeed-save-db-and-bury))
  :init
  (setq my/default-elfeed-search-filter "@1-month-ago +unread !sport ")
  (setq-default elfeed-search-filter my/default-elfeed-search-filter)
  (setq elfeed-db-direcory "~/scimax/user/elfeeddb")
  :config
  (elfeed-org)
  (elfeed-goodies/setup)
  (setq elfeed-use-curl t)

  ;;
  ;; linking and capturing
  ;;

  (defun elfeed-link-title (entry)
    "Copy the entry title and URL as org link to the clipboard."
    (interactive)
    (let* ((link (elfeed-entry-link entry))
           (title (elfeed-entry-title entry))
           (titlelink (concat "[[" link "][" title "]]")))
      (when titlelink
        (kill-new titlelink)
        (x-set-selection 'PRIMARY titlelink)
        (message "Yanked: %s" titlelink))))

  ;; show mode

  (defun elfeed-show-link-title ()
    "Copy the current entry title and URL as org link to the clipboard."
    (interactive)
    (elfeed-link-title elfeed-show-entry))

  (defun elfeed-show-quick-url-note ()
    "Fastest way to capture entry link to org agenda from elfeed show mode"
    (interactive)
    (elfeed-link-title elfeed-show-entry)
    (org-capture nil "n")
    (yank)
    (org-capture-finalize))

  (bind-keys :map elfeed-show-mode-map
             ("l" . elfeed-show-link-title)
             ("v" . elfeed-show-quick-url-note))

  ;; search mode

  (defun elfeed-search-link-title ()
    "Copy the current entry title and URL as org link to the clipboard."
    (interactive)
    (let ((entries (elfeed-search-selected)))
      (cl-loop for entry in entries
               when (elfeed-entry-link entry)
               do (elfeed-link-title entry))))

  (defun elfeed-search-quick-url-note ()
    "In search mode, capture the title and link for the selected
     entry or entries in org aganda."
    (interactive)
    (let ((entries (elfeed-search-selected)))
      (cl-loop for entry in entries
               do (elfeed-untag entry 'unread)
               when (elfeed-entry-link entry)
               do (elfeed-link-title entry)
               do (org-capture nil "n")
               do (yank)
               do (org-capture-finalize)
               (mapc #'elfeed-search-update-entry entries))
      (unless (use-region-p) (forward-line))))

  (bind-keys :map elfeed-search-mode-map
             ("l" . elfeed-search-link-title)
             ("v" . elfeed-search-quick-url-note))

   ;;functions to support syncing .elfeed between machines
  ;;makes sure elfeed reads index from disk before launching
  (defun bjm/elfeed-load-db-and-open ()
    "Wrapper to load the elfeed db from disk before opening"
    (interactive)
    (elfeed-db-load)
    (elfeed)
    (elfeed-search-update--force))

  ;;write to disk when quiting
  (defun bjm/elfeed-save-db-and-bury ()
    "Wrapper to save the elfeed db to disk before burying buffer"
    (interactive)
    (elfeed-db-save)
    (quit-window))
  )
#+END_SRC

#+RESULTS:
: bjm/elfeed-save-db-and-bury

** COMMENT TEST Removing Scimax's default colors

#+BEGIN_SRC emacs-lisp :tangle no
(set-face-attribute 'python-elfeed-entry nil :background nil :weight 'normal)
(set-face-attribute 'emacs-elfeed-entry nil :background nil :weight 'normal)
(set-face-attribute 'elfeed-search-unread-title-face nil  :weight 'normal)
(set-face-attribute 'elfeed-search-feed-face nil :height '0.8)
#+END_SRC

* eww
*** Default browser to be eww and basic settings
:PROPERTIES:
:ID:       97B74055-86BA-4471-853C-96BD35055AF5
:END:

#+BEGIN_SRC emacs-lisp
(setq browse-url-browser-function 'eww-browse-url)
#+END_SRC

#+RESULTS:
: eww-browse-url

*** Keyboard map for default external browser
:PROPERTIES:
:ID:       5E6E35E7-08EF-47F1-AFC0-ADE231C4BD38
:END:

#+BEGIN_SRC emacs-lisp
;; Open the current URL in the default external browser
(eval-after-load 'eww
  '(progn
     (define-key eww-mode-map "o" 'eww-browse-with-external-browser)
     ))
#+END_SRC

#+RESULTS:
: eww-browse-with-external-browser

*** Wikipedia search
:PROPERTIES:
:ID:       1E0D1DBF-8D54-472D-8B32-E1E371586389
:END:

#+BEGIN_SRC emacs-lisp
(defun wikipedia-search (search-term)
  "Search for SEARCH-TERM on wikipedia"
  (interactive
   (let ((term (if mark-active
                   (buffer-substring (region-beginning) (region-end))
                 (word-at-point))))
     (list
      (read-string
       (format "Wikipedia (%s):" term) nil nil term)))
   )
  (browse-url
   (concat
    "http://en.m.wikipedia.org/w/index.php?search="
    search-term
    ))
  )
#+end_src

#+RESULTS:
: wikipedia-search

*** Access Hacker News
:PROPERTIES:
:ID:       076038EA-5427-4C17-9530-7298911256F7
:END:

#+BEGIN_SRC emacs-lisp
(defun hn ()
  (interactive)
  (browse-url "http://news.ycombinator.com"))
#+end_src

#+RESULTS:
: hn

*** Youtube music playlist

#+BEGIN_SRC emacs-lisp
(defun yt ()
  (interactive)
  (browse-url "https://www.youtube.com/playlist?list=PLzDQK0UVrg2TiemiFoRmrwq-YbQ-Zn1AN"))
#+END_SRC

*** TODO Open specific browser depending on the URL

- Note taken on [2020-04-26 Sun 06:46] \\
  The idea here is to gather the websites and links which work fine on eww
  and have the remaining links open directly on the default web browser.
- Note taken on [2019-03-07 Thu 11:59] \\
  This is worth setting up. It would be convenient for frequently visited websites like reddit and others, to open in the external browser, especially as they do not render well within w3m.

Source : http://ergoemacs.org/emacs/emacs_set_default_browser.Html

#+BEGIN_SRC emacs-lisp 
;; use browser depending on url
(setq
 browse-url-browser-function
 '(
  ("wikipedia\\.org" . eww-browse-url)
  ("wiktionary\\.org" . eww-browse-url)
  ("github" . eww-browse-url)
  ("thefreedictionary\\.com" . eww-browse-url)
  ("link\\.wired\\.com" . eww-browse-url)
  ("links\\.gatesnotes\\.com" . eww-browse-url)
  ("." . browse-url-default-browser)
  ("youtube" . browse-url-default-macosx-browser)))
#+END_SRC

#+RESULTS:
: ((wikipedia\.org . eww-browse-url) (github . eww-browse-url) (thefreedictionary\.com . eww-browse-url) (. . browse-url-default-browser))

* New Scimax port
** COMMENT Adding scimax folder to load path
:PROPERTIES:
:ID:       07625F90-FBFE-46A1-8FDE-2E4D0B664B9D
:END:

#+BEGIN_SRC emacs-lisp :results silent
;; (add-to-list 'load-path (sr/fun/scimax-ref-dir "scimax-stuff"))
;; (defvar scimax-dir (sr/fun/scimax-ref-dir "scimax-stuff"))
#+END_SRC

** org-ref
:PROPERTIES:
:ID:       D74176E1-6899-442A-9C7A-B2193C7ADCF7
:END:
- Note taken on [2020-03-11 Wed 23:18] \\
  Apparently, the scimax org-ref module required the gitter package. This is strange because it is pulled in as a git submodule. However, the issue was resolved  when org-ref was pulled in from it's own repo.

#+BEGIN_SRC emacs-lisp
  (use-package org-ref
    :straight (org-ref :host github :repo "jkitchin/org-ref")
:config
(require 'doi-utils)
(require 'org-ref-wos)
(require 'org-ref-pubmed)
(require 'org-ref-arxiv)
(require 'org-ref-bibtex)
(require 'org-ref-pdf)
(require 'org-ref-url-utils)
(require 'org-ref-helm)
(require 'org-ref-isbn)

(setq org-ref-completion-library 'org-ref-ivy-cite)
;; note and bib location

(setq org-ref-bibliography-notes "~/my_org/references/references.org"
      org-ref-bibliography-notes "~/my_org/references/research_notes.org"
      org-ref-default-bibliography '("~/my_org/references/references.bib")
      org-ref-pdf-directory "~/my_org/references/pdfs/")

;; setting up helm-bibtex
(setq helm-bibtex-bibliography "~/my_org/references/references.bib"
      helm-bibtex-library-path "~/my_org/org/references/pdfs"
      helm-bibtex-notes-path "~/my_org/references/research_notes.org")

(setq bibtex-autokey-year-length 4
	bibtex-autokey-name-year-separator "-"
	bibtex-autokey-year-title-separator "-"
	bibtex-autokey-titleword-separator "-"
	bibtex-autokey-titlewords 2
	bibtex-autokey-titlewords-stretch 1
	bibtex-autokey-titleword-length 5
	org-ref-bibtex-hydra-key-binding (kbd "H-b")))
#+END_SRC

#+RESULTS:
: t
** scimax-org port
*** General Org mode related
:PROPERTIES:
:ID:       064C080D-4C7E-4EA5-A173-2EA058A7B19A
:END:

#+BEGIN_SRC emacs-lisp
(require 'org-inlinetask)
(require 'org-mouse)

;; Make editing invisible regions smart
(setq org-catch-invisible-edits 'smart)

;; allow lists with letters in them.
(setq org-list-allow-alphabetical t)

(setq org-src-tab-acts-natively t)

(setq org-use-speed-commands t)

(add-to-list 'org-speed-commands-user (cons "P" 'org-set-property))
(add-to-list 'org-speed-commands-user (cons "d" 'org-deadline))

;; Mark a subtree
(add-to-list 'org-speed-commands-user (cons "m" 'org-mark-subtree))

;; Widen
(add-to-list 'org-speed-commands-user (cons "S" 'widen))

;; kill a subtree
(add-to-list 'org-speed-commands-user (cons "k" (lambda ()
						  (org-mark-subtree)
						  (kill-region
						   (region-beginning)
						   (region-end)))))

;; Jump to headline
(add-to-list 'org-speed-commands-user
	     (cons "q" (lambda ()
			 (avy-with avy-goto-line
			   (avy--generic-jump "^\\*+" nil avy-style)))))

#+END_SRC

#+RESULTS:
: ((q lambda nil (avy-with avy-goto-line (avy--generic-jump ^\*+ nil avy-style))) (q lambda nil (let ((avy-keys (or (cdr (assq (quote avy-goto-line) avy-keys-alist)) avy-keys)) (avy-style (or (cdr (assq (quote avy-goto-line) avy-styles-alist)) avy-style)) (avy-command (quote avy-goto-line))) (setq avy-action nil) (fset (quote avy-resume) (function (lambda nil (interactive) (avy--generic-jump ^\*+ nil avy-style)))) (avy--generic-jump ^\*+ nil avy-style))) (k lambda nil (org-mark-subtree) (kill-region (region-beginning) (region-end))) (S . widen) (m . org-mark-subtree) (d . org-deadline) (P . org-set-property))

