emacs-config.org
*** Better return
:PROPERTIES:
:ID:       A4E26EAE-9189-4000-807B-B2BF2778A3F8
:END:

#+BEGIN_SRC emacs-lisp
;; * A better return

(defun scimax/org-return (&optional ignore)
  "Add new list item, heading or table row with RET.
A double return on an empty element deletes it.
Use a prefix arg to get regular RET. "
  (interactive "P")
  (if ignore
      (org-return)
    (cond

     ((eq 'line-break (car (org-element-context)))
      (org-return-indent))

     ;; Open links like usual, unless point is at the end of a line.
     ;; and if at beginning of line, just press enter.
     ((or (and (eq 'link (car (org-element-context))) (not (eolp)))
	  (bolp))
      (org-return))

     ;; It doesn't make sense to add headings in inline tasks. Thanks Anders
     ;; Johansson!
     ((org-inlinetask-in-task-p)
      (org-return))

     ;; checkboxes - add new or delete empty
     ((org-at-item-checkbox-p)
      (cond
       ;; at the end of a line.
       ((and (eolp)
	     (not (eq 'item (car (org-element-context)))))
	(org-insert-todo-heading nil))
       ;; no content, delete
       ((and (eolp) (eq 'item (car (org-element-context))))
	(setf (buffer-substring (line-beginning-position) (point)) ""))
       ((eq 'paragraph (car (org-element-context)))
	(goto-char (org-element-property :end (org-element-context)))
	(org-insert-todo-heading nil))
       (t
	(org-return))))

     ;; lists end with two blank lines, so we need to make sure we are also not
     ;; at the beginning of a line to avoid a loop where a new entry gets
     ;; created with only one blank line.
     ((org-in-item-p)
      (cond
       ;; empty definition list
       ((and (looking-at " ::")
	     (looking-back "- " 3))
	(beginning-of-line)
	(delete-region (line-beginning-position) (line-end-position)))
       ;; empty item
       ((and (looking-at "$")
	     (looking-back "- " 3))
	(beginning-of-line)
	(delete-region (line-beginning-position) (line-end-position)))
       ;; numbered list
       ((and (looking-at "$")
	     (looking-back "[0-9]+. " (line-beginning-position)))
	(beginning-of-line)
	(delete-region (line-beginning-position) (line-end-position)))
       ;; insert new item
       (t
	(end-of-line)
	(org-insert-item))))

     ;; org-heading
     ((org-at-heading-p)
      (if (not (string= "" (org-element-property :title (org-element-context))))
	  (progn
	    ;; Go to end of subtree suggested by Pablo GG on Disqus post.
	    (org-end-of-subtree)
	    (org-insert-heading-respect-content)
	    (outline-show-entry))
	;; The heading was empty, so we delete it
	(beginning-of-line)
	(setf (buffer-substring
	       (line-beginning-position) (line-end-position)) "")))

     ;; tables
     ((org-at-table-p)
      (if (-any?
	   (lambda (x) (not (string= "" x)))
	   (nth
	    (- (org-table-current-dline) 1)
	    (remove 'hline (org-table-to-lisp))))
	  (org-return)
	;; empty row
	(beginning-of-line)
	(setf (buffer-substring
	       (line-beginning-position) (line-end-position)) "")
	(org-return)))

     ;; fall-through case
     (t
      (org-return)))))


(defcustom scimax-return-dwim t
  "When t redefine the Ret behavior to add items, headings and table rows."
  :group 'scimax)


(when scimax-return-dwim
  (define-key org-mode-map (kbd "RET")
    'scimax/org-return))

#+END_SRC

#+RESULTS:
: scimax/org-return

*** TODO Numbered headings and overlays
*** TODO PDF and EPS images in org mode
** COMMENT scimax-yas
:PROPERTIES:
:ID:       259205AA-4D49-4917-B79D-0A785822C33F
:END:

#+BEGIN_SRC emacs-lisp
  (use-package scimax-yas
    :init (setq scimax-snippet-dir (sr/fun/emacs-dir "snippets"))
    :straight (scimax-yas :local-repo "scimax-subset" :files ("scimax-yas.el")))
(require 'scimax-yas)
#+END_SRC

#+RESULTS:
: scimax-yas

** scimax-ivy
:PROPERTIES:
:ID:       5883CE00-AEAE-46E3-8C47-B74554B7F0CD
:END:
#+BEGIN_SRC emacs-lisp
  (use-package scimax-ivy
    :straight (scimax-ivy :local-repo "scimax-subset" :files ("scimax-ivy.el")))
(require 'scimax-ivy)
#+END_SRC

#+RESULTS:
: scimax-ivy
** scimax-apps
:PROPERTIES:
:ID:       217D4F99-21D9-4FEE-8ACC-24113C70A750
:END:

#+BEGIN_SRC emacs-lisp
  (use-package scimax-apps
    :after scimax-org
    :straight (scimax-apps :local-repo "scimax-subset" :files ("scimax-apps.el")))
(require 'scimax-apps)
#+END_SRC

#+RESULTS:
: scimax-apps

** TODO scimax-hydra
:PROPERTIES:
:ID:       D3004CAB-BFAF-48B8-8FBA-7CB75FC33007
:END:
- Note taken on [2020-03-24 Tue 10:38] \\
  For some reason, the scimax-hydra package will not byte compile.

#+BEGIN_SRC emacs-lisp
(load-file (concat (sr/fun/emacs-dir "straight/repos/scimax-subset/scimax-hydras.el")))

;; (use-package scimax-hydra
;;   :straight (scimax-hydra :local-repo "scimax-subset" :files ("scimax-hydras.el"))
;;   :bind ("<f12>" . scimax/body))
;; (require 'scimax-hydras)
#+END_SRC

#+RESULTS:
: scimax/body
** scimax-notebook
:PROPERTIES:
:ID:       D6B5E656-0A40-4B50-A37C-889FE990C063
:END:

#+BEGIN_SRC emacs-lisp

(use-package scimax-notebook
  :straight (scimax-notebook :local-repo "scimax-subset" :files ("scimax-notebook.el"))
  :bind ("M-s n" . 'nb-hydra/body)
  :config 
(setq nb-notebook-directory "~/my_projects/"))
;; (global-set-key (kbd "M-s n") 'nb-hydra/body))
(require 'scimax-notebook)
#+END_SRC

#+RESULTS:
: scimax-notebook

** COMMENT scimax-journal
:PROPERTIES:
:ID:       61A12586-DAA7-4601-92F3-DD688B9725D5
:END:
- Note taken on [2020-04-10 Fri 18:37] \\
  Switching back to org-journal

#+BEGIN_SRC emacs-lisp
(use-package scimax-journal
  :init (setq scimax-journal-root-dir "~/my_org/journal/")
  :bind ("H-j" . scimax-journal/body)
  :straight (scimax-journal :local-repo "scimax-subset" :files ("scimax-journal.el")))
(require 'scimax-journal)
#+END_SRC

#+RESULTS:
: scimax-journal
** COMMENT scimax utils

#+BEGIN_SRC emacs-lisp
  (use-package scimax-utils
    :straight (scimax-utils :local-repo "scimax-subset" :files ("scimax-utils.el")))
(require 'scimax-utils)
#+END_SRC

#+RESULTS:
: scimax-utils
** scimax-ipython
:PROPERTIES:
:ID:       06455092-7B57-4E40-A474-6252B67B4D1B
:END:

- [X] use the file keyword to add the client.py file as a symlink. Note here that the entire list of files have to be provided.

#+BEGIN_SRC emacs-lisp
    (use-package ob-ipython
      :straight (ob-ipython :host github :repo "gregsexton/ob-ipython" :files ("client.py" "ob-ipython.el"))
      :config
      (require 'ob-ipython))

  ;;; * Applying John's customisations and monkeypatches 
  ;;; These are related to ipython kernel management
  ;;; * These  are related mostly to org-babel customisations
    (use-package scimax-ob
      :straight (scimax-ob :local-repo "scimax-subset" :files ("scimax-ob.el")))

    (use-package scimax-org-babel-ipython-upstream
          :straight (scimax-org-babel-ipython-upstream  :local-repo "scimax-subset" :files ("scimax-org-babel-ipython-upstream.el")))


#+END_SRC

#+RESULTS:

scimax-ipython upstream

#+BEGIN_SRC emacs-lisp :tangle no
(require 'scimax-org-babel-ipython-upstream)
(require 'scimax-ob)
#+END_SRC

#+RESULTS:
: scimax-ob
** COMMENT scimax-elfeed 

#+BEGIN_SRC emacs-lisp
(use-package scimax-elfeed
  :straight (scimax-elfeed :local-repo "scimax-subset" :files ("scimax-elfeed.el")))
#+END_SRC

#+RESULTS:
* Aesthetics
- Note taken on [2020-04-24 Fri 20:06] \\
  I've tried quite a few themes over the years, and have even had phases
  where I was constantly changing themes. One caveat I've noticed is that
  not all themes are designed to work well with the terminal as
  well. After yet another quick foray into the Doom themes today - I will
  settle down on the following themes to be the best for me (note that
  relatively minor customisations like the font, proportional headings and
  so on are made to all)
  
  1. Modus operandi: well designed light theme that does not hurt my eyes
     and offers a good basic configuration. This theme appears to work
     well with terminal emacs as well.
  2. Zenburn : As many say, this theme is definitely the easiest on my
     eyes and will be a preferred dark theme. There are a tonne of
     configuration options out of the box.
  3. Modus vivendi: This is a good dark theme that I prefer since it is
     based on similar design principles as the modus operandi. However,
     the contrast is jarring as compared to the mute nature of the Zenburn
     theme. I would not want to use the Modus vivendi theme for long
     durations in low light.
  4. Leuven: I used this theme for a long time when I was on
     Scimax. Undoubtedly this light theme has its advantages, however, it
     seems a little too opinionated on a lot of things, and I would prefer
     a lighter theme that also plays well on terminals.
  5. Doom's solarized dark theme: this is an honorable mention. As a dark theme
     that does not hurt the themes - this is similar to zenburn, but not
     as good looking.
** Setting custom themes to be safe
:PROPERTIES:
:ID:       E7FEA82C-0CCD-40D2-842A-E6797A9BB3BF
:END:

#+BEGIN_SRC emacs-lisp
(setq custom-safe-themes t)
#+END_SRC

** Theme : modus
:PROPERTIES:
:ID:       1F5F41EC-6BDA-46BC-B1E6-DED28B899196
:END:

*** modus operandi
#+BEGIN_SRC emacs-lisp
(straight-use-package 'modus-operandi-theme)

(use-package modus-operandi-theme
:straight t
:config
(setq modus-operandi-theme-scale-headings t)
(setq modus-operandi-theme-proportional-fonts t)
(setq modus-operandi-theme-slanted-constructs t)
(setq modus-operandi-theme-visible-fringes t)
(setq modus-operandi-theme-distinct-org-blocks t)
(load-theme 'modus-operandi t))

;; These are placed here for ready reference
;; (setq modus-operandi-theme-scale-1 1.05)
;; (setq modus-operandi-theme-scale-2 1.1)
;; (setq modus-operandi-theme-scale-3 1.15)
;; (setq modus-operandi-theme-scale-4 1.2)

#+END_SRC

#+RESULTS:
: t

*** COMMENT modus vivendi

#+BEGIN_SRC emacs-lisp  
(straight-use-package 'modus-vivendi-theme)

(use-package modus-vivendi-theme
:straight t
:config
(setq modus-vivendi-theme-scale-headings t)
(setq modus-vivendi-theme-proportional-fonts t)
(setq modus-vivendi-theme-slanted-constructs t)
(setq modus-vivendi-theme-visible-fringes t)
(setq modus-vivendi-theme-distinct-org-blocks t)
(load-theme 'modus-vivendi t))

;; These are placed here for ready reference
;; (setq modus-vivendi-theme-scale-1 1.05)
;; (setq modus-vivendi-theme-scale-2 1.1)
;; (setq modus-vivendi-theme-scale-3 1.15)
;; (setq modus-vivendi-theme-scale-4 1.2)

#+END_SRC

** Font and other aesthetics
*** COMMENT Old config
#+BEGIN_SRC emacs-lisp
;; My customisations
(set-face-attribute 'default nil :family "iA Writer Mono V" :height 130)
;; (set-face-attribute 'default nil :family "Iosevka term" :height 130)
(set-face-attribute 'fixed-pitch nil :family "Iosevka term")
(set-face-attribute 'variable-pitch nil :family "iA Writer Mono V")
#+END_SRC

#+RESULTS:

*** Fixed pitch and variable pitch fonts
:PROPERTIES:
:ID:       7257A394-D3EE-4918-9939-1BA885C1A51E
:END:

#+BEGIN_SRC emacs-lisp
(custom-theme-set-faces
 'user
 '(variable-pitch ((t (:family "iA Writer Mono V"))))
 '(fixed-pitch ((t ( :family "Iosevka term" 
			     :slant normal 
			     :weight normal 
			     :height 1.1
			     :width normal)))))

;; Setting the default general font 
(set-face-attribute 'default nil 
		    :family "iA Writer Mono V" 
		    :height 130
		    )

#+END_SRC

#+RESULTS:

*** Faces for specific org elements
:PROPERTIES:
:ID:       3C14EDA6-1BA3-4FE0-ADA5-FF6D7424B38D
:END:

#+BEGIN_SRC emacs-lisp
(custom-theme-set-faces
 'user
 '(org-block ((t (:inherit fixed-pitch))))
 '(org-code ((t (:inherit (shadow variable-pitch)))))
 '(org-document-info ((t (:foreground "dark orange"))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 '(org-indent ((t (:inherit (org-hide variable-pitch)))))
 '(org-link ((t (:foreground "royal blue" :underline t))))
 '(org-meta-line ((t (:inherit (font-lock-comment-face -pitch)))))
 '(org-property-value ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
 '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
 '(org-verbatim ((t (:inherit (shadow variable-pitch))))))

#+END_SRC

#+RESULTS:

** Fill column and auto fill

#+BEGIN_SRC emacs-lisp
(setq-default fill-column 72)
(global-visual-line-mode 1)
(add-hook 'text-mode-hook 'auto-fill-mode)
#+END_SRC

** COMMENT Visual Fill Column and global visual line   
:PROPERTIES:
:ID:       5113A22F-D29A-4AAD-A1CE-937983FCF06C
:END:
- Note taken on [2020-04-01 Wed 08:43] \\
  I have had trouble in using the visual fill column mode. Overall it
  does what I want it to do, however, some modes simply do not lend
  themselves very well to the visual fill column mode. Git gutter
  vanishes for example. Split buffers have a different behaviour from
  the usual. In general, it seems most people set a default fill column,
  and a hook for the automatic fill mode and then the global visual line
  mode.

I think it makes sense to have the global visual fill column mode active
and then have the visual line mode to

#+BEGIN_SRC emacs-lisp
;; (straight-use-package 'visual-fill-column)

;; Putting this into a function because I want these settings called
;; again when a frame is created.
(defun sr/fun/visual-fill-line()
(interactive)
(setq-default fill-column 72)
(global-visual-line-mode 1)
;; (visual-fill-column-mode)
;; (add-hook 'visual-line-mode-hook #'visual-fill-column-mode))
;; (add-hook 'visual-fill-column-mode-hook #'visual-line-mode))

;; Placing this function here so that if emacs is run as an bapp - the
;; settings will still be in effect.
(sr/fun/visual-fill-line)

;; ;; No visual fill column for the agenda (remove-hook 'org-agenda-mode
;; '(lambda () (setq visual-fill-column-mode nil)))
#+END_SRC

#+RESULTS:
| visual-fill-column-mode | visual-line-mode-set-explicitly |

** Doom modeline
- Note taken on [2020-04-24 Fri 20:16] \\
  The doom modeline possibly adds some extra seconds to the load
  time. This has to be investigated. However, the aesthetics would seem to
  make it well worth it.

- [[https://ladicle.com/post/config/#doom-dracula-theme-modeline][Ladicle's Emacs Configuration]]

#+BEGIN_SRC emacs-lisp
(use-package doom-modeline
  :straight t
  :custom
  (doom-modeline-buffer-file-name-style 'truncate-with-project)
  (doom-modeline-icon t)
  (doom-modeline-major-mode-icon nil)
  (doom-modeline-minor-modes nil)
  (doom-modeline-lsp t)
  (doom-modeline-mu4e t)
  (doom-modeline-env-version t)
  :hook
  (after-init . doom-modeline-mode)
  :config
  (line-number-mode 0)
  (column-number-mode 0)
  (doom-modeline-def-modeline 'main
    '(bar window-number matches buffer-info remote-host buffer-position selection-info)
    '(misc-info persp-name lsp github debug minor-modes input-method major-mode process vcs checker)))

#+END_SRC

** COMMENT Org Aesthetics Headline scales
- Note taken on [2020-03-28 Sat 19:56] \\
  These are not required for the modus theme, as inbuilt options exist upto level 4.

#+BEGIN_SRC emacs-lisp  

(custom-set-faces
 '(org-level-1 ((t (:inherit outline-1 :height 1.5 :weight bold))))
 '(org-level-2 ((t (:inherit outline-2 :height 1.3 :weight bold))))
 '(org-level-3 ((t (:inherit outline-3 :height 1.2 :weight bold))))
 '(org-level-4 ((t (:inherit outline-4 :height 1.1 :weight bold))))
 '(org-level-5 ((t (:inherit outline-5 :height 1.0 :weight bold)))))
#+END_SRC

#+RESULTS:

** COMMENT Olivetti mode
- Note taken on [2020-03-28 Sat 20:04] \\
  The problem with this mode is that it seems to activate and deactivate constantly, especially when the buffer is saved. However it is certainly very useful with wide screens in general.

This package is useful in centering the text in a buffer, and is particularly helpful with wide screens.

#+BEGIN_SRC emacs-lisp
(use-package olivetti
:config
(olivetti-mode 1))

#+END_SRC
