emacs-config.org
** COMMENT Spaceline : modeline configuration
   :PROPERTIES:
   :ID:       1505e226-1321-4f3c-89e9-9dc8a5c91bd0
   :END:
- [X] [[http://pragmaticemacs.com/emacs/get-that-spacemacs-look-without-spacemacs/][Get that spacemacs look without spacemacs | Pragmatic Emacs]] - this provides a bare bones setup
- [ ] [[http://amitp.blogspot.com/2017/01/emacs-spaceline-mode-line.html][Amit's Thoughts: Emacs spaceline mode line]] : This is an excellent guide covering a lot of possibilities to customise so many aspects of the modeline and make it look great.
- [ ] It seems that spaceline adds a few extra seconds to the init time. I wonder if there are lighter packages that achieve the same effect.

#+BEGIN_SRC emacs-lisp
(use-package spaceline
  :straight t
  :init
  (setq powerline-default-separator 'arrow-fade)
  :config
  (disable-theme 'smart-mode-line-light)
  (require 'spaceline-config)
  (spaceline-spacemacs-theme)
  (spaceline-toggle-buffer-position-off)
  (spaceline-toggle-hud-off)
  (setq spaceline-python-pyvenv-on 1)
  (spaceline-toggle-minor-modes-off))
  #+END_SRC

#+RESULTS:
: t

** Striking out Done headlines
:PROPERTIES:
:ID:       3263d812-c3f5-4947-b2de-c75c537d19df
:END:

source: Sacha Chua

#+begin_src emacs-lisp
(setq org-fontify-done-headline t)
(custom-set-faces
 '(org-done ((t (:foreground "DarkGreen"
			     :weight normal
			     :strike-through t))))
 '(org-headline-done
   ((((class color) (min-colors 16) (background dark))
     (:foreground "LightSalmon" :strike-through t)))))
#+end_src

#+RESULTS:

** keywords as boxes with inverted colors
:PROPERTIES:
:ID:       62dcdc53-ee2f-4db2-afda-6b68a05cbeda
:END:

Source : SO [[https://stackoverflow.com/questions/12707492/add-custom-markers-to-emacs-org-mode][link]] ,

#+BEGIN_SRC emacs-lisp
(set-face-attribute 'org-todo nil
                    :box '(:line-width 2
                           :color "black"
                           :style released-button)
                    :inverse-video t
                    )
(set-face-attribute 'org-done nil
                    :box '(:line-width 2
                           :color "black"
                           :style released-button)
                    :inverse-video t
                    )
(set-face-attribute 'org-priority nil
                    :inherit font-lock-keyword-face
                    :inverse-video t
                    :box '(:line-width 2
                           :color "black"
                           :style released-button)
                    )
#+END_SRC

#+RESULTS:

** Remove the bars and startup messages
:PROPERTIES:
:ID:       38F9FE46-13E7-4281-8DC0-7C9F9AAB673C
:END:

#+BEGIN_SRC emacs-lisp
;; Removing all the bars 
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

;; No start up message and nothing to pollute the scratch buffer
(setq inhibit-startup-message t initial-scratch-message nil)
#+END_SRC
* Hugo
** ox-hugo setup

#+BEGIN_SRC emacs-lisp
(use-package ox-hugo
  :ensure t
  :after ox
  :custom
  (org-hugo--tag-processing-fn-replace-with-hyphens-maybe t)
(require 'ox-hugo)
  )
#+END_SRC

#+RESULTS:
** TODO Auto-generate some properties 

The earlier procedure by choice was to use the org-id to name
posts. This ensured that the post URL's would remain unique and
indifferent to a title. However, this does not make for a human-friendly
url to quickly distinguish which post is being referred to. Even so, I
would like to generate some properties and attributes based on the
heading, tags and so on. 

* Loading secret config
:PROPERTIES:
:ID:       F71603D8-BA36-4055-9417-FFED3ABF9E4B
:END:

#+BEGIN_SRC emacs-lisp
;; Loading secret config containing personal information
(org-babel-load-file (sr/fun/emacs-dir "sr-secrets.org.gpg"))
#+END_SRC

#+RESULTS:
: Loaded /Users/shrysr/.emacs.d/sr-secrets.org.el

* COMMENT Testing Area
:PROPERTIES:
:END:

This section will be the place where all new packages and their settings make an entrance. In short the test will be that they are not activated by default and if I seek out the package, that would mean I find it useful to include in my main configuration.

** Enhanced python config
*** TODO COMMENT Adapted python config
Source [[https://github.com/PythonNut/quark-emacs/blob/dev/modules/config-python.el][quark-emacs/config-python.el at dev 路 PythonNut/quark-emacs 路 GitHub]]

This is a nice and detailed configuration for python that is worth
studying. I will be adapting this to my purposes. 

**** Find local virtualenv
- Note taken on [2020-04-05 Sun 15:16] \\
  THe savehist package needs to be installed to use this
  configuration. I have taken a minimal bunch of settings. This appears
  to be setup to work with finding the local executable for poetry or
  pipenv. Apparently the savehist package will replace the minibuffer
  and so this is not a snippet that can be loaded at anytime, i.e it
  needs to be loaded at Emacs init.

#+BEGIN_SRC emacs-lisp
(use-package savehist
  :straight t
  :init
  (autoload 'savehist-minibuffer-hook "savehist")
  (autoload 'savehist-autosave "savehist")
  (autoload 'savehist-uninstall "savehist"))

(defun my/python-find-virtualenv (&optional dir)  
  "Find a virtualenv corresponding to the current buffer.  
   Return either a string or nil."  
  (message "Searching for Python virtual environment at %s" default-directory)  
  (let* ((default-directory (or dir default-directory))  
	 (path  
	  (cl-block nil  
	    (when (and (my/local-executable-find "poetry")  
		       (locate-dominating-file default-directory  
					       "pyproject.toml"))  
	      ;; First, we try poetry env, which is safe and a bit  
	      ;; faster, but only works in poetry versions 1.0 and up  
	      (cl-destructuring-bind (return-code . output)  
		  (my/process-file-to-string "poetry" nil '(t nil) nil  
					     "env"  
					     "info"  
					     "-p")  
		(when (= 0 return-code)  
		  (cl-return output)))  
	      ;; Fall back to poetry <1.0 check TODO: This code  
	      ;; will become stale over time, so get rid of it  
	      ;; after a while.  
	      ;; Radon: May create virtualenv, but whatever.  
	      (cl-destructuring-bind (return-code . output)  
		  (my/process-file-to-string "poetry" nil '(t nil) nil  
					     "run"  
					     "which"  
					     "python")  
		(when (and (= 0 return-code)  
			   (string-match (rx bol  
					     (group (1+ any))  
					     "/bin/python\n")  
					 output))  
		  (cl-return (match-string 1 output)))))  
	    (when (and (my/local-executable-find "pipenv")  
		       (locate-dominating-file default-directory  
					       "Pipfile"))  
	      (cl-destructuring-bind (return-code . output)  
		  (my/process-file-to-string "pipenv" nil '(t nil) nil  
					     "--venv")  
		(when (= 0 return-code)  
		  (cl-return (string-trim output)))))))  
	 (universal-path (if (tramp-tramp-file-p default-directory)  
			     (my/tramp-build-name-from-localname path)  
			   path)))  
    (when (file-directory-p universal-path)  
      (substring-no-properties universal-path))))  

(defvar my/python-virtualenv-cache nil)  
(add-to-list 'savehist-additional-variables 'my/python-virtualenv-cache)  

(defun my/python-find-virtualenv-cached (&optional dir)  
  (let* ((dir (or dir default-directory))  
	 (pyproject (locate-dominating-file dir "pyproject.toml")))  
    (unless my/python-virtualenv-cache  
      (setq my/python-virtualenv-cache (make-hash-table :test #'equal)))  
    (if (and (my/local-executable-find "poetry")  
	     dir  
	     (not (file-exists-p (expand-file-name ".venv" dir))))  
	(let ((cached (or (gethash dir my/python-virtualenv-cache)  
			  (puthash dir  
				   (my/python-find-virtualenv dir)  
				   my/python-virtualenv-cache))))  
	  (if (file-exists-p cached)  
	      cached  
	    (my/python-find-virtualenv dir)))  
      (my/python-find-virtualenv dir))))  
#+END_SRC

**** Remote python

#+BEGIN_SRC emacs-lisp
   (with-eval-after-load 'pythonic  
   (eval-when-compile  
   (with-demoted-errors "Load error: %s"  
   (require 'tramp)))  
     
   (defvar my/pythonic-remote-host-cache nil)  
   (defun nadvice/pythonic-remote-host ()  
   "Get host of the connection to the remote python interpreter."  
   (unless my/pythonic-remote-host-cache  
   (setq my/pythonic-remote-host-cache (make-hash-table :test #'equal)))  
     
   (with-parsed-tramp-file-name default-directory parsed  
   (let ((hostname (replace-regexp-in-string "#.*\\'" "" parsed-host)))  
   (if (member parsed-method '("ssh"  
   "scp"  
   "scpx"  
   "sshx"  
   "rsync"))  
   (or (gethash hostname my/pythonic-remote-host-cache)  
   (puthash hostname  
   (with-temp-buffer  
   (call-process "ssh" nil t nil "-G" hostname)  
   (goto-char (point-min))  
   (search-forward "\nhostname ")  
   (buffer-substring-no-properties (point) (line-end-position)))  
   my/pythonic-remote-host-cache))  
   hostname))))  
   (advice-add 'pythonic-remote-host :override #'nadvice/pythonic-remote-host))  
     
#+END_SRC

**** pyvenv

#+BEGIN_SRC emacs-lisp
(use-package pyvenv  
  :config  
  (defun nadvice/pyvenv-activate (&optional arg)  
    (interactive "P")  
    (let ((default-venv (my/python-find-virtualenv-cached)))  
      (if (or (not default-venv) (consp (car arg)))  
	  (list (read-directory-name "Activate venv: "))  
	(list default-venv))))  
  
  (advice-add 'pyvenv-activate :filter-args #'nadvice/pyvenv-activate))  
#+END_SRC

**** TODO ms-lsp detailed config
*** TODO COMMENT Standard set of requirements for pip installations
- Note taken on [2020-04-05 Sun 15:37] \\
  The goal is to create a standard set of installations for any
  virtualenvironment that is created. This basic set can be built further
  as required.

#+BEGIN_SRC sh :tangle no
pip install numpy pandas jupyter scikitlearn black 
#+END_SRC


** Org spacer

#+BEGIN_QUOTE
This simple package allows you to enforce the number of blanks lines after elements in an org-mode document.
#+END_QUOTE

Perhaps this package can extended as some tool belt of org utilities. Some ideas: 

1. [ ] Addressing duplicate org-id headlines
2. [ ] Clearing all the values of a specified property from an org file or perhaps multiple org files.
3. [ ] Finding how many org file link to the duplicate org id's
4. [ ] Tagging a whole bunch of org entries.
5. [ ] Spaces before and after source code blocks


#+BEGIN_SRC emacs-lisp
(use-package org-spacer
  :straight (org-spacer :type git :host github :repo "dustinlacewell/org-spacer.el"))
:config
;; ;; As a before save hook
;; (add-hook 'org-mode-hook
;;           (lambda () (add-hook 'before-save-hook
;;                           'org-spacer-enforce nil 'make-it-local)))
;; Blank spaces directly after headlines
(setq org-spacer-element-blanks
  '((0 headline)
    (1 paragraph src-block table property-drawer)))
#+END_SRC

#+RESULTS:
| 0 | headline  |           |       |                 |
| 1 | paragraph | src-block | table | property-drawer |

** STABLE Pinboard [1/2]
CLOSED: [2020-01-19 Sun 14:33]
:PROPERTIES:
:ID:       B1A6F6F9-0713-456A-826E-DCE6E83E2AFF
:END:

- Note taken on [2020-03-22 Sun 20:29] \\
  This will need digestion of the org secrets file.

To get started, visit your password settings page on Pinboard and get the API token that's displayed there.

Then edit ~/.authinfo and add a line like this:

#+BEGIN_SRC sh
machine api.pinboard.in password foo:8ar8a5w188l3
#+END_SRC


#+BEGIN_SRC emacs-lisp
(use-package pinboard
:ensure t
)
#+END_SRC

#+RESULTS:

- [X] Figure out the auth file settings from before
- [ ] Checkout the org mode snippet [[https://gist.github.com/khinsen/7ed357eed9b27f142e4fa6f5c4ad45dd][link]]
** Python source block tests
- Syntax highlighting is taking place
- 

#+BEGIN_SRC ipython
# THis is a comment 
import numpy as np
print(np.array([5,4]))
#+END_SRC

#+RESULTS:
:results:
# Out [1]: 
# output
[5 4]

:end:



#+BEGIN_SRC ipython
import numpy as np

import sys
print(sys.path)

#+END_SRC

#+RESULTS:
:results:
['/Users/shrysr/.emacs.d', '/Users/shrysr/.pyenv/versions/3.7.5/lib/python37.zip', '/Users/shrysr/.pyenv/versions/3.7.5/lib/python3.7', '/Users/shrysr/.pyenv/versions/3.7.5/lib/python3.7/lib-dynload', '', '/Users/shrysr/.virtualenvs/ds-base/lib/python3.7/site-packages', '/Users/shrysr/.virtualenvs/ds-base/lib/python3.7/site-packages/IPython/extensions', '/Users/shrysr/.ipython']
:end:



#+BEGIN_SRC python
import sys
print(sys.path)
#+END_SRC

#+RESULTS:
: ['', '/Users/shrysr/.pyenv/versions/3.7.5/lib/python37.zip', '/Users/shrysr/.pyenv/versions/3.7.5/lib/python3.7', '/Users/shrysr/.pyenv/versions/3.7.5/lib/python3.7/lib-dynload', '/Users/shrysr/.local/pipx/venvs/numpy/lib/python3.7/site-packages', '/Users/shrysr/.local/pipx/shared/lib/python3.7/site-packages']

#+BEGIN_SRC zsh :tangle no
pipx inject numpy jupyter
#+END_SRC

#+RESULTS:

** Modeline adjustments

 #+BEGIN_SRC emacs-lisp
 ;; (defun set-eyeliner-colors ()
 ;; (setq buffer-name-color "#ff0000")
 ;; (setq buffer-name-modified-color "#ff0000")
 ;; (setq eyeliner/warm-color (theme-color 'red))
 ;; (setq eyeliner/cool-color (theme-color 'cyan))
 ;; (setq eyeliner/plain-color (theme-color 'foreground))
 ;; (custom-set-faces
 ;; `(powerline-active0
 ;; ((t (:background ,(theme-color 'foreground)))))
 ;; `(powerline-inactive0
 ;; ((t (:background ,(theme-color 'foreground)))))
 ;; `(powerline-active1
 ;; ((t (:background ,(theme-color 'foreground)
 ;; :foreground ,(theme-color 'background)))))
 ;; `(powerline-inactive1
 ;; ((t (:background ,(theme-color 'foreground)
 ;; :foreground ,(theme-color 'background)))))
 ;; `(powerline-active2
 ;; ((t (:background ,(theme-color 'background)))))
 ;; `(powerline-inactive2
 ;; ((t (:background ,(theme-color 'background)))))))

 ;; (eval `(use-package eyeliner
 ;; ;; :straight (eyeliner :type git :host github :repo "dustinlacewell/eyeliner")
 ;; :demand t
 ;; :straight (eyeliner :local-repo ,(my/project-directory "eyeliner"))
 ;; :config
 ;; (spaceline-helm-mode 1)
 ;; (set-eyeliner-colors)
 ;; (eyeliner/install)))

 #+END_SRC

** helpful

#+BEGIN_SRC emacs-lisp
(use-package helpful :straight (helpful :type git :host github :repo "Wilfred/helpful"))

(use-package helpful
:straight (helpful :type git :host github :repo "Wilfred/helpful")
:bind (("C-h f" . #'helpful-callable)
("C-h v" . #'helpful-variable)
("C-h k" . #'helpful-key)))

#+END_SRC

#+RESULTS:
: helpful-key

** Linkmarks

#+BEGIN_SRC emacs-lisp
(use-package linkmarks
  :straight (linkmarks 
	     :type git 
	     :host github 
	     :repo "dustinlacewell/linkmarks")
  :config
(setq linkmarks-file "~/my_org/emacs_meta/bookmarks.org"))

 #+END_SRC

 #+RESULTS:
 : t
** outshine

#+BEGIN_SRC emacs-lisp
(use-package outshine
:init (defvar outline-minor-mode-prefix "\M-#")
:config (setq outshine-use-speed-commands t)
:hook ((emacs-lisp-mode . outshine-mode)
(nix-mode . outshine-mode)
(python-mode . outshine-mode)))

#+END_SRC

#+RESULTS:
| outshine-mode |
