emacs-config.org
** TODO Ensure one line space between org headlines

While this improves readability, the main reason is an odd color of the source blocks which bleeds into the headings. This snippet will ensure a single space between blocks which prevents the above.

- [ ] Add a new line after the last header as well.
- [ ] Check why the before save hook does not seem to work.

   #+BEGIN_SRC emacs-lisp
(with-eval-after-load 'org
(defun org-mode--ensure-one-blank-line ()
(save-excursion
(goto-char (point-min))
(while (re-search-forward "#\\+[a-z_]+\\s-\\*" nil t)
(replace-match "#+end_src

*")
(call-interactively 'org-previous-visible-heading)
(call-interactively 'org-cycle)
(call-interactively 'org-cycle))
(org-save-outline-visibility t
(org-mode))))

(add-hook
'org-mode-hook
(lambda () (add-hook
'before-save-hook
'org-mode--ensure-one-blank-line
nil 'make-it-local))))

   #+END_SRC

   #+RESULTS:
   | (lambda nil (add-hook (quote before-save-hook) (quote org-mode--ensure-one-blank-line) nil (quote make-it-local))) | org-bullets-mode | org-indent-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** TEST Perspective and persp-projectile
** Theme : org-beautify
:PROPERTIES:
:ID:       C93143D4-EEC8-4D14-A008-1E74BF447D63
:END:
- Note taken on [2020-03-22 Sun 08:59] \\
  The poet theme seems a better candidate for hacking, primarily from the point
  of view of a better base to begin from, and also that there are light and
  dark themes available out of the box. 

Found this theme thanks to Dustin. It feels therapeutic, though Leuven and Zenburn are great themes in their own right. Maybe I'll consider using zenburn as my dark theme and org-beautify as the light version. It may even be worth creating a darker version of teh org-beautify theme.

 #+BEGIN_SRC emacs-lisp :tangle no
 (use-package org-beautify-theme
 :after (org)
 :config
 (setq org-fontify-whole-heading-line t)
 (setq org-fontify-quote-and-verse-blocks t)
 (setq org-hide-emphasis-markers t))

 #+END_SRC

 #+RESULTS:
 : t
** TODO Theme : Zenburn
For a long period, I was using the zenburn theme and had started customising it for my needs. However, I think leuven with a greyish background is really quite suitable. Even so, it's nice to have a dark theme available when required. I'm keeping this around for tinkering down the line.

*** Disabling leuven and loading other theme
   :PROPERTIES:
   :ID:       ecce6509-d04c-4e2d-a6a6-c5cd63b1e2e7
   :END:

#+BEGIN_SRC emacs-lisp
(disable-theme 'leuven)
;;(load-theme 'spacemacs-dark t)
(load-theme 'zenburn t)
#+END_SRC

*** TEST Background color for org source Blocks
   :PROPERTIES:
   :ID:       5dfffd10-35b1-495f-8782-380f014b23ae
   :END:
This is necessary due to the customisation in scimax

#+BEGIN_SRC emacs-lisp
(set-face-background 'org-block-emacs-lisp "black")
(set-face-background 'org-block-python "black")
(set-face-background 'org-block-ipython "black")
(set-face-background 'org-block "black")
;; (set-face-background 'org-block-quote "black")
#+END_SRC

#+RESULTS:

*** TEST Initial setup of Zenburn
   :PROPERTIES:
   :ID:       06b3970f-94e2-4325-ae27-d63c1b3b796c
   :END:

#+BEGIN_SRC emacs-lisp
;; use variable-pitch fonts for some headings and titles
(setq zenburn-use-variable-pitch t)

;; scale headings in org-mode
(setq zenburn-scale-org-headlines t)

;; scale headings in outline-mode
(setq zenburn-scale-outline-headlines t)
#+END_SRC

*** TODO Use-package based template for customising zenburn

Source: https://github.com/m-parashar/emax64/issues/5

#+BEGIN_SRC emacs-lisp
(use-package zenburn-theme
  :demand t
  :config
  (load-theme 'zenburn t)
  (set-face-attribute 'font-lock-comment-face nil :italic t)
  (set-face-attribute 'font-lock-doc-face nil :italic t)
  (zenburn-with-color-variables
    (set-face-attribute 'button nil :foreground zenburn-yellow-2)
    (set-face-attribute 'default nil
                        :background zenburn-bg-05
                        :height mp/font-size-default
                        :font mp/font-family)
    (set-face-attribute 'help-argument-name nil :foreground zenburn-orange :italic nil)
    (set-face-attribute 'hl-line nil :background zenburn-bg+1)
    (set-face-attribute 'header-line nil
                        :background zenburn-bg-1
                        :box `(:line-width 2 :color ,zenburn-bg-1)
                        :height mp/font-size-header-line)
    (set-face-attribute 'mode-line nil
                        :box `(:line-width 2 :color ,zenburn-bg-1)
                        :foreground zenburn-bg+3
                        :height mp/font-size-mode-line)
    (set-face-attribute 'mode-line-inactive nil
                        :box `(:line-width 2 :color ,zenburn-bg-05)
                        :foreground zenburn-bg+3
                        :height mp/font-size-mode-line)
    (set-face-attribute 'region nil
                        :background zenburn-fg-1
                        :distant-foreground 'unspecified)
    (set-face-attribute 'vertical-border nil :foreground zenburn-bg))

  ;; NOTE: See https://github.com/bbatsov/zenburn-emacs/issues/278.
  (zenburn-with-color-variables
    (mapc
     (lambda (face)
       (when (eq (face-attribute face :background) zenburn-bg)
         (set-face-attribute face nil :background 'unspecified)))
     (face-list))))
#+END_SRC

*** Setting font faces for headline level
   :PROPERTIES:
   :ID:       59bca88c-42dc-46b6-b556-d8f1eec81931
   :END:
- Note taken on [2019-03-28 Thu 07:09] \\
  This is available as in-built settings for the zenburn theme. However, once the font is changed, the

#+BEGIN_SRC emacs-lisp
(custom-set-faces
 '(org-level-1 ((t (:inherit outline-1 :height 1.2))))
 '(org-level-2 ((t (:inherit outline-2 :height 1.1))))
 '(org-level-3 ((t (:inherit outline-3 :height 1.05))))
 '(org-level-4 ((t (:inherit outline-4 :height 1.00))))
 '(org-level-5 ((t (:inherit outline-5 :height .95))))
 )
#+end_src

#+RESULTS:

** TODO org-babel
:PROPERTIES:
:header-args: tangle no
:END
Since I work a lot with org babel for my mixed code notebooks, this gets it's own section. I would like to incorporate useful scimax customisations for this as well.
- [ ] Incorporate Scimax's customisations in general
- [ ] Particularly incorporate ipython block customisation

*** Languages to load
:PROPERTIES:
:ID:       2FEFFC39-99A5-4C72-A814-008D82B49492
:END:
#+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((clojure . t)
     (scheme . t)
     (sqlite . t)
     (R . t)
     (lisp . t)
     (sql .  t)
     (shell . t)
     ;; (ipython . t)
  ;;   (jupyter . t)
  ;;   (ein . t)
     )
   )
#+end_src

*** TODO Default Header arguments and other options
:PROPERTIES:
:ID:       EC40BAAB-3EC9-4E5C-B90C-806AEDAB83DE
:END:
#+BEGIN_SRC emacs-lisp

(with-eval-after-load 'org
(setq org-babel-default-header-args
'((:session . "none")
(:results . "silent")
(:exports . "code")
(:cache . "no")
(:noweb . "no")
(:hlines . "no")
(:tangle . "no"))))

(with-eval-after-load 'org
  (setq org-confirm-babel-evaluate nil)
  (setq org-confirm-shell-link-function nil)
  (setq org-confirm-elisp-link-function nil))
#+END_SRC

* COMMENT Disabled
:PROPERTIES:
:ID:       50D44546-9A06-4F1D-A582-FAD07286D962
:LINK:     [[nb:.emacs.d::emacs-config.org::c154188]]
:END:

These are packages and snippets that disabled from tangling and execution and placed here for general reference. Some of them have been explored and discarded for various reasons. The rest are packages / features I could not get working satisfactorily.

** Old Hugo export functions
I was using these functions earlier to generate the essential properties
and export a post to hugo. My current workflow is using
ox-hugo. THe functions are slightly modified from where I picked them up
(Holger Scheurig, whose URL seems to be down).
*** Defining content directory
:PROPERTIES:
:ID:       3a7485ab-33cf-4e94-ac93-7063db94a094
:END:
- Note taken on [2019-02-07 Thu 08:06]  \\
  Need to check if this is still required since I have switche to ox-hugo

#+BEGIN_SRC emacs-lisp
(defvar hugo-content-dir "~/my_gits/hugo-sr/content/post/"
  "Path to Hugo's content directory")
#+END_SRC

*** Ensuring properties exist and creating if they dont exist
:PROPERTIES:
:ID:       e5a99a03-c3da-420c-ae9c-9ac6e50ecbdf
:END:

#+BEGIN_SRC emacs-lisp
(defun hugo-ensure-property (property)
  "Make sure that a property exists. If not, it will be created.
Returns the property name if the property has been created, otherwise nil."
  (org-id-get-create)
  (if (org-entry-get nil property)
      nil
    (progn (org-entry-put nil property "")
           property)))

(defun hugo-ensure-properties ()

  (require 'dash)
  (let ((current-time (format-time-string
                       (org-time-stamp-format t t) (org-current-time)))
        first)
    (save-excursion
      (setq first (--first it (mapcar #'hugo-ensure-property
                                      '("HUGO_TAGS" "HUGO_CATEGORIES"))))
      (unless (org-entry-get nil "HUGO_DATE")
        (org-entry-put nil "EXPORT_DATE" current-time)))
    (org-entry-put nil "EXPORT_FILE_NAME" (org-id-get-create))
    (org-entry-put nil "EXPORT_HUGO_CUSTOM_FRONT_MATTER" ":profile false")
    (when first
      (goto-char (org-entry-beginning-position))
      ;; The following opens the drawer
      (forward-line 1)
      (beginning-of-line 1)
      (when (looking-at org-drawer-regexp)
        (org-flag-drawer nil))
      ;; And now move to the drawer property
      (search-forward (concat ":" first ":"))
      (end-of-line))
    first))
#+END_SRC

#+RESULTS:
: hugo-ensure-properties

*** Hugo function calling the above
:PROPERTIES:
:ID:       c677537c-c70b-4be9-b91a-40bc283d5f40
:END:

#+BEGIN_SRC emacs-lisp
(defun hugo ()
  (interactive)
  (unless (hugo-ensure-properties)
    (let* ((type    (concat "type = \"" (org-entry-get nil "HUGO_TYPE") "\"\n"))
           (date     (concat "date = \""
                             (format-time-string "%Y-%m-%d"
                                                 (apply 'encode-time
                                                        (org-parse-time-string
                                                         (org-entry-get nil "HUGO_DATE"))) t) "\"\n"))
           (tags     (concat "tags = [ \""
                             (mapconcat 'identity
                                        (split-string
                                         (org-entry-get nil "HUGO_TAGS")
                                         "\\( *, *\\)" t) "\", \"") "\" ]\n"))
           (fm (concat "+++\n"
                       title
		       type
                       date
                       tags
                       topics
                       "+++\n\n"))
           (coding-system-for-write buffer-file-coding-system)
           (backend  'md)
           (blog))
      ;; try to load org-mode/contrib/lisp/ox-gfm.el and use it as backend
      (if (require 'ox-gfm nil t)
          (setq backend 'gfm)
        (require 'ox-md))
      (setq blog (org-export-as backend t))
      ;; Normalize save file path
      (unless (string-match "^[/~]" file)
        (setq file (concat hugo-content-dir file))
        (unless (string-match "\\.md$" file)
          (setq file (concat file ".md")))
        ;; save markdown
        (with-temp-buffer
          (insert fm)
          (insert blog)
          (untabify (point-min) (point-max))
          (write-file file)
          (message "Exported to %s" file))))))
#+END_SRC

#+RESULTS:
: hugo
