emacs-config.org
** Earlier mu4e config
- Note taken on [2020-04-01 Wed 11:49] \\
  All this content has been transferred to the use package hook.
- Note taken on [2019-02-12 Tue 14:53] \\
  The use-package documentation specifies a method to do this via use-package itself, without enclosing the whole snippet within a if clause.
- Note taken on [2019-02-07 Thu 20:43] \\
  The mu4e config has to be broken down and the send email with htmlize has to be evaluated.
- Note taken on [2019-02-07 Thu 09:04] \\
  As of now, I do not acess my email on different computers via Emacs. The end goal is to setup a mail server via VPS and store my email online, which can then be searched via Emacs and mu4e from any location.

#+BEGIN_SRC emacs-lisp
(if (system-type-is-darwin)
    (progn
      (add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu/mu4e")
      (require 'mu4e)
      (require 'mu4e-contrib)
      (require 'org-mu4e)

      (setq
       mail-user-agent 'mu4e-user-agent
       mue4e-headers-skip-duplicates  t
       mu4e-view-show-images t
       mu4e-view-show-addresses 't
       mu4e-compose-format-flowed t
       ;;mu4e-update-interval 200
       message-ignored-cited-headers 'nil
       mu4e-date-format "%y/%m/%d"
       mu4e-headers-date-format "%Y/%m/%d"
       mu4e-change-filenames-when-moving t
       mu4e-attachments-dir "~/Downloads/Mail-Attachments/"
       mu4e-maildir (expand-file-name "~/my_mail/fmail")
       message-citation-line-format "On %Y-%m-%d at %R %Z, %f wrote..."
       mu4e-index-lazy-check t
       ;; After Years. I've finally found you.
       mu4e-compose-dont-reply-to-self t
       mu4e-headers-auto-update t
       )

      ;; mu4e email refiling loations
      (setq
       mu4e-refile-folder "/Archive"
       mu4e-trash-folder  "/Trash"
       mu4e-sent-folder   "/Sent"
       mu4e-drafts-folder "/Drafts"
       )

      ;; setup some handy shortcuts
      (setq mu4e-maildir-shortcuts
            '(("/INBOX"   . ?i)
	      ("/Sent"    . ?s)
	      ("/Archive" . ?a)
	      ("/Trash"   . ?t)))

      ;;store link to message if in header view, not to header query
      (setq org-mu4e-link-query-in-headers-mode nil
            org-mu4e-convert-to-html t) ;; org -> html


      (autoload 'mu4e "mu4e" "mu for Emacs." t)

      ;; Earlier Config for sending email
      ;; (setq
      ;;  message-send-mail-function 'message-send-mail-with-sendmail
      ;;  send-mail-function 'sendmail-send-it
      ;;  message-kill-buffer-on-exit t
      ;;  )

      ;; allow for updating mail using 'U' in the main view:
      (setq mu4e-get-mail-command  "mbsync -q fins")

      ;; Stolen from https://github.com/djcb/mu/issues/1431 and found thanks to parsnip in #emacs
      (defun my-mu4e-mbsync-current-maildir (msg)
	(interactive)
	(let* ((maildir (downcase (substring (plist-get msg :maildir) 1)))
	       (mu4e-get-mail-command (format "mbsync %s" maildir)))
	  (mu4e-update-mail-and-index t)))

      ;; Enabling view in browser for HTML heavy emails that don't render well
      (add-to-list 'mu4e-view-actions
	           '("ViewInBrowser" . mu4e-action-view-in-browser) t)
      (add-to-list 'mu4e-view-actions
		   '("mbsync maildir of mail at point" . my-mu4e-mbsync-current-maildir) t)

      (add-hook 'mu4e-headers-mode-hook
		(defun my/mu4e-change-headers ()
		  (interactive)
		  (setq mu4e-headers-fields
			`((:human-date . 12)
			  (:flags . 4)
			  (:from-or-to . 15)
			  (:subject . ,(- (window-body-width) 47))
			  (:size . 7)))))

      (add-hook 'mu4e-view-mode-hook (lambda () (fill-paragraph)))
      (setq mu4e-view-use-gnus t)

      ;; Don't keep asking for confirmation for every action
      (defun my-mu4e-mark-execute-all-no-confirm ()
	"Execute all marks without confirmation."
	(interactive)
	(mu4e-mark-execute-all 'no-confirm))
      ;; mapping x to above function
      (define-key mu4e-headers-mode-map "x" #'my-mu4e-mark-execute-all-no-confirm)

      ;; source: http://matt.hackinghistory.ca/2016/11/18/sending-html-mail-with-mu4e/

      ;; this is stolen from John but it didn't work for me until I
      ;; made those changes to mu4e-compose.el
      (defun htmlize-and-send ()
	"When in an org-mu4e-compose-org-mode message, htmlize and send it."
	(interactive)
	(when
	    (member 'org~mu4e-mime-switch-headers-or-body post-command-hook)
	  (org-mime-htmlize)
	  (org-mu4e-compose-org-mode)
	  (mu4e-compose-mode)
	  (message-send-and-exit)))

      ;; This overloads the amazing C-c C-c commands in org-mode with one more function
      ;; namely the htmlize-and-send, above.
      (add-hook 'org-ctrl-c-ctrl-c-hook 'htmlize-and-send t)

      (setq mu4e-update-interval 300)
      (setq message-kill-buffer-on-exit t)

      ;; Config for queued sending of emails
      ;; Reference  :https://vxlabs.com/2017/02/07/mu4e-0-9-18-e-mailing-with-emacs-now-even-better/https://vxlabs.com/2017/02/07/mu4e-0-9-18-e-mailing-with-emacs-now-even-better/

      ;; when switch off queue mode, I still prefer async sending
      (use-package async
	:ensure t
	:defer nil
	:config (require 'smtpmail-async))

      (setq
       send-mail-function 'async-smtpmail-send-it
       message-send-mail-function 'async-smtpmail-send-it
       ;; replace with your email provider's settings
       smtpmail-smtp-server "smtp.fastmail.com"
       smtpmail-smtp-service 465
       smtpmail-stream-type 'ssl

       ;; if you need offline mode, set to true -- and create the queue dir
       ;; with 'mu mkdir', i.e:
       ;; mu mkdir /home/user/Mail/queue && touch ~/Maildir/queue/.noindex
       ;; https://www.djcbsoftware.nl/code/mu/mu4e/Queuing-mail.html
       smtpmail-queue-mail  nil
       smtpmail-queue-dir  (expand-file-name "~/my_mail/fmail/Queue/cur"))

      ))

#+END_SRC

#+RESULTS:
: /Users/shrysr/my_mail/fmail/Queue/cur
** Archival Retain file structure
- Note taken on [2020-04-05 Sun 08:57] \\
  Apparently, a new org version does not have the org-extract-archive-file
  function any more. Otherwise, this was my earlier preferred
  method. However, over time, as the structure of files change, there is
  no real point in preserving the structure as it is. In any case the
  properties of archived entries generally contain enough information to
  re-construct the org entry. 

Archive organised by Top level headings in the original file and with Tag preservation

#+BEGIN_SRC emacs-lisp

(defun my-org-inherited-no-file-tags ()
  (let ((tags (org-entry-get nil "ALLTAGS" 'selective))
        (ltags (org-entry-get nil "TAGS")))
    (mapc (lambda (tag)
            (setq tags
                  (replace-regexp-in-string (concat tag ":") "" tags)))
          (append org-file-tags (when ltags (split-string ltags ":" t))))
    (if (string= ":" tags) nil tags)))

(defadvice org-archive-subtree (around my-org-archive-subtree-low-level activate)
  (let ((tags (my-org-inherited-no-file-tags))
        (org-archive-location
         (if (save-excursion (org-back-to-heading)
                             (> (org-outline-level) 1))
             (concat (car (split-string org-archive-location "::"))
                     "::* "
                     (car (org-get-outline-path)))
           org-archive-location)))
    ad-do-it
    (with-current-buffer (find-file-noselect (org-extract-archive-file))
      (save-excursion
        (while (org-up-heading-safe))
        (org-set-tags-to tags)))))
#+end_src
** ag.el
- Note taken on [2020-03-30 Mon 18:06] \\
  Though helm-do-ag is avialable, this appears to be a separate ag implementation that does not required the separate silver searcher program to be installed in the system. This remains to be verified.

#+BEGIN_SRC emacs-lisp
(straight-use-package 'ag)
#+END_SRC

** Removing timestamp from datetree captures
:PROPERTIES:
:ID:       4ED98157-D6D9-463C-BE2B-FAE5DB1FC3C6
:END:
- Note taken on [2020-04-02 Thu 01:39] \\
  This was needed due to some setting in scimax or an org mode
  update. This is being disabled for the timebeing since I am not using a
  date tree for capture.

#+BEGIN_SRC emacs-lisp
(setq org-datetree-add-timestamp nil)
#+END_SRC

#+RESULTS:
** Theme : Poet
- Note taken on [2020-03-22 Sun 12:41] \\
  Apparently, with a high gloss screen, it makes no difference whether the theme is light or dark. The distracting reflection still exists. Interestingly enough, the macbook pro screen does not reflect much under the same conditions and position with respect to light source.

#+BEGIN_SRC emacs-lisp
(use-package poet-theme
  :straight t
  :config
  (set-face-attribute 'default nil 
		      :family "iA Writer Mono V" 
		      :height 130)
  (set-face-attribute 'fixed-pitch nil :family "Iosevka term")
  (set-face-attribute 'variable-pitch nil :family "iA Writer Duo S")

  (custom-set-faces
   '(org-level-1 ((t (:inherit outline-1 
			       :height 1.5
			       :weight bold))))
   '(org-level-2 ((t (:inherit outline-2 
			       :height 1.3
			       :weight bold))))
   '(org-level-3 ((t (:inherit outline-3 
			       :height 1.2
			       :weight bold))))
   '(org-level-4 ((t (:inherit outline-4
			       :height 1.1
			       :weight bold))))
   '(org-level-5 ((t (:inherit outline-5
			       :height 1.0
			       :weight bold)))))
  ;; Enabling the variable pitch mode
  (add-hook 'text-mode-hook
	    (lambda ()
	      (variable-pitch-mode 1)
	      (visual-line-mode 1)))
  (load-theme 'poet-dark))
#+END_SRC

#+RESULTS:
: t
** Org bullets
:PROPERTIES:
:ID:       0A9A08EC-7693-43CF-85B3-85CAC5129AE1
:END:

- Note taken on [2020-03-23 Mon 08:50] \\
  This appears to slow down the loading of org files considerably. I want a consistent setup that also works well on terminal and across Tramp. There may be better choices to spend this overhead on rather than aesthetics.

#+BEGIN_SRC emacs-lisp :tangle no
(use-package org-bullets
:after (org)
:config
(add-hook 'org-mode-hook 'org-bullets-mode))
#+END_SRC

#+RESULTS:
: t

** Auto-fill text mode
:PROPERTIES:
:ID:       751B3E4C-1BBC-419D-BAD3-8F4A3880FB6D
:END:
- Note taken on [2020-03-22 Sun 15:04] \\
  This seems to introduce some weird characteristics in terms of line
  breakage. Switching off for now.
- Note taken on [2020-03-12 Thu 08:46] \\
  I need to check whether this interferes with mu4e and general org mode usage.

#+BEGIN_SRC emacs-lisp :tangle no
(add-hook 'text-mode-hook 'turn-on-auto-fill)
(add-hook 'org-mode-hook 'turn-on-auto-fill)
#+END_SRC

** Font Customisation based on OS
   :PROPERTIES:
   :ID:       9e3c92e5-1049-4582-b165-0cd3ba7e2d95
   :END:

   - Note taken on [2020-03-22 Sun 12:35] \\
     Disabling this temporarily to work on customising a theme.

The same font is named differently in Antergos (Linux) and in the Mac OS.

#+begin_src emacs-lisp :tangle no
;; For Linux
(if (system-type-is-gnu)
    (set-face-attribute 'default nil :family "ttf-iosevka" :height 130 ))

;; For Mac OS
(if (system-type-is-darwin)
    (set-face-attribute 'default nil :family "Iosevka Type" :height 160 ))
#+end_src

#+RESULTS:

** Org babel load
:PROPERTIES:
:ID:       DDDC0DB7-8E9B-4509-B315-73BEB30F6D29
:END:
- Note taken on [2020-03-22 Sun 11:15] \\
  This is not required. The overhead of tangling during the loading of Emacs is
  too high and unnecessary. It seems a lot more efficient to tangle upon saving the org file, and
  that process can be automated as well, even with an async.

#+BEGIN_SRC emacs-lisp :tangle no
(use-package org)
(org-babel-load-file
 (expand-file-name "config.org"
                   user-emacs-directory))
#+END_SRC

** org-brain
:PROPERTIES:
:header-args: :tangle no
:END:

#+BEGIN_QUOTE
org-brain implements a variant of concept mapping in Emacs, using org-mode.

You can think of org-brain as a combination of a wiki and a mind map, where each wiki page / mind map node is an org-mode file which resides in your org-brain-path, or a headline with an ID property in one of those files. These are called entries. Entries can be linked together, and you can then view the network of links as a mind map, using M-x org-brain-visualize

[[https://github.com/Kungsgeten/org-brain][org-brain on github]]
#+END_QUOTE

*** STABLE Basic setup along with org-id
CLOSED: [2019-04-11 Thu 08:52]
:PROPERTIES:
:ID:       ae3c3f14-d570-4fc0-b3b2-156020ba7c61
:END:

Since org-brain requires the org id for a heading to be recognized and displayed, it is convenient to have capture and refile mechanisms that create the org-id if the heading does not have it.

Further streamlining is necessary as such.

#+BEGIN_SRC emacs-lisp
  (use-package org-brain
    :after org
    :ensure t
    :bind  ("M-s v" . org-brain-visualize)
    :init
    ;; (setq org-brain-path "~/my_org/brain/")
    ;; ;; for Evil users
    ;; (with-eval-after-load 'evil
   ;;   (evil-set-initial-state 'org-brain-visualize-mode 'emacs))
    :config
    (setq org-id-track-globally t)
    (setq org-id-locations-file "~/my_org/emacs_meta/.org-id-locations")
    (push '("b" "Brain" plain (function org-brain-goto-end)
            "* %i%?\n:PROPERTIES:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:" :empty-lines 1)
          org-capture-templates)
    (setq org-brain-visualize-default-choices 'all)
    (setq org-brain-title-max-length 12)
    (add-hook 'org-brain-refile 'org-id-get-create))
;; (global-set-key (kbd "M-s v") #'org-brain-visualize)
#+END_SRC

#+RESULTS:
** Polybrain 
*** Dustin's forked org-brain

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package org-brain
    :straight (org-brain :type git :host github :repo "dustinlacewell/org-brain")
    :after org
    :ensure t
    :bind  ("M-s v" . org-brain-visualize)
    :bind (:map org-brain-visualize-mode-map
              ;; Navigation
              ("C-p" . my/org-brain-visualize-parent)
              ("C-n" . my/org-brain-visualize-child))
    :init
    (setq org-brain-path "~/my_org/brain/")
    ;; ;; For Evil users
    ;; (with-eval-after-load 'evil
   ;;   (evil-set-initial-state 'org-brain-visualize-mode 'emacs))
    :config
    (setq org-id-track-globally t)
    (setq org-id-locations-file "~/my_org/emacs_meta/.org-id-locations")
    (push '("b" "Brain" plain (function org-brain-goto-end)
            "* %i%?\n:PROPERTIES:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:" :empty-lines 1)
          org-capture-templates)
    (setq org-brain-visualize-default-choices 'all)
    (setq org-brain-title-max-length 12)
    (add-hook 'org-brain-refile 'org-id-get-create))
;; (global-set-key (kbd "M-s v") #'org-brain-visualize)
#+END_SRC

*** polybrain navigation helpers
:PROPERTIES:
:ID:       097E6DB9-79E7-4AFB-9533-E625603B60F4
:END:

#+BEGIN_SRC emacs-lisp
;; Source https://gist.github.com/dustinlacewell/e0a7fed577ae0766e3017a4de848b528

(defun my/org-brain-visualize-parent ()
  (interactive)
  (when (org-brain-parents (org-brain-entry-at-pt)) (org-brain-visualize-parent (org-brain-entry-at-pt))))

(defun my/org-brain-visualize-child (entry &optional all)
  (interactive (list (org-brain-entry-at-pt)))
  (when (org-brain-children entry)
    (let* ((entries (if all (org-brain-children entry)
                    (org-brain--linked-property-entries
                     entry org-brain-children-property-name)))
         (child (cond
                 ((equal 1 (length entries)) (car-safe entries))
                 ((not entries) (error (concat entry " has no children")))
                 (t (org-brain-choose-entry "Goto child: " entries nil t)))))
    (org-brain-visualize child))))

#+END_SRC
*** polybrain package
:PROPERTIES:
:ID:       DC735D2F-8395-4C5E-BB66-5918110B02BD
:END:

#+BEGIN_SRC emacs-lisp
  (use-package polybrain
    :defer nil
    :straight (polybrain.el :type git :host github :repo "dustinlacewell/polybrain.el")
    :bind (:map poly-brain-mode-map
                ("C-x C-s" . polybrain-save)
                ("<M-tab>" . polybrain-switch))
:config
(use-package polymode)
(require 'polybrain))

#+END_SRC
