init.el
 (expand-file-name "config.org"
                   user-emacs-directory))
