emacs-config.org
** Scheme setup
  :PROPERTIES:
  :ID:       b60ce433-989d-4339-a573-72550ff61d98
  :END:
  - Note taken on [2019-10-23 Wed 09:21] \\
    I used this briefly during a foray into the SICP course.

- References
  - http://praveen.kumar.in/2011/03/06/gnu-emacs-and-mit-scheme-on-mac-os-x/

#+BEGIN_SRC emacs-lisp
(setq scheme-program-name "/Applications/MIT-GNU-Scheme.app/Contents/Resources/mit-scheme")
(require 'xscheme)

(message "Loaded scheme setup")
#+end_src

** TODO lintr
- Note taken on [2019-02-11 Mon 07:21] \\
  It appears there is no package called lintr. This needs further investigation.

This package is deemed necessary to enable flymake in ESS. Without it, there is significantly more lag while the suggestions / corrections are generated in ESS modes.

#+BEGIN_SRC emacs-lisp
(use-package lintr
  :ensure nil
)
#+END_SRC

#+RESULTS:
: t

** Better defaults
  :PROPERTIES:
  :ID:       8d1243f5-a37d-4d17-b141-d54b862dcb73
  :END:
  - Note taken on [2019-08-28 Wed 13:45] \\
    Disabling this package until it is explored better.

I need to explore the changed made by this package. For now, it is loaded right in the beginning so that it does not overwrite other customisations down the line.

#+BEGIN_SRC emacs-lisp
(use-package better-defaults
  :ensure t
)

(message "Loaded better-defaults package")
#+end_src

** w3m customisation

- Note taken on [2020-01-23 Thu 10:46] \\
  I have switched to using eww for my browsing within Emacs.
w3m is a suprisingly able browser that is able to cater to most websites, except those that are a little too rich with java and etc. Being within Emacs, and launching almost instantly with significantly less overhead in terms of RAM no matter how many tabs are open - it is also easy to customise the behavior as needed and is an excellent method of distraction free browsing.

However, it pays to have handy shortcuts to open a link in the default browser of the OS. This is especially to cater to heavier websites. The w3m package would need to be installed using the package manager of the OS to use w3m.

A few snippets were sourced from: http://beatofthegeek.com/2014/02/my-setup-for-using-emacs-as-web-browser.html

*** Setting default browser to be w3m
:PROPERTIES:
:ID:       EEB1BA54-2032-4022-8353-FA0FEBCB19EC
:END:

#+BEGIN_SRC emacs-lisp
;;(setq browse-url-browser-function 'browse-url-default-browser)
(setq browse-url-browser-function 'w3m-goto-url-new-session)
(setq w3m-default-display-inline-images t)
#+end_src

#+RESULTS:
: t

*** TODO Appending HTTP to web addresses entered by hand
   :PROPERTIES:
   :ID:       675ef613-8495-482e-941c-67b0853adac4
   :END:
- Note taken on [2019-02-07 Thu 07:40]  \\
  Check whether this is necessary

#+BEGIN_SRC emacs-lisp
;;when I want to enter the web address all by hand
(defun w3m-open-site (site)
  "Opens site in new w3m session with 'http://' appended"
  (interactive
   (list (read-string "Enter website address(default: w3m-home):" nil nil w3m-home-page nil )))
  (w3m-goto-url-new-session
   (concat "http://" site)))
#+end_src

#+RESULTS:
: w3m-open-site

*** Changing w3m shortcuts for better tabbed browsing
   :PROPERTIES:
   :ID:       f3b7f225-80fc-4b3a-b31b-b56d2bbf01ca
   :END:

Source:  Sacha Chua : http://sachachua.com/blog/2008/09/emacs-and-w3m-making-tabbed-browsing-easier/

#+BEGIN_SRC emacs-lisp
(eval-after-load 'w3m
  '(progn
     (define-key w3m-mode-map "q" 'w3m-previous-buffer)
     (define-key w3m-mode-map "w" 'w3m-next-buffer)
     (define-key w3m-mode-map "x" 'w3m-close-window)))
#+end_src

#+RESULTS:

*** TODO Default external browser settings
   :PROPERTIES:
   :ID:       c59e3f50-35d4-4939-a05e-0b3e97976963
   :END:
- Note taken on [2019-02-07 Thu 07:37]  \\
  Need to have this change depending whether the OS is Linux or Mac OS

#+BEGIN_SRC emacs-lisp
(defun wicked/w3m-open-current-page-in-default-browser ()
  "Open the current URL in Mozilla Firefox."
  (interactive)
  (browse-url-default-browser w3m-current-url)) ;; (1)

(defun wicked/w3m-open-link-or-image-in-default-browser ()
  "Open the current link or image in Firefox."
  (interactive)
  (browse-url-default-browser (or (w3m-anchor) ;; (2)
                                         (w3m-image)))) ;; (3)

(eval-after-load 'w3m
  '(progn
     (define-key w3m-mode-map "o" 'wicked/w3m-open-current-page-in-default-browser)
     (define-key w3m-mode-map "O" 'wicked/w3m-open-link-or-image-in-default-browser)))
#+end_src

#+RESULTS:

** ediff
  :PROPERTIES:
  :ID:       969553a4-6279-4566-b751-51218fedb41f
  :END:

I have to diff between org files pretty often, and need the headings to be unfolded.

Source: http://emacs.stackexchange.com/questions/21335/prevent-folding-org-files-opened-by-ediff

#+BEGIN_SRC emacs-lisp
;; Check for org mode and existence of buffer
(defun f-ediff-org-showhide (buf command &rest cmdargs)
  "If buffer exists and is orgmode then execute command"
  (when buf
    (when (eq (buffer-local-value 'major-mode (get-buffer buf)) 'org-mode)
      (save-excursion (set-buffer buf) (apply command cmdargs)))))

(defun f-ediff-org-unfold-tree-element ()
  "Unfold tree at diff location"
  (f-ediff-org-showhide ediff-buffer-A 'org-reveal)
  (f-ediff-org-showhide ediff-buffer-B 'org-reveal)
  (f-ediff-org-showhide ediff-buffer-C 'org-reveal))

(defun f-ediff-org-fold-tree ()
  "Fold tree back to top level"
  (f-ediff-org-showhide ediff-buffer-A 'hide-sublevels 1)
  (f-ediff-org-showhide ediff-buffer-B 'hide-sublevels 1)
  (f-ediff-org-showhide ediff-buffer-C 'hide-sublevels 1))

(add-hook 'ediff-select-hook 'f-ediff-org-unfold-tree-element)
(add-hook 'ediff-unselect-hook 'f-ediff-org-fold-tree)
#+end_src

** Spell Checking

*** Flycheck
- Note taken on [2019-02-09 Sat 11:51] \\
  disabling flycheck for the moment and enabling flymake

Source: https://writequit.org/org/

Basic config

#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :defer 5
  :bind (("M-g M-n" . flycheck-next-error)
         ("M-g M-p" . flycheck-previous-error)
         ("M-g M-=" . flycheck-list-errors))
  :init (global-flycheck-mode)
  :diminish flycheck-mode
  :config
  (progn
    (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc json-jsonlint json-python-json ess iess))
    (use-package flycheck-pos-tip
      :init (flycheck-pos-tip-mode))
    (use-package helm-flycheck
      :init (define-key flycheck-mode-map (kbd "C-c ! h") 'helm-flycheck))
    (use-package flycheck-haskell
      :init (add-hook 'flycheck-mode-hook #'flycheck-haskell-setup))))
#+END_SRC

#+RESULTS:
: flycheck-list-errors

*** Enabling Flyspell

Reference: https://alhassy.github.io/init/

Org mode is derived from text mode, therefore it is sufficient to activate for text mode.

#+BEGIN_SRC emacs-lisp
(use-package flyspell
  :hook (
           (prog-mode . flyspell-prog-mode)
           (text-mode . flyspell-mode))
)
#+END_SRC

#+RESULTS:
| flyspell-mode | er/add-text-mode-expansions | dubcaps-mode | flycheck-mode | text-mode-hook-identify |

*** Replacing flycheck with flymake
   :PROPERTIES:
   :ID:       68a17c10-540a-48ce-bf16-6b891060bd79
   :END:
This is especially for python modules at the moment.

#+BEGIN_SRC emacs-lisp
(when (require 'flycheck nil t)
  (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
  (add-hook 'elpy-mode-hook 'flycheck-mode))
#+END_SRC

#+RESULTS:
| flymake-mode | poly-r-mode-setup | ess-S-mouse-me-menu-commands | ess-r-setup-flymake |

*** STABLE Switching to aspell on the mac
CLOSED: [2019-07-12 Fri 20:23]
:PROPERTIES:
:ID:       7dfcba0b-55f4-4cbe-aa34-c155935aa0da
:END:
- Note taken on [2019-07-12 Fri 20:22] \\
  So far this is working out rather well, and as expected.

Facing trouble enabling flyspell in the mac. This seems to be a solution, as outlined in [[https://stackoverflow.com/questions/19022015/emacs-on-mac-os-x-how-to-get-spell-check-to-work][this SO discussion]].

#+BEGIN_SRC emacs-lisp
(if (system-type-is-darwin)
    (setq ispell-program-name "/usr/local/Cellar/aspell/0.60.6.1_1/bin/aspell")
  )

#+END_SRC

#+RESULTS:
: /usr/local/Cellar/aspell/0.60.6.1_1/bin/aspell
** Old Scimax stuff

These packages and customisations are the ones I enjoy using from Scimax. Note that these have to be customised and patched at the moment and I am working on an optimal solution to port the necessary packages, while maintaining some semblance of compatibility with the upstream.

*** Setting the scimax directory
:PROPERTIES:
:ID:       977B7B1D-29CA-4096-8413-6ECDDED932C2
:END:
- Note taken on [2020-03-11 Wed 17:32] \\
  Some package here seems to be interfering with tramp. Functions can be loaded selectively using straight.el, and this helps keeps things lighter as well. Adding the scimax directory to the path seems to trigger the tramp issue. The scimax directory is being defined, because it is used in the packages. Using straight.el changes the location of the scimax directory.

#+BEGIN_SRC emacs-lisp :tangle no
;;  (add-to-list 'load-path "./scimax")
  (defconst scimax-dir (file-name-directory (or load-file-name (buffer-file-name)))
    "Directory where the scimax is installed.")
  ;; (defvar scimax-dir "./scimax")
#+END_SRC

*** Various scimax packages
:PROPERTIES:
:ID:       FBCA07CC-C0AF-4159-A71E-5D2827F01876
:header-args: :tangle no
:END:
**** MY scimax packages
:PROPERTIES:
:ID:       AD6CDDD5-E3B4-41CC-B1A0-67E9E9348077
:END:

#+BEGIN_SRC emacs-lisp
    ;; (defconst scimax-dir (file-name-directory (or load-file-name (buffer-file-name)))

    (defconst scimax-dir "./straight/repos/scimax")

    (use-package helm-bibtex)

    (use-package helm-projectile)

    ;; Functions for working with hash tables
    (use-package ht)

    (use-package htmlize)

    (use-package hy-mode)

    (use-package hydra
      :init
      (setq hydra-is-helpful t)

      :config
      (require 'hydra-ox))

    (use-package ivy-hydra)

    (use-package jedi)

    (use-package jedi-direx)

    (use-package diminish)

    ;; (use-package avy)

  (use-package pydoc)

  (use-package pyvenv
  :config
  (require 'pyvenv))

  (use-package rainbow-mode)

  (use-package elpy
    :config
    (elpy-enable))

  (use-package esup)

  ;; Provides functions for working with files
  (use-package f)

  (straight-use-package 'dash)
  (straight-use-package 'dash-functional)
  (straight-use-package 'ov)
(straight-use-package 'flx)

  (use-package auto-complete
    :diminish auto-complete-mode
    :config (ac-config-default))

(use-package google-this
  :config
  (google-this-mode 1))

(use-package org-mime
  :ensure nil
  :load-path (lambda () (expand-file-name "org-mime" scimax-dir))
  :init (setq org-mime-up-subtree-heading 'org-back-to-heading
	      org-mime-export-options '
(:section-numbers nil
		  :with-author nil
		  :with-toc nil
		  :with-latex dvipng)))

(straight-use-package 'auctex)

(use-package auto-complete
  :diminish auto-complete-mode
  :config (ac-config-default))

(use-package s)
#+END_SRC

#+RESULTS:

**** scimax-org
:PROPERTIES:
:ID:       055A34FB-F13E-4521-9BAF-C4C785F20F5F
:END:

This requires the scimax-ob-ipython-upstream package, as well as a bunch of
other packages. This has to be evaluated and pruned as required. List of
packages being used by scimax-org are :

1. [ ] scimax-org-radio-checkbox
2. [ ] scimax-org-latex : for latex based overlays in org documents
3. [X] scimax-ob-ipython-upstream : the enhancements and monkeypatches over
   the upstream ob-ipython package


#+BEGIN_SRC emacs-lisp
  (straight-use-package 'emacsql-sqlite)
  (straight-use-package 'gitter)

  (use-package scimax-org
    :straight (scimax-org :host github :repo "jkitchin/scimax")
    :bind
    ("s--" . org-subscript-region-or-point)
    ("s-=" . org-superscript-region-or-point)
    ("s-i" . org-italics-region-or-point)
    ("s-b" . org-bold-region-or-point)
    ("s-v" . org-verbatim-region-or-point)
    ("s-c" . org-code-region-or-point)
    ("s-u" . org-underline-region-or-point)
    ("s-+" . org-strikethrough-region-or-point)
    ("s-4" . org-latex-math-region-or-point)
    ("s-e" . ivy-insert-org-entity)
      )

#+END_SRC

#+RESULTS:
: ivy-insert-org-entity

**** scimax literate programming

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package scimax-literate-programming
    :straight (scimax-literate-programming :host github :repo "jkitchin/scimax"))
#+END_SRC

#+RESULTS:

**** scimax-hydra
:PROPERTIES:
:ID:       D3004CAB-BFAF-48B8-8FBA-7CB75FC33007
:END:

#+BEGIN_SRC emacs-lisp
    ;; Apparently the following packages are required to compile scimax-hydra

    (use-package evil
      :straight t
      :init
      (setq evil-want-integration nil)
      ;; :config
      ;; (evil-mode 1)
  )

    (straight-use-package 'evil-collection)
    (use-package general
      :straight t
      :config
      (setq general-override-states '(emacs
                                      hybrid
                                      normal
                                      visual
                                      motion
                                      operator
                                      replace))
      (general-override-mode)
      (general-define-key
       :states '(normal visual motion)
       :keymaps 'override
       "SPC" 'scimax/body))

      (use-package scimax-hydra
        :straight (scimax-hydra :host github :repo "jkitchin/scimax")
        :bind ("<f12>" . scimax/body))
#+END_SRC

#+RESULTS:
: scimax/body

**** scimax-journal
:PROPERTIES:
:ID:       61A12586-DAA7-4601-92F3-DD688B9725D5
:END:

#+BEGIN_SRC emacs-lisp
    (use-package scimax-journal
      :after scimax-org
      :init (setq scimax-journal-root-dir "~/my_org/journal/")
      :bind ("H-j" . scimax-journal/body)
      :straight (scimax-journal :host github :repo "jkitchin/scimax"))
#+END_SRC

#+RESULTS:
: scimax-journal/body

**** scimax-yas
:PROPERTIES:
:ID:       259205AA-4D49-4917-B79D-0A785822C33F
:END:

#+BEGIN_SRC emacs-lisp
  (use-package scimax-yas
    :after scimax-org
    :straight (scimax-yas :host github :repo "jkitchin/scimax"))
#+END_SRC

#+RESULTS:

**** scimax utils

#+BEGIN_SRC emacs-lisp
  (use-package scimax-utils
    :straight (scimax-utils :host github :repo "jkitchin/scimax"))
#+END_SRC

#+RESULTS:

**** scimax-ivy
:PROPERTIES:
:ID:       5883CE00-AEAE-46E3-8C47-B74554B7F0CD
:END:
#+BEGIN_SRC emacs-lisp
  (use-package scimax-ivy
    :after scimax-org
    :straight (scimax-ivy :host github :repo "jkitchin/scimax"))
#+END_SRC

#+RESULTS:

